[
  {
    "title": "MECH 321 Properties and Failure of Materials",
    "credits": 3.5,
    "prerequisites": "MECH 221 / MIAE 221.",
    "corequisites": "",
    "description": "This course covers the following topics: the service capabilities of alloys and their relationship to microstructure as produced by thermal and mechanical treatments; tensile and torsion tests; elements of dislocation theory; strengthening mechanisms; composite materials; modes of failure of materials; fracture, fatigue, wear, creep, corrosion; failure analysis; material codes; material selection for design.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory",
    "notes": "Students who have received credit for AERO 481 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 343 Theory of Machines",
    "credits": 3.5,
    "prerequisites": "ENGR 213, ENGR 233, ENGR 243.",
    "corequisites": "",
    "description": "Introduction to mechanisms; position and displacement; velocity; acceleration; synthesis of linkage; robotics; static force analysis; dynamic force analysis; forward kinematics and inverse kinematics; introduction to gear analysis and gear box design; kinematic analysis of spatial mechanisms.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 344 Machine Element Design",
    "credits": 3,
    "prerequisites": "ENGR 244, MECH 313/ MIAE 313.",
    "corequisites": "MECH 343.",
    "description": "This course presents the basic principles employed in the design of standard mechanical components such as spur gears, shafts and rolling element bearings subjected to operating force and moment fields. The course highlights the adaptation of theoretical stress relationships to practical design problems.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": "Students who have received credit for MECH 441 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 351 Thermodynamics II",
    "credits": 3.5,
    "prerequisites": "ENGR 251.",
    "corequisites": "",
    "description": "Brief review of ideal gas processes. Semi-perfect gases and the gas tables. Mixtures of gases, gases and vapours, air conditioning processes. Combustion and combustion equilibrium. Applications of thermodynamics to power production and utilization systems: study of basic and advanced cycles for gas compression, internal combustion engines, power from steam, gas turbine cycles, and refrigeration. Real gases.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 352 Heat Transfer I",
    "credits": 3.5,
    "prerequisites": "ENGR 311, ENGR 361.",
    "corequisites": "",
    "description": "Analytical and numerical methods for steady-state and transient heat conduction. Empirical and practical relations for forced- and free-convection heat transfer. Radiation heat exchange between black bodies, and between non-black bodies. Gas radiation. Solar radiation. Effect of radiation on temperature measurement.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 361 Fluid Mechanics II",
    "credits": 3.5,
    "prerequisites": "ENGR 361.",
    "corequisites": "",
    "description": "This course covers elements of fluid mechanics, building on topics introduced in ENGR 361. Topics include t he mechanical properties of fluids and the concepts of stress and strain in fluid mechanics. The continuity equation is discussed. The stream function, velocity potential and vorticity are introduced as well as potential irrotational flows. The Navier -Stokes Equations and their elementary solutions are discussed. Students are introduced to laminar and turbulent flows, flows around solid bodies, boundary layers, separation and wakes. Finally, compressible flows are introduced.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 368 Electronics for Mechanical Engineers",
    "credits": 3.5,
    "prerequisites": "PHYS 205; MIAE 215.",
    "corequisites": "",
    "description": "This course covers the following topics: voltage and current dividers, voltage and current sources, Thevenin and Norton equivalent sources; semiconductors and diodes; amplifiers and switches; operational amplifiers; digital logic components and circuits (flip-flops, registers, memories, MUX/DEMUX, etc. ); digital systems; digital communication and computer architecture.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": "Electrical Engineering and Computer Engineering students may not take this course for credit. Students who have received credit for MECH 470 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 370 Modelling and Analysis of Dynamic Systems",
    "credits": 3.5,
    "prerequisites": "PHYS 205, ENGR 213, ENGR 243 / ENGR 245.",
    "corequisites": "ENGR 311.",
    "description": "Definition and classification of dynamic systems and components. Modelling of dynamic systems containing individual or mixed mechanical, electrical, fluid and thermal elements. Block diagrams representation and simulation techniques using MATLAB/Simulink. Time domain analysis. Transient and steady-state characteristics of dynamic systems. Linearization. Transfer functions. Introduction to feedback control systems.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": "Students who have received credit for ELEC 370 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "summer",
      "winter"
    ]
  },
  {
    "title": "MECH 371 Analysis and Design of Control Systems",
    "credits": 3.75,
    "prerequisites": "ENGR 311; MECH 370.",
    "corequisites": "",
    "description": "This course deals with the fundamental principles of control systems. The course develops the basic understanding of control system theory and its role in engineering design. Students are exposed to many practical problems and their solutions. The laboratory work presents the opportunity to experiment with actual control systems hardware. This course covers the following topics: Stability of linear feedback systems; root-locus method; frequency response concepts; f eedback system design using root locus techniques; compensator concepts and configurations; PID-controller design; simulation and computer-aided controller design using Matlab /Simulink.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 3 hours per week, alternate weeks",
    "notes": "Students who have received credit for ELEC 372 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 373 Instrumentation and Measurements",
    "credits": 3.5,
    "prerequisites": "ENGR 311; AERO 371 / MECH 370.",
    "corequisites": "",
    "description": "This course covers the following topics: unified treatment of measurement of physical quantities; static and dynamic characteristics of instruments (calibration, linearity, precision, accuracy, and bias and sensitivity drift); sources of errors; error analysis; experiment planning; data analysis techniques; principles of transducers; signal generation, acquisition and processing; principles and designs of systems for measurement of position, velocity, acceleration, pressure, force, stress, temperature, flow-rate, and proximity detection. The course includes demonstration of various instruments.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week",
    "notes": "Students who have received credit for MECH 411 may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "MECH 375 Mechanical Vibrations",
    "credits": 3.5,
    "prerequisites": "AERO 371 / MECH 370.",
    "corequisites": "",
    "description": "This course covers the following topics: transient and steady-state vibrations under periodic, impulsive shock and arbitrary excitation; m ulti-degree-of-freedom systems ( free and forced response, influence coefficients, orthogonality principle, and numerical methods); i ntroduction to free vibrations of prismatic bars; Lagrange's equations; vibration measurement and control.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": "Students who have received credit for MECH 443 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "summer",
      "winter"
    ]
  },
  {
    "title": "MECH 390 Mechanical Engineering Design Project",
    "credits": 3.5,
    "prerequisites": "MECH 311 / MIAE 311, MECH 343, MIAE 380.",
    "corequisites": "MECH 344.",
    "description": "This course covers the following topics: the design process; product cost, quality and time to market, open and concept design problems, problem description; geometric and type synthesis; direct and inverse design problems; material selection and load determination; mathematical modelling, analysis, and validation; introduction to Computer-Aided Design and Engineering (CAD and CAE); product evaluation for performance, tolerance, cost, manufacture, assembly, and other measures; design documentation. A team-based design project is an intrinsic part of this course.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 1 hour per week",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 412 Computer-Aided Mechanical Design",
    "credits": 3.5,
    "prerequisites": "MECH 311 / MIAE 311.",
    "corequisites": "",
    "description": "This course is an introduction to computational tools in the design process. The following topics are covered: introduction to the fundamental approaches to computer-aided geometric modelling, physical modelling and engineering simulations; establishing functions and functional specifications with emphasis on geometric tolerancing and dimensioning, manufacturing and assembly evaluation.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "MECH 414 Computer Numerically Controlled Machining",
    "credits": 3.5,
    "prerequisites": "MECH 311 / MIAE 311.",
    "corequisites": "MIAE 312.",
    "description": "This course focuses on computer-aided design and manufacturing (CAD/CAM) hardware and software. The following topics are covered: essentials of Computer Numerical Control (CNC) machine tools and systems; process planning and tooling systems for CNC machining, theory of CNC programming of sculptured parts; multi-axis CNC tool path generation; project using CAD/CAM software; CATIA for complex mechanical parts design and a CNC machine tool to manufacture parts.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 415 Advanced Programming for Mechanical and Industrial Engineers",
    "credits": 3,
    "prerequisites": "MECH 215 / MIAE 215.",
    "corequisites": "",
    "description": "This course focuses on class definitions. The following topics are covered: designing classes and member functions; constructors and destructors; class libraries and their uses; input and output; data abstraction and encapsulation; introduction to software engineering; computer graphics and visualization; numerical methods; advanced mechanical and industrial engineering applications. This course includes a substantial project.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "MECH 421 Mechanical Shaping of Metals and Plastics",
    "credits": 3.5,
    "prerequisites": "MECH 221 / MIAE 221.",
    "corequisites": "",
    "description": "This course focuses on metal forming: extrusion, forging, rolling, drawing, pressing, compacting; shear line theory, sheet forming limits; metal cutting, machinability, tooling; plastics shaping: extrusion, moulding, vacuum forming; consideration of the mechanical parameters critical for process control and computer applications; interaction of materials characteristics with processing to define product properties (cold working, annealing, hot working, super plasticity, thermomechanical treatment); energy conservation, safety, product quality, and liability.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 422 Mechanical Behaviour of Polymer Composite Materials",
    "credits": 3,
    "prerequisites": "ENGR 233, ENGR 244; MECH 221 / MIAE 221.",
    "corequisites": "",
    "description": "This course focuses on general applications of polymer composite materials in aircraft, aerospace, automobile, marine, recreational, and chemical processing industries. The following topics are covered: mechanics of a unidirectional lamina; transformation of stress, strain, modulus, and compliance; off-axis engineering constants, shear and normal coupling coefficients; in-plane and flexural stiffness and compliance with different laminates, including cross-ply, angle-ply, quasiisotropic, and general bidirectional laminates; hygrothermal effects; strength of laminates and failure criteria; micromechanics.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "MECH 423 Casting, Welding, Heat Treating, and Non-Destructive Testing",
    "credits": 3.5,
    "prerequisites": "MECH 221 / MIAE 221.",
    "corequisites": "",
    "description": "This course focuses on comparative analysis of the various techniques of casting, welding, powder fabrication, finishing, and non-destructive testing. The following topics are covered: consideration of the control parameters that are essential to define both automation and robot application; materials behaviour which determines product micro-structure and properties; technology and theory of solidification, normalizing, quenching, surface hardening, tempering, aging, and thermomechanical processing for steels, cast irons and Al, Cu, Ni and Ti alloys; energy conservation, worker safety, quality control, and product liability.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "MECH 424 MEMS — Design and Fabrication",
    "credits": 3.5,
    "prerequisites": "MECH 311 / MIAE 311, MECH 343.",
    "corequisites": "MIAE 312.",
    "description": "This course is an introduction to microsystems and devices; mechanical properties of materials used in microsystems; microfabrication and post-processing techniques; sacrificial and structural layers; lithography, deposition and etching; introduction and design of different types of sensors and actuators; micromotors and other microdevices; mechanical design, finite element modelling; design and fabrication of free-standing structures; microbearings; special techniques: double-sided lithography, electrochemical milling, laser machining, LIGA, influence of IC fabrication methods on mechanical properties; application examples in biomedical, industrial, and space technology areas; integration, bonding and packaging of MEMS devices.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "MECH 425 Manufacturing of Composites",
    "credits": 3.5,
    "prerequisites": "MECH 311 / MIAE 311.",
    "corequisites": "MIAE 312.",
    "description": "This course focuses on fibres and resins. The following topics are covered: hand lay up; autoclave curing; compression molding; filament winding; resin transfer molding; braiding. Injection molding; cutting; joining; thermoset and thermoplastic composites; Polymer Nanocomposites; process modelling and computer simulation; non-destructive evaluation techniques.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "MECH 426 Stress and Failure Analysis of Machinery",
    "credits": 3,
    "prerequisites": "ENGR 233, ENGR 244; AERO 481 / MECH 321.",
    "corequisites": "",
    "description": "Analysis of stresses, strains and deformations in machine elements; non-symmetric bending of beams; shear centre for thin-walled beams; curved beams; torsion of non-circular shafts and tubes; thick wall cylinders; plates and shells; contact elements; stress concentrations; energy methods; failure modes, analysis and prevention; buckling, fracture, fatigue and creep.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "MECH 428 Failure Analysis of Machine Systems",
    "credits": 3,
    "prerequisites": "MECH 344.",
    "corequisites": "",
    "description": "This course presents the failure analysis principles employed in the design of mechanical components such as belt and chain drives, helical and bevel gears, bolted and welded joints subjected to operating force and moment fields. The course highlights advanced topics of mechanical components to practical design problems. Students are required to complete assignments including tests, examinations and a course project as a means of assessing their ability to apply the generic approaches discussed to real-life mechanical engineering design problems.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "MECH 444 Guided Vehicle Systems",
    "credits": 3,
    "prerequisites": "MECH 375.",
    "corequisites": "",
    "description": "Definition and classification of guided transportation systems. Track characterization: alignment, gage, profile, and cross-level irregularities. Wheel-rail interactions: rolling contact theories, creep forces. Modelling of guided vehicle components: wheel set, suspension, truck and car body configurations, suspension characteristics. Performance evaluation: stability hunting, ride quality. Introduction to advanced vehicles.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "MECH 447 Fundamentals of Vehicle System Design",
    "credits": 3,
    "prerequisites": "MECH 343.",
    "corequisites": "MECH 375.",
    "description": "This course covers the following topics: tire mechanics; performance characteristics of road vehicles such as maximum acceleration, velocity and gradability; driving condition diagrams; brake system design, braking performance, ideal braking force distribution, braking efficiency, and antilock braking system; handling characteristics, steady-state and transient responses to steering inputs, transient measurement methods, and directional stability; ride analysis, suspension system design and modelling, and simple ride models. This course includes case studies using Car Sim and m ini projects.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "MECH 451 Renewable Energy: Fundamentals and Applications",
    "credits": 3,
    "prerequisites": "MECH 351, MECH 352, MECH 361.",
    "corequisites": "",
    "description": "This course introduces the fundamental aspects and the main applications of renewable energy systems. The focus is on the thermodynamics, heat transfer and fluid mechanics aspects of renewable energy systems. The course covers the following topics: review of thermodynamics, review of heat transfer, review of fluid mechanics, solar energy, wind energy, hydropower, geothermal energy, biomass energy, ocean energy and hydrogen and fuel cells.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 452 Heat Transfer II",
    "credits": 3.5,
    "prerequisites": "MECH 351, MECH 352, MECH 361.",
    "corequisites": "",
    "description": "Heat exchangers. Condensation and boiling heat transfer. Principles of forced convection. Analysis of free convection from a vertical wall. Correlations for free convection in enclosed spaces. Mass transfer. Special topics of heat transfer.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 453 Heating, Ventilation and Air Conditioning Systems",
    "credits": 3,
    "prerequisites": "MECH 352.",
    "corequisites": "",
    "description": "This course covers the following topics: heating and cooling load calculation; overview of heating and air conditioning systems; review of v apour compression refrigeration cycles, refrigerant properties, and psychometrics; performance characteristics of components (evaporators, condensers, compressors, and throttling devices, such as expansion valves and capillary tubes); system performance characteristics (calculation of system operating conditions based on the capacities of its components and outdoor and indoor conditions); d efrosting; estimation of energy consumption for heating with heat pumps; fundamentals of refrigerant piping, water piping, and air distribution systems.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 454 Vehicular Internal Combustion Engines",
    "credits": 3,
    "prerequisites": "MECH 351, MECH 361.",
    "corequisites": "",
    "description": "Mechanical design of vehicular engines for different applications. Gas exchange and combustion engine processes. Combustion chambers design. Fuels for vehicular engines. Fuel supply, ignition and control systems. Cooling and lubrication of engines. Emissions formation and control. Engines' operational characteristics — matching with vehicles. Enhancement of engine performance. Engine testing. Environmental impact of vehicular engines on global pollution. Recent developments in energy efficient and “clean” engines. Design or calculation project of vehicular engine.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 460 Finite Element Analysis",
    "credits": 3.75,
    "prerequisites": "ENGR 244, ENGR 391.",
    "corequisites": "",
    "description": "Formulation and application of the finite element method to modelling of engineering problems, including stress analysis, vibrations, and heat transfer. Examples illustrating the direct approach, as well as variational and weighted residual methods. Elements and interpolation functions. Meshing effect. Error analysis. One- and two-dimensional boundary value problems. Development of simple programs and direct experience with general purpose packages currently used in industry for design problems.",
    "components": "Lecture 3 hours per week; Laboratory 3 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 461 Gas Dynamics",
    "credits": 3.5,
    "prerequisites": "MECH 361.",
    "corequisites": "",
    "description": "Review of one-dimensional compressible flow. Normal and oblique shock waves; Prandtl-Meyer flow; combined effects in one-dimensional flow; non-ideal gas effects; multi-dimensional flow; linearized flow; method of characteristics. Selected experiments in supersonic flow, convergent-divergent nozzles, hydraulic analog and Fanno tube.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "MECH 463 Fluid Power Control",
    "credits": 3.5,
    "prerequisites": "ENGR 361; MECH 371.",
    "corequisites": "",
    "description": "This course is an introduction to fluid power; pneumatic devices; fluidic devices; hydraulic system components; hydraulic and electro-hydraulic systems; dynamic performance of fluid power systems; fluid logic.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "MECH 468 Wind Turbine Engineering",
    "credits": 3,
    "prerequisites": "MECH 343, MECH 361.",
    "corequisites": "MECH 344, MECH 371.",
    "description": "This course is designed to cover the theoretical and practical areas pertinent to the operation of wind turbines. The following topics are covered: energy in the wind; aerodynamic drag and lift of turbine blades; horizontal axis and vertical axis wind turbine designs; generators; control systems; mechanical load analysis such as blade, tower, generator and gearbox; blade and tower design; turbine braking; economical, environmental and safety aspects. Notes: Students who have received credit for MECH 462 may not take this course for credit.",
    "components": null,
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 471 Microcontrollers for Mechatronics",
    "credits": 3.5,
    "prerequisites": "ENGR 311; MECH 368.",
    "corequisites": "",
    "description": "Introduction to the concepts and practices of microcontrollers and their application for the control of electromechanical devices and systems. Study of the internal architecture of microcontrollers; programming in assembly language for specific microcontroller functions and controller algorithms; timing of the microcontroller and interfacing with peripheral devices. Students undertake hands-on project work by controlling the position or speed of a DC motor with a feed-back sensor.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 472 Mechatronics and Automation",
    "credits": 3.5,
    "prerequisites": "MECH 215 / MIAE 215.",
    "corequisites": "MECH 371.",
    "description": "This course focuses on design and analysis of mechatronic and automation systems. The following topics are covered: selection and integration of actuators, sensors, hardware, and software; computer vision; programming and software design for mechatronic systems; modelling and simulation; design of logic control systems; finite state machine methods; feedback control and trajectory generation; safety logic systems; case studies including automation systems, mobile robots, and unmanned vehicle systems.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 473 Control System Design",
    "credits": 3.5,
    "prerequisites": "ELEC 372 / MECH 371.",
    "corequisites": "",
    "description": "Analog and digital controller designs. Analog controllers: lead/lag compensators, pole placement, model matching, two-parameter configuration, plant input/output feedback configuration. Digital controllers: difference equations, Z-transform, stability in the Z-domain, digital implementation of analog controllers, equivalent digital plant method, alias signals, selection of sampling time. Introduction to analog/digital state-space: controllability, observability, state feedback, state estimator. PI and PID controllers. Simulink assignments and project. Hardware laboratory project: analog and digital controller design for motor with inertial plus generator load.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "MECH 474 Mechatronics",
    "credits": 3.75,
    "prerequisites": "ELEC 372 / MECH 371.",
    "corequisites": "",
    "description": "Introduction to mechatronics; basic elements of mechatronic systems. Measurement systems: including principles of measurement systems; sensors and transducers; signal conditioning processes and circuits; filters and data acquisition. Actuation systems: mechanical actuation systems and electrical actuation systems. Controllers: control modes; PID controller; performance measures; introduction to digital controllers and robust control. Modelling and analysis of mechatronic systems; performance measures; frequency response; transient response analysis; stability analysis.",
    "components": "Lecture 3 hours per week; Laboratory 3 hours per week, alternate weeks",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "MECH 476 Generative Design and Manufacturing in Engineering",
    "credits": 3,
    "prerequisites": "MECH 313 / MIAE 313.",
    "corequisites": "AERO 390 / MECH 390.",
    "description": "Generative design is a form-finding process that can mimic nature's evolutionary approach to design. It can start with design goals and then explore innumerable possible permutations of a solution to find the best option. This course provides fundamental information on generative design and manufacturing in engineering. The core techniques from mathematics to artificial intelligence that are commonly used in the creative industry are discussed. The formal paradigms and algorithms used for generation as well as cloud computing are also covered.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "MECH 490 Capstone Mechanical Engineering Design Project",
    "credits": 6,
    "prerequisites": "ENGR 301; MECH 344, MECH 390; MIAE 312.",
    "corequisites": "",
    "description": "This course includes a supervised design, simulation or experimental capstone design project including a preliminary project proposal with complete project plan and a technical report at the end of the fall term; a final report by the group and presentation at the end of the winter term.",
    "components": "Lecture 1 hour per week, one term; Laboratory Equivalent time, 5 hours per week, two terms",
    "notes": "Students work in groups under direct supervision of a faculty member. With permission of the Department, students may enrol in AERO 490 instead of MECH 490.",
    "offeredIn": [
      "fall/winter"
    ]
  },
  {
    "title": "MECH 498 Topics in Mechanical Engineering",
    "credits": 3,
    "prerequisites": "Permission of the Department Chair is required.",
    "corequisites": "",
    "description": "This course may be offered in a given year upon the authorization of the Mechanical, Industrial and Aerospace Engineering Department. The course content may vary from offering to offering and will be chosen to complement the elective courses available in a given option or options.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": []
  }
]