[
    {
        "title": "LING 200 Introduction to Linguistic Science",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course provides an introduction to the principles of general linguistics for beginners in the field. There is an emphasis on synchronic linguistic analysis, with a brief examination of historical and comparative linguistics.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 222 Language and Mind: The Chomskyan Program",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course uses language as a tool to examine the workings of the human mind. It approaches the study of language from the perspective of generative grammar as developed by Noam Chomsky and his collaborators. It deals with patterns of linguistic structure, rather than content or meaning. The goal of this course is to develop an understanding of the field of cognitive science (the study of knowledge and the mind/brain) and determine how linguistics fits in with disciplines like the study of vision, auditory perception and reasoning.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under a LING 398 number may not take this course for credit."
    },
    {
        "title": "LING 298 Selected Topics in Linguistics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "LING 300 Sociolinguistics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies the beliefs, interrelationships, and values of societal groups as reflected in language.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 315 Syntax",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 200 with a grade of C or higher.",
        "corequisites": "",
        "description": "This course introduces students to syntactic theory in the generative tradition. Topics include structure‑building operations, constituency, a variety of movement phenomena, and the relationship between the lexicon and syntactic computation. The focus is on contemporary theoretical frameworks but the course also includes some discussion of how these developed from earlier theories.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 322 Linguistics and Cognitive Science",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 222 or equivalent.",
        "corequisites": "",
        "description": "This course situates generative linguistics in the cognitive sciences by providing a survey of relevant topics from psychology, artificial intelligence, computer science, ethology, and philosophy.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under a LING 398 number may not take this course for credit."
    },
    {
        "title": "LING 330 Sanskrit",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course provides an introduction to the fundamentals of Sanskrit grammar. After developing a foundation, students are presented with a selection of short, original texts to read and translate.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 335 Historical Linguistics",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 200 with a grade of C or higher.",
        "corequisites": "",
        "description": "This course provides a survey of the primary tools and methods of historical linguistics. Change and mechanisms of change at the various levels of the grammar (phonological, morphological, and syntactic) are surveyed. The comparative method, including both subgrouping and reconstruction, is treated in detail.",
        "components": "Lecture",
        "notes": "Students who have received credit for LING 420 may not take this course for credit."
    },
    {
        "title": "LING 353 Psycholinguistics",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 200 or equivalent. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course treats current issues in the experimental evaluation of linguistic theories, presenting both methodological concerns and empirical results. Topics covered include sentence processing, speech perception, lexical access and language development.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under a LING 398 number may not take this course for credit."
    },
    {
        "title": "LING 361 Hittite",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "The fundamentals of Hittite grammar are presented through the extensive reading of texts, both in transliteration and cuneiform. Considerable attention is given to problems of comparative grammar.",
        "components": "Lecture",
        "notes": "Students who have received credit for LING 461 may not take this course for credit."
    },
    {
        "title": "LING 371 Semantics",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 200 with a grade of C or higher.",
        "corequisites": "",
        "description": "This course introduces the basic notions required for formal analysis of meaning within a theory of language. The central objective is the development of a system for the representation of the logical structure of natural language. Contemporary works in linguistic semantics are critically examined.",
        "components": "Lecture",
        "notes": "Students who have received credit for LING 320 may not take this course for credit."
    },
    {
        "title": "LING 372 Descriptive and Instrumental Phonetics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Description of speech sounds in articulatory terms. Identification and description of sounds that occur outside the Indo‑European family of languages. Description of speech sounds as to their acoustic qualities: frequency, amplitude, pitch, stress. Interpretation of sound spectrograms.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 373 Phonology",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 200 with a grade of C or higher.",
        "corequisites": "",
        "description": "This course examines the fundamentals of distinctive‑feature analysis as developed by Jakobson, Chomsky, and Halle. Theoretical concepts and notational techniques are emphasized. Students receive extensive training in data analysis and rule writing.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 380 Morphology",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 373 or equivalent.",
        "corequisites": "",
        "description": "This course consists of a survey of linguistic morphology, the study of word structure, and the tools used to perform morphological analysis. The course also gives some consideration to the issues relating to a theory of morphology.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under a LING 398 number may not take this course for credit."
    },
    {
        "title": "LING 398 Selected Topics in Linguistics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "LING 415 Advanced Syntax",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 315 with a grade of C or higher.",
        "corequisites": "",
        "description": "This course considers current developments in the field of syntactic theory and their application to phenomena such as control, movement out of islands and binding.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 421 Non-Indo-European Structures",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: LING 315, LING 373.",
        "corequisites": "",
        "description": "This course is intended to give the student an in‑depth acquaintance with the structure of a language which differs markedly from that of familiar Indo‑European languages. The course involves working with a native speaker and/or from textual material.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 425 Language Acquisition and Universal Grammar",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: LING 315, LING 373.",
        "corequisites": "",
        "description": "This course presents a survey of theoretical and empirical issues in the study of first language (L1) acquisition by children. Particular attention is paid to the role of Universal Grammar and innateness in explaining L1 acquisition, as well as to the significance of fundamental theoretical notions such as the competence/performance distinction.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 435 Advanced Historical Linguistics",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 335.",
        "corequisites": "",
        "description": "This course concentrates on the nature of language change, with an investigation into the relationship between theories of linguistic structure and theories of change. The theoretical foundations of contemporary methods in the study of language change are the central focus.",
        "components": "Lecture",
        "notes": "Students who have received credit for LING 420 or for this topic under a LING 398 number may not take this course for credit."
    },
    {
        "title": "LING 436 Indo-European Linguistics",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 335 with a grade of C or higher; and LING 330 or LING 361 with a grade of C or higher. Students who have completed CLAS 201 or CLAS 203 with a grade of C or higher are permitted to substitute the LING 330 or LING 361 prerequisite requirement.",
        "corequisites": "",
        "description": "Detailed study of the synchronic and diachronic grammars of one or more Indo‑European dialects essential to the reconstruction of the proto‑language. Extensive readings are undertaken in both original texts and in scholarly contributions to their elucidation. Emphasis is placed on current issues and research in the field.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 471 Advanced Semantics",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 371 with a grade of C or higher.",
        "corequisites": "",
        "description": "This course explores advanced topics in the relationship between syntactic form and linguistic meaning. The course concentrates on formal analysis of linguistic meaning in the tradition of Model Theoretic Semantics. Students are required to read original journal articles in semantics as well as other source material that cover current areas of active research.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under a LING 498 number may not take this course for credit."
    },
    {
        "title": "LING 472 Advanced Phonetics",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: LING 200 with a grade of C or higher, and LING 372 with a grade of C or higher.",
        "corequisites": "",
        "description": "Advanced study of speech processes. Topics may include waveform and spectral analysis, models of speech recognition, speech development, atypical speech and the relationship between production and perception and phonology.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 473 Advanced Phonology",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: LING 373 with a grade of C or higher.",
        "corequisites": "",
        "description": "This course treats current issues in the theory of phonology, such as syllable structure, stress computation, vowel harmony and tonology. Critical readings from the current theoretical literature form the basis for discussion and study.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 475 History of Linguistics",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: LING 315, LING 373.",
        "corequisites": "",
        "description": "This course examines the history of linguistics, with a particular focus on the structuralist predecessors of contemporary linguistic theorists. Both North American and European schools of thought are considered. Extensive reading of fundamental texts is required.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "LING 477 Syntax-Semantics Interface",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: LING 315, LING 371 with a grade of C or higher.",
        "corequisites": "",
        "description": "This course discusses the interaction between syntactic structure and semantic interpretation. The course focuses both on identifying those aspects of structure and interpretation which are related (and on the mechanisms that mediate between the two) and on identifying the areas in which mismatches between structure and interpretation are found (and on possible accounts of these mismatches).",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under a LING 429 number may not take this course for credit."
    },
    {
        "title": "LING 490 Honours Tutorial",
        "credits": 3,
        "prerequisites": "Enrolment in an Honours program is required.",
        "corequisites": "",
        "description": "This course provides students with the opportunity for advanced research in linguistics under the direct supervision of a faculty member. Students normally prepare a research paper on a topic chosen by the student and with the approval of the supervisor.",
        "components": "Tutorial",
        "notes": "Students may take this course only once for credit."
    },
    {
        "title": "LING 495 Tutorial",
        "credits": 3,
        "prerequisites": "Permission of the Department is required.",
        "corequisites": "",
        "description": "This course provides students with the opportunity to study a topic of individual interest under the guidance of a faculty member.",
        "components": "Tutorial",
        "notes": "Students may take this course twice for credit provided the subject matter is different."
    },
    {
        "title": "LING 498 Advanced Topics in Linguistics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    }
]