[
    {
        "title": "WSDB 290 Introduction to Historical Perspectives in Women’s Studies",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course provides an introduction to theories and writing that affect the lives of women. Through the writing of feminist authors, students examine, from mainly the 20th century, the development of feminist theories and debate. Specific authors may include Simone de Beauvoir, Audre Lorde, Gloria Anzaldua, Angela Davis, Adrienne Rich, Monique Wittig, and Chandra Mohanty.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "WSDB 291 Introduction to Contemporary Concerns in Women’s Studies",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores a range of current issues and debates within feminism. Using interdisciplinary feminist theories that consider how systems of power such as patriarchy, capitalism, racism, and heterosexism constitute one another, it examines particular local and global topics of interest/concern which may include health, education, work, violence against women, globalization, militarism, media and cultural representations, families, and feminist activism.",
        "components": "Lecture",
        "notes": "Students who have received credit for WSDZ 291 may not take this course for credit."
    },
    {
        "title": "WSDB 292 Feminisms and Research Methods",
        "credits": 3,
        "prerequisites": "Enrolment in a Women’s Studies program is required. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course exposes students to a variety of research practices from a feminist perspective. These practices can include oral history, interviews, archival research, and participant observation. Students learn how to gather, analyze, and effectively present ideas and information. Practical, hands‑on exercises offer an opportunity for learning. Examination of research methods occurs in dialogue with questions of how knowledge is organized. Students are also exposed to recent developments in information literacy. This course prepares students to conduct their own research projects throughout their studies.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "WSDB 298 Selected Topics in Women’s Studies",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for these courses, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "WSDB 300 Feminist Perspectives on Human Rights",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "During the late-20th century, human rights became a dominant frame for thinking about social justice. This course questions the role of human rights in struggles for justice, and it examines and critiques practical forms of human rights activism. Primary texts are studied and scholarship from women’s studies, history, political science, and anthropology.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 301 Canada, Colonization and Law",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "Spanning federal, provincial, and international processes, this course explores the legal, political, and social bases for Canada’s account of itself as a sovereign country existing on Indigenous territories. The course considers the role of ideas about gender, race, and marriage in settler expansion and Indigenous dispossession. Students study primary texts and scholarship from women’s studies, Indigenous studies, history, political science, and law.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 310 Feminism, Comedy, and Social Change",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "In this course, students examine the complex relationship between feminism and comedy through an interdisciplinary framework. The course posits comedic performance as a social/cultural text and considers how comedy might be used to challenge inequalities and promote social change. Topics may include the production and consumption of various genres of comedy; different theories of humour; the connections between comedic performances and key feminist principles; and how social and political issues can be addressed through comedy.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 365 Feminist Theory and Popular Culture",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines how feminism has not only commented on the world of pop culture but has entered and altered it. Through a study of television, film, advertising, pop music, cyber culture, and kiddie culture, students look at the ways in which popular culture has impacted how women view themselves and how they are viewed.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 370 Workshops in Special Areas of Women’s Studies",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "The purpose of these workshops is to examine a number of issues relevant to Women’s Studies. Specific topics for this course are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "WSDB 380 Feminist Thought I",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course introduces students to the main aspects of feminist thought across the disciplines. Through a selection of readings and case studies, feminist thought is examined in two interrelated senses: the exercise of woman‑ centred inquiry, and feminism as a critique of existing knowledge frameworks. Students are introduced to fundamental feminist notions such as the distinction between the private and the public, the notion of experience, androcentrism, and the division between the family and the economy. The history of feminist thought is explored as well as its articulation since the 1970s and its contribution to Women’s Studies and to social theory in general. Also examined is the potential and power of different feminist theories to effect social change and transform the social world they analyze.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 381 Indigenous Women and Feminisms",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course aims to acquaint students with the concerns and contemporary realities of Indigenous women in North America. It examines Indigenous politics, activism, and culture through current feminist, decolonizing and post‑colonial lenses. The course examines issues such as identity, representation, citizenship, land, sovereignty, nationalism, sexual and social violence, and de/re/colonization. Students develop critical thinking skills necessary to explore how sexism and racism are encoded in Canadian institutions and laws, how Indigenous women have engaged with the resulting disenfranchisement, and how they have been leading actors in Indigenous struggles, making significant contributions to their communities and nations.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 383 Lesbian Issues and Realities",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course introduces the field of lesbian studies and examines lesbian existence from a political and empirical perspective. The course engages diverse feminist perspectives on gender, nation, race, class, culture, ability and sexual identity in the lives and political consciousness of lesbians. Attention is paid to Canadian and Quebec contexts.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 384 Queer Feminism",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course introduces the critical and discursive legacies of “queer feminism,” engaging with a host of identities, bodies, practices and pleasures. The course interrogates the ways in which gender and sexuality intersect with nation, race, class, culture and ability from the point of view of political action and cultural production. Attention is paid to Canadian and Quebec contexts.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 385 Introduction to Trans Studies",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "The first part of the course reviews the emergence of Trans Studies: what came before it and what distinguished it from other forms of knowledge about trans people. Also reviewed is Trans Studies’ theoretical and methodological heritage, including the ways in which Feminism and Queer Theory have shaped the field’s interests. The second part of the course evaluates Trans Studies in action by looking at selected aspects of some trans people’s lives: their history, community building, access to health care and social services, criminalization, and self‑narration.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 386 Framing the Prostitute",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "The “problem” of prostitution — specifically the public/visible presence of women providing sexual services to men for money — has long preoccupied Western society. This course explores the frames superimposed on prostitution, regardless of the cultural, religious, scientific, geographic or political context in which it exists.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 390 Feminist Perspectives on Peace",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "Using feminist scholarship, this course covers themes such as militarism, the war industry, women in the military, war mythologies, organized and domestic violence, roles played by women during wars, wars against women, peace education and feminist peace activism.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 391 Health Issues: Feminist Perspectives",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course presents feminist, intersectional, postcolonialist, poststructuralist and queer examinations of a variety of women’s health issues. It explores the complex cultural politics that tend to legitimize existing power relations in health care, health research, and “health” industries. Topics include biopolitics and surveillance of women’s bodies, medicalization and disease mongering, patriarchal capitalism and the health industry, cosmetic surgery and oppression or agency, women’s health and sociocultural identifications, feminist medical ethics, and alternative and feminist health care.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 392 Féminismes dans la francophonie",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "A partir de textes théoriques et d’ouvrages traitant de la vie quotidienne, ce cours examine les similitudes, les analogies et les traits distinctifs des luttes des femmes durant les deux dernières décennies, ici et ailleurs dans la francophonie, notamment les luttes des Arabes, des Antillaises ou des femmes d’Afrique noire.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 393 Critical Race Feminisms",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292. Students must complete 15 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course explores the concepts of race, racism, and racialization, alongside feminist theories and practices. Drawing from feminist and critical race theories, the course focuses on questions of power, knowledge production, and interlocking systems of oppression within local and global contemporary contexts. It provides opportunities to reflect upon anti‑racist feminist practice and to apply anti‑racist analyses.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 394 Tutorial in Women’s Studies",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292 and WSDB 380. Students must complete 24 credits in their degree program prior to enrolling. Enrolment in a Women’s Studies program is required. Students must have a minimum GPA of 3.0 (B) and a demonstrated ability to carry out independent research. Permission of the Institute is required.",
        "corequisites": "",
        "description": "Tutorials are given only in exceptional circumstances and should focus on a topic not covered under the normal curriculum. A Tutorial Request form must be completed by the student and then approved by a full‑time Simone de Beauvoir Institute faculty member acting as a supervisor.",
        "components": "Tutorial",
        "notes": "Students who have received credit for this topic under a WSDB 398 or WSDB 498 number may not take this course for credit."
    },
    {
        "title": "WSDB 398 Selected Topics in Women’s Studies",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for these courses, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "WSDB 399 Selected Topics in Women’s Studies",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for these courses, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "WSDB 400 Gender Justice in Canadian Law and Policy",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292 and WSDB 380. Students must complete 30 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course examines the relationship between law and feminist thought and action in the 20th and 21st centuries. The course confronts the reality that the law underpins a world shot through with injustice, yet those seeking justice often turn to law to remedy that injustice. The course explores how structures of domination underpin the law and how law creates and perpetuates structures of domination. Students read statutes and legal cases and scholarship from law, political science, women’s studies, and history.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 498 number may not take this course for credit."
    },
    {
        "title": "WSDB 401 Ending Sexual Violence",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292, WSDB 380. Students must complete 30 credits prior to enrolling. If the prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This course examines approaches to ending sexual violence from a feminist and abolitionist framework. Students consider the roles of state institutions, such as the criminal justice system, prisons, and policing, to critically interrogate how sexual violence is perpetuated. Course readings and assignments focus on community-based models for ending sexual violence, such as community accountability, abolition movements, and transformative justice.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 498 number may not take this course for credit."
    },
    {
        "title": "WSDB 410 Feminisms, Tourism, and Mobilities",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292 and WSDB 380. Students must complete 30 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This advanced‑level seminar explores gender, race, citizenship, class and sexuality as they manifest in various forms of contemporary tourism. This course, primarily concerned with issues of power, explores an interdisciplinary theoretical framework that privileges feminist transnational/postcolonial and critical race approaches. Some of the issues explored through this course include who can freely, safely and easily cross borders as well as the impacts of tourist consumption. Other themes may include the marketing and commodification of destinations and the interpersonal social encounters that tourism and travel enable.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under a WSDB 398 number may not take this course for credit."
    },
    {
        "title": "WSDB 480 Feminist Thought II",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 291 and WSDB 380. Students must complete 30 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "While Feminist Thought I examines feminism as critique of theory in various historical and disciplinary topics, this course looks closely at the different feminist theories of the social world. The course considers fundamental concepts of Marxist feminism, post‑structuralist feminist theory, feminist critical theory, and post‑colonialist feminisms. Students learn how to summarize these different theoretical approaches, as well as how to think about them in a comparative manner.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 490 Feminist Ethics",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292 and WSDB 380. Students must complete 30 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This interdisciplinary seminar considers the effect of systems of gender, race, and class on women’s place in society. It takes into account recent developments in feminist scholarship in the humanities and social sciences.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 491 Feminist Perspectives on Culture",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292 and WSDB 380. Students must complete 30 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "This seminar explores the central concepts and theories in feminist cultural studies, as they inform feminist, post‑colonial, queer, and post‑structuralist understandings of culture. The focus is on women as cultural producers and subjects in/of various cultural texts (e.g. cinema, visual arts, music, advertising, popular media, feminist writings). The discursive construction of gender, as it is inflected by class, race, sexuality, and location, is examined as well as the ways in which it is used, displayed, imagined and performed in contemporary culture. Students develop practical and analytical skills, posing questions of how particular cultural narratives function within social, political and economic contexts. Students are required to participate in and lead discussions of the readings and to create and/or critique cultural productions.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 492 Post-colonial and Anti-colonial Feminist Theories and Practice",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292 and WSDB 380. Students must complete 30 credits prior to enrolling. If prerequisites are not satisfied, permission of the Institute is required.",
        "corequisites": "",
        "description": "The course is devoted to understanding the gendered dimensions of colonial/imperial relations of power and resistance both in historical and contemporary contexts. The main themes covered in the course include settler colonialism in Canada; knowledge, representations and power; contemporary challenges and resistance to anti‑imperialist struggles; and post‑colonial analyses of current economic and political relations.",
        "components": "Seminar",
        "notes": "Students who have received credit for this topic under WSDB 498 may not take this course for credit."
    },
    {
        "title": "WSDB 494 Advanced Tutorial in Women’s Studies",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: WSDB 290, WSDB 291, WSDB 292 and WSDB 380. Students must complete 24 credits prior to enrolling. Enrolment in a Women’s Studies program is required. Students must have a minimum GPA of 3.0 (B) and a demonstrated ability to carry out independent research. Permission of the Institute is required.",
        "corequisites": "",
        "description": "Tutorials are given only in exceptional circumstances and should consist of a topic not covered under the normal curriculum. A Tutorial Request form must be completed by the student and then approved by a full‑time Simone de Beauvoir Institute faculty member acting as a supervisor.",
        "components": "Tutorial",
        "notes": "Students who have received credit for this topic under a WSDB 398 or WSDB 498 number may not take this course for credit."
    },
    {
        "title": "WSDB 496 Directed Research",
        "credits": 6,
        "prerequisites": "The following courses must be completed previously: WSDB 290, WSDB 291, WSDB 292, WSDB 380 and WSDB 480. Enrolment in the Specialization in Women’s Studies. Students must complete 30 credits prior to enrolling. Permission of the instructor is required.",
        "corequisites": "",
        "description": "This course is designed for advanced students and is generally only available to students in their final 24 to 30 credits. Students are expected to produce a substantial research project and are supervised by full‑time faculty.",
        "components": "Research",
        "notes": null
    },
    {
        "title": "WSDB 498 Seminar in Women’s Studies",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for these courses, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": "Seminar",
        "notes": null
    },
    {
        "title": "WSDB 499 Seminar in Women’s Studies",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for these courses, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": "Seminar",
        "notes": null
    }
]