[
  {
    "title": "GEOG 200 World Geography",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course provides an overview of world geography. It first examines the main environmental and social factors that geographers have employed to divide the world into a series of distinctive regions, and uses examples of specific countries to explore the distinctive geographical processes by which these patterns are transformed and perpetuated.",
    "components": "Lecture",
    "notes": "Students currently registered in a Human Environment, Environmental Geography, or Environmental and Sustainability Science program may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 203 Canadian Environmental Issues",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines the diversity and complexity of Canadian environmental issues from an interdisciplinary perspective. Natural science considerations are explored as well as the relationship of scientific understanding to policy and wider social action. Issues addressed include fisheries, animal rights, biodiversity conservation, protected areas, energy, and climate change.",
    "components": "Lecture",
    "notes": "Students currently registered in a Human Environment, Environmental Geography, or Environmental and Sustainability Science program may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 204 Global Environmental Issues",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines a number of global environmental issues from an interdisciplinary perspective. The complex interactions and interdependencies among the biophysical, socio‑economic, political, and cultural aspects of global environmental change are explored in relation to issues such as global warming, desertification, deforestation, declining biodiversity, and acid rain.",
    "components": "Lecture",
    "notes": "Students currently registered in a Human Environment, Environmental Geography, or Environmental and Sustainability Science program may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 206 Maps and Mapping",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course explores the role of maps in society. Students are introduced to basic mapping concepts in order to evaluate the meaning and use of various types of maps. Samples of the following types of maps are studied: historic maps, political maps, cognitive maps, maps in newspapers and magazines, computer‑generated maps, and maps on television.",
    "components": "Lecture",
    "notes": "Students who have completed courses numbered GEOG 209 and above may not take GEOG 200‑208 for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 209 The Geography of a Selected Region",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "The course includes both a systematic survey as well as an in‑depth focus on particular geographical issues and problems. The specific region to be studied may vary from year to year.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOG 210 Geography of Global Change",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines a variety of geographical changes related to globalization. It focuses mainly on the global political system and the global economy, and also considers transport and communications systems, culture, and environmental issues.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 220 Place, Space, and Identity",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines how place is constructed through subjective encounters of humans with each other and with the non‑human world. This focus reveals how the unique and contested identities of places are created and how space itself is socially constructed. The ways in which place, space and identity affect and are affected by political, economic, cultural and environmental changes are then examined within the context of existing patterns of geographical unevenness.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 260 Mapping the Environment",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course introduces students to the basic concepts, theory, and methods of mapping with reference to topographic and thematic maps. Through lectures, laboratories, and practical assignments, students learn about the sources of data for maps, and how these data are manipulated, represented, and interpreted in both analog and digital form (Geographic Information Systems).",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 264 Programming for Environmental Sciences",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course is an introduction to the fundamentals of computer programming relevant for environmental sciences. It presents the basic building blocks of computer programming, including data types, variables and constants; expressions and operators; assignments, control structures, simple library functions and programmer‑defined functions. Students learn how to develop algorithms and how to convert algorithms/pseudo codes into a programming language — specific syntax (e.g. R, Python) — to collect, query, preprocess, visualize and analyze environmental datasets.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for STAT 280 or for this topic under a GEOG 298 number may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 272 The Natural Environment: Air and Water",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course introduces the Earth’s atmosphere and hydrosphere through an examination of their structural components, processes, and variability through space and time. Topics include the global energy system, air temperature cycles, weather systems, urban climate, the water cycle, oceans, lakes, and rivers.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 274 The Natural Environment: Land and Life",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course introduces the Earth’s lithosphere and biosphere through an examination of their structural components, processes, and variability through space and time. Topics include the tectonic system, volcanic activity, landscape and landform development, soils, biogeochemical cycling, succession, and biomes.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 290 Environment and Society",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Relations between the environment and society both preserve and threaten the more‑than‑human world. Drawing on vibrant contributions from geographical and interdisciplinary fields, this course introduces concepts and frameworks for clarifying and interrogating existing environment‑society relations and for imagining possible alternatives. Topics may include nature/culture divide, alternative ideas of nature, historical dimensions of current environment‑society relations, the role of experts and expertise in contemporary society, the impact of unequal distributions of political power on people and the environment, and possibilities for hope in troubled times. Writing tutorials linked to the course assignments help students learn university‑level academic writing and critical thinking skills.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 298 Selected Topics in Geography",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and the Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOG 299 Selected Topics in Geography",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for these courses, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and the Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOG 301 The Sustainable University Campus",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "With the campus as the laboratory, this course explores and contributes to building a more sustainable campus community. It is designed to support Concordia’s commitment to sustainability while providing students with an applied learning experience. Students gain experience in planning and implementing interdisciplinary research projects using a variety of qualitative and quantitative techniques. They learn about participatory action research, the application of sustainability concepts in a living and learning organization, and work in teams to develop creative and actionable projects that contribute to moving the University in a more sustainable direction. The course integrates theory and practice. The Concordia Campus Sustainability Assessment as well as recent literature and case studies from the sustainability assessment and reporting fields form the theoretical foundations of the course. The course uses lectures, guest speakers, workshops, and project work as learning tools.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a GEOG 398 number may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 310 Refugees and Migration in Today’s World",
    "credits": 3,
    "prerequisites": "GEOG 220; or completion of 30 credits for students enrolled in a Social Science program. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines key issues in human displacement through refugee movements and migrations. Geographies of displacement centre around questions of human rights, nation‑state and the politics of belonging, as well as exile/home. While displacement is often framed as a political or humanitarian crisis, it also raises important issues regarding citizenship and exclusion, shelter and sanctuary, movement and confinement. This course offers geographic approaches to understanding how people experience displacement, as well as how displacement is managed at a policy level and/or represented in discourse.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 315 Social and Cultural Geographies",
    "credits": 3,
    "prerequisites": "GEOG 220, GEOG 290.",
    "corequisites": "",
    "description": "The field of social and cultural geography explores how social difference (e.g. race, gender, sexuality, class, disability, migrant status) and cultural representations (e.g. ideas of heritage, consumerism, colonialism, arts, aesthetics, or home) interact with space and place. This course examines processes such as the legitimation of social structures and experience, struggles over identity and memory, contestations of cultural meaning, and resistance to power. This is a field that asks — how does geography help imagine an alternative future?",
    "components": "Lecture",
    "notes": "Students who have received credit for GEOG 300 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 321 A World of Food",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines the geographical processes that have affected the production and consumption of food from the beginnings of agriculture to the rise of genetically modified organisms, and considers the part played by different patterns of diet and cuisine in shaping distinctive regions at the global and local scale.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a GEOG 398 number may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 323 Urban Agriculture",
    "credits": 3,
    "prerequisites": "GEOG 220 or URBS 230. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the history and practice of producing food in cities. Students will explore the tensions between the politics, economies and ecologies that organize urban food production and the everyday ways people raise and access food in varied urban contexts. The course also critically evaluates food‑based social movements: their limits, possibilities and connections to wider struggles for socio‑economic justice.",
    "components": "Lecture",
    "notes": "Students who have received credit for URBS 337 or for this topic under a GEOG 398 or URBS 398 number may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 330 Urban Geography",
    "credits": 3,
    "prerequisites": "GEOG 220. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "The geographer’s view of the city is explored at two scales: cities as elements of an urban system, including topics such as urbanization and the functional structure of cities; and intra‑urban patterns, including the spatial arrangement of land‑use and social areas.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 333 Urban Transportation",
    "credits": 3,
    "prerequisites": "GEOG 220 or URBS 230. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the past evolution and recent functioning of various transport modes in cities around the world. Recent debates about desirable levels of car, transit, and non‑motorized modes feature prominently. Techniques of analyzing urban transport and public policy options are considered in light of burgeoning concerns about sustainable development and the worldwide growth of motorization.",
    "components": "Lecture",
    "notes": "Students who have received credit for URBS 310 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 342 The Making of the Irish Landscape",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course focuses on the evolution of the Irish landscape and examines the physical, political, social, economic and attitudinal processes that have shaped the cultural landscape from prehistoric times to the present.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a GEOG 398 number may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 355 Resource Analysis and Management",
    "credits": 3,
    "prerequisites": "GEOG 290. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "The course is concerned with the use of the Earth’s natural resources and with the economic, institutional, and ecological factors that affect, condition, and control the use of these resources. It examines various approaches to analyzing, evaluating, and resolving resource issues and conflicts. These approaches are applied to Canadian forestry, fisheries, water, energy, and mineral resources.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 361 Research Design and Qualitative Methods",
    "credits": 3,
    "prerequisites": "GEOG 260. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course introduces students to commonly employed methods and techniques for undertaking social science research. After reviewing the philosophical considerations underlying particular research traditions and the merits and limitations of distinct types of research strategies, the course examines specific sets of methods and the kinds of questions and research topics for which they are best suited. The focus is on qualitative methods but also examines the complementarity of qualitative and quantitative techniques and the broader research designs in which quantitative techniques can be employed. Readings are supplemented with in‑class and field exercises. Occasional involvement in fieldwork outside of class time is required.",
    "components": "Lecture",
    "notes": "Students who have received credit for GEOG 360 may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 362 Statistical Methods",
    "credits": 3,
    "prerequisites": "GEOG 361. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course introduces statistical methods for geographers. Topics include sampling, data manipulation, probability distributions, statistical inference, hypothesis testing, correlation and regression.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for BIOL 322, COMM 215, ECON 221, GEOG 360, INTE 296, MAST 221 or MAST 333, PSYC 315, SOCI 213, STAT 2096 or STAT 249 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 363 Geographic Information Systems",
    "credits": 3,
    "prerequisites": "GEOG 260 or GEOL 210 . If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course is an introduction to current theoretical and practical approaches to Geographic Information Systems (GIS) through which students acquire basic skills and understanding in the use of GIS for spatial analysis. Training is centred on a series of practical assignments using GIS software and for the term project, students explore the potential of GIS for addressing a real‑world problem.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for URBS 335 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 371 Landscape Ecology",
    "credits": 3,
    "prerequisites": "GEOG 272; GEOG 274 or GEOL 210.",
    "corequisites": "",
    "description": "The objective of this course is to combine perspectives and principles originating in ecology and geography for application in conservation, restoration, and more sustainable land use. Students examine how natural processes and human activities interact and contribute to landscape change, and how landscape patterns influence the abundance and distribution of plants and animals. Topics include natural processes such as fire, water, and the movement of organisms; human activities such as transportation infrastructure and urban development; and methods for analyzing landscape structure such as patches, corridor networks, and landscape metrics.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 374 Plant Ecology",
    "credits": 3,
    "prerequisites": "GEOG 272; GEOG 274 or GEOL 210.",
    "corequisites": "",
    "description": "This course examines plant community dynamics as a consequence of the population dynamics of the constituent plant species. The role of natural disturbances is stressed, particularly as it relates to forests. Concepts are applied to problems in park management, vegetation mapping, and present controversies about the maintenance of species diversity. This course includes a mandatory one‑day field trip.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for GEOG 372 or GEOG 373 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 375 Hydrology",
    "credits": 3,
    "prerequisites": "GEOG 272 ; GEOG 274 or GEOL 210 . If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "The course examines the hydrologic cycle, with a main focus on surface hydrology. Topics covered include the organization of the river network, precipitation over a watershed, runoff, flood frequency analysis, estimation of peak streamflows, flow, and sediment transport in rivers. Assignments provide experience in the practical aspects of hydrological data treatment using Canadian examples. The course aims at understanding the mechanics of processes governing the motion of water on hillslopes and in rivers, which are essential to water management.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 377 Landform Evolution",
    "credits": 3,
    "prerequisites": "GEOG 272; GEOG 274 or GEOL 210. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the processes responsible for the development and evolution of the Earth’s landforms, including human modifications to those landforms. Topics include the study of fluvial, coastal, glacial, periglacial, and arid landforms.",
    "components": "Lecture; Tutorial; Laboratory",
    "notes": "Students are strongly encouraged to take GEOL 210.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 378 The Climate System",
    "credits": 3,
    "prerequisites": "GEOG 272; GEOG 274 or GEOL 210. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the interacting components of the climate system (atmosphere, ocean, ice, land and vegetation) and the key features of the present‑day weather and climate systems; including a focus on how the climate system has changed in the past, and the processes, both natural and human‑induced, which drive and moderate these changes. Methods used to reconstruct past climate changes, and the use of climate models to understand climate system interactions and change are discussed.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 380 Ecological Economics",
    "credits": 3,
    "prerequisites": "GEOG 210 or GEOG 290; or ECON 201, ECON 203.",
    "corequisites": "",
    "description": "This course provides an introduction to economic perspectives on environmental issues. It is designed to study the interplay between the economic sphere and the environment by addressing questions of economic life, such as activities of corporations and states, role of markets, energy and resource use, growth and development, population, food, international trade and financial systems. These questions are explored through alternative economic approaches, among which the tradition of ecological economics is the centrepiece.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 398 Selected Topics in Geography",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule and Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 399 Selected Topics in Geography",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for these courses, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOG 406 Tropical Forests",
    "credits": 3,
    "prerequisites": "GEOG 374. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course focuses on three themes: how tropical forest ecosystems function and change; the causes and consequences of deforestation and faunal impoverishment; and the ecological and sociological problems faced by conservationists in the tropics.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOG 407 Indigenous Peoples and the Environment",
    "credits": 3,
    "prerequisites": "GEOG 315. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course provides an extended, in‑depth exploration of the relationships and roles of Indigenous peoples with respect to their traditional territories and natural resources. Indigenous ontologies and epistemologies are highlighted in addition to Indigenous aspirations and approaches for use and stewardship of the environment. The course examines theoretical and case‑study literature, with a broad regional focus on Aboriginal peoples in Canada while also drawing from comparative international experiences of Indigenous peoples.",
    "components": "Seminar",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 418 Geographies of Postcolonialism",
    "credits": 3,
    "prerequisites": "GEOG 315. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "Based largely on scholarship about the Americas, this course introduces students to theories of the colonial present and traces geographies of a variety of contemporary colonial processes and anti‑colonial struggles.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a GEOG 498 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 430 Social Geographies of Montreal",
    "credits": 3,
    "prerequisites": "GEOG 315 or GEOG 330. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course explores the social and cultural geographies of Montreal with particular emphasis on how the spatial distribution of communities influences urban planning and public policy at the local and regional levels. Complex webs of identities and solidarities informed by socio‑economic, linguistic, ethno‑cultural, and sexual orientation factors shape the city living experience of individuals and populations alike. Through lectures, discussions, assignments and field trips, students are introduced to a variety of analytical perspectives that investigate the socio‑cultural dynamics that contribute to shaping urban settlements, human‑environment interactions and local social networks.",
    "components": "Lecture",
    "notes": "Students who have received credit for URBS 420 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 431 Urban Planning in the Developing World",
    "credits": 3,
    "prerequisites": "GEOG 330 or URBS 380. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course explores the growth and planning of large metropolitan areas in developing nations. Issues and problems associated with recent urbanization are examined along with potential solutions offered by urban planning and public policies. The planning roles of institutions, including governments, multilateral development agencies, and non‑governmental organizations, are reviewed.",
    "components": "Seminar",
    "notes": "Students who have received credit for URBS 481 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 440 Geography and Public Policy",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines the relationship between geographical approaches to problems and issues, and the public policy process. It discusses such topics as the relevance of geographical information and geographical research to policy makers, the need for assessment of the spatial and environmental impact of public policies, and the role of geographers in the public policy process.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOG 450 Economic Restructuring",
    "credits": 3,
    "prerequisites": "GEOG 330 or GEOG 380 or URBS 380. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the nature of economic restructuring in late capitalism and the implications that industrial restructuring trends are having for the geography of industries, the structure of firms, workplace relations and workers’ rights. It examines the new challenges that restructuring presents for both economic development prospects and labour market policies, as well as looking at contemporary initiatives to promote more socially and environmentally sustainable development paths.",
    "components": "Seminar",
    "notes": "Students who have received credit for URBS 450 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 458 Environmental Impact Assessment",
    "credits": 3,
    "prerequisites": "GEOG 355. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the conceptual bases, procedures, and methodology of Environmental Impact Assessment (EIA). The effectiveness of EIA as a decision‑making process in the promotion of good environmental planning is analyzed, including its role in assessing the potential effects of certain activities on the natural environment as well as on social, cultural, and economic aspects of the environment.",
    "components": "Seminar",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 463 Advanced Geographic Information Systems",
    "credits": 3,
    "prerequisites": "GEOG 363 or URBS 335. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course focuses on database structure and management as well as advanced spatial analysis techniques. It considers both practical and theoretical questions of interpretation of GIS in the context of particular problems and real data sets. The course involves hands‑on use of GIS software in a laboratory setting.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 464 Programming for Geospatial Technologies",
    "credits": 3,
    "prerequisites": "GEOG 264; GEOG 363 or URBS 335 . If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course introduces students to the world of programming for geospatial technologies and web mapping. Through a review of the main concepts, techniques, standards, libraries and languages, students learn how to use programming to improve the geospatial data analysis process and to design maps that enhance the user’s experience. Training is centred on programming languages for Geographical Information System (GIS) applications (e.g. Python) as well as for web mapping (e.g. HTML, CSS and JavaScript). These languages are used to automate workflows for GIS analysis and customize stylistic and meaningful online maps.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 465 Remote Sensing",
    "credits": 3,
    "prerequisites": "GEOG 363 or URBS 335. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course provides basic knowledge about the theory and practice of remote sensing, its potential and limits. The course is divided in five parts: 1) fundamentals of remote sensing, where the physical basis of remote sensing is explained; 2) sensors and orbits (different types of sensors, passive, active, and thermal sensors); 3) digital image processing, looking at image enhancement, filtering, classification, and how to obtain thematic data from raw imagery; 4) applications of remote sensing such as forestry, urban studies, water pollution, and agriculture; and 5) problems and challenges associated with remote sensing. Practical examples for all these topics will be covered in the laboratory sessions.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 466 Geomedia and the Geoweb",
    "credits": 3,
    "prerequisites": "GEOG 363 or URBS 335. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course introduces students to geospatial technologies that have dramatically changed the way one interacts with the environment. Students acquire the geovisualization skills required to design meaningful maps in the context of the Geoweb, and are exposed to the growing body of literature that critically envisions the socio‑political dimensions of these new forms of cartographic expression.",
    "components": "Seminar; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 467 Environmental Modelling",
    "credits": 3,
    "prerequisites": "GEOG 362 or BIOL 322. Enrolment in the BSc Honours in Environmental and Sustainability Science or BA Honours in Human Environment is required. Permission of the Department is required.",
    "corequisites": "",
    "description": "The different approaches to modelling the biophysical, built, or human environment are examined. The conceptualization of simple models to examine how human interventions affect the environment is investigated. Different modelling approaches such as system models, computer visualization and simulation are covered. Students develop a model scheme related to a topic of interest.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for this topic under a GEOG 498 number may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 470 Environmental Management",
    "credits": 3,
    "prerequisites": "GEOG 375 or GEOG 377. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course provides students with an understanding and appreciation of the field of environmental management and its contribution to addressing the impacts of human activities on the natural environment. Assessment of the limitations associated with conventional command‑and‑control approaches to environmental management are considered. The course also focuses on emerging concepts and frameworks associated with a recent rethinking of environmental management approaches, including complex adaptive systems, social‑ecological systems, and resilience.",
    "components": "Seminar",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 473 Environment and Health",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines geographical approaches to the study of health, focusing on the investigation of spatial variations in disease incidence, the ecology of selected diseases, and the links between health and the biophysical, social, and built environment. Focus is placed on critical examinations of approaches and methods of explanation.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOG 474 Sustainable Forest Management",
    "credits": 3,
    "prerequisites": "GEOG 374. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course looks at changes in the exploitation and sustainable management of the forest resource in Canada and the United States. Topics include the evolution of harvesting strategies and their effect on species composition; the effects of technological changes in cutting, transportation, and milling on forests; and the recent evolution of the tension between environmentalists and foresters. There is a mandatory field trip.",
    "components": "Seminar",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 475 Water Resource Management",
    "credits": 3,
    "prerequisites": "GEOG 355; GEOG 375 or GEOG 377. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the complexity of, and necessity for, better water resource management from the viewpoint of ecological and economic sustainability as well as social equity and basic human health and dignity. Topics include the qualities, values, and uses of water — consumptive and non‑consumptive, economic and environmental; major regional and global water management issues; factors affecting water supply reliability and challenges to maintain and improve long‑term quality and equitable service in different situations; and the ways domestic, industrial, and agricultural water users can conserve water.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a GEOG 498 number may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "GEOG 476 Indigenous and Environmental History of Americas since 1492",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines environmental changes that have taken place since 1492 as a result of the Columbian exchange of peoples, plants, animals and diseases between the New and Old World. It concentrates primarily on the Americas, but also touches upon Old World impacts.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a GEOG 498 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 478 Climate Change: Science, Impacts and Policy",
    "credits": 3,
    "prerequisites": "GEOG 378 or equivalent. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the science, impacts and policy options surrounding recent and future global climate change. The first part of the course focuses on the basic science of global warming including the greenhouse effect, climate models, and predictions of future climate change, and an assessment of possible climate impacts. The course concludes with an overview of potential solutions to climate change, including national and international climate policy, energy alternatives, and technological approaches to reducing human impacts on the climate system.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a GEOG 498 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 479 Primate Behaviour, Ecology and Conservation",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course surveys the behaviour, ecology and conservation of non‑human primates living in the world today. Using contemporary evolutionary theory as a lens, the course covers taxonomy, evolutionary history, research methods, social behaviour, life history and ecology with conservation of non‑human primate populations running as a central theme.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a GEOG 491 number may not take this course for credit.Students who have received credit for this topic under a GEOG 498 number may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 480 Economics for Sustainability",
    "credits": 3,
    "prerequisites": "GEOG 355 or GEOG 380. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the interplay between the economic sphere and the environment. The course addresses questions related to the notion of sustainability by alternative economic approaches with the tradition of ecological economics as its centrepiece. It focuses more broadly on sustainability, capitalism, justice, and inequality. In addition, the course explores economic alternatives such as degrowth and solidarity economies.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a GEOG 498 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOG 485 Feminist Geographies",
    "credits": 3,
    "prerequisites": "GEOG 315. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course analyzes gender and socio‑spatial relations of power. Specifically, this course engages with feminist thought through its intersections with anti‑racist, queer, and emancipatory geographies. This is a discussion‑based seminar which includes personal reflection on space, identity and difference, resistance and agency, as well as broader global and historical contexts.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a GEOG 498 number may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 487 Capstone Seminar in Environmental Science",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "The course is designed to integrate the knowledge from several courses and provide students an opportunity to apply this knowledge to a current issue in environmental sciences through experiential learning. Students work in small groups made up from participants of all streams and critically evaluate an environmental issue using the expertise of all participants. Examples could be the reclamation of a former mining site, plans for expansion of a landfill or plans for a new water treatment plant. Aspects evaluated include, but are not limited to, land use, impact on vegetation and biota, availability of critical chemical data (e.g. trace metals, water/runoff quality, and impact on the local population). The result is a detailed environmental assessment report prepared by students.",
    "components": "Seminar",
    "notes": "Students who have received credit for BIOL 487 or CHEM 487 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOG 490 Internship in Geography",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Through a case study or practicum of 120 hours with a private or public institution, or community interest group, students acquire experience in a professional working environment.",
    "components": "Reading",
    "notes": null,
    "offeredIn": [
      "fall/winter"
    ]
  },
  {
    "title": "GEOG 491 Honours Essay and Research Seminar",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course is an advanced undergraduate research seminar which requires the student to propose and conduct a research project or research creation project, and produce a substantial report under the supervision of a faculty advisor.",
    "components": "Seminar",
    "notes": "Students who have received credit for URBS 491 may not take this course for credit.",
    "offeredIn": [
      "fall/winter"
    ]
  },
  {
    "title": "GEOG 495 Field Research",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course gives the student the experience of field research in human‑environment interactions. The field excursion, often in combination with a local organization, is typically two or three weeks in duration.",
    "components": "Field Studies",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOG 498 Advanced Topics in Geography",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule and Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOG 499 Advanced Topics in Geography",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for these courses, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOL 203 Introduction to Environmental Geology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Environmental geology is concerned with the physical, chemical, and biological processes that have acted, and continue to act, upon the planet, shaping its evolution. The course examines the interactions of lithosphere, mantle, core, biosphere, atmosphere, cryosphere, and hydrosphere. The Earth’s climate is in part determined by these Earth system interactions, and climate change throughout the Earth’s history is a central theme of the course.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOL 204 Natural Disasters",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course introduces students to natural disasters. Students gain an understanding of the geological and meteorological environments of the world that allow humans to plan for avoidance and mitigation of disasters. Topics may include plate tectonics, earthquakes, volcanoes, tsunamis, landslides and mudslides, hurricanes, floods, wildfires, ice storms, thunderstorms, and tornadoes.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a GEOL 298 number may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOL 206 Earthquakes, Volcanoes, and Plate Tectonics",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course is for students with little or no previous background in the earth sciences, providing an up‑to‑date account of our present knowledge of earthquakes and volcanoes, and the use of this information in the development of the theory of plate tectonics. Areas of concentration are: nature, distribution, and causes of earthquakes and volcanic eruptions, measuring earthquakes, great earthquakes and volcanic eruptions in world history, products of volcanic eruptions, and hazards from, and prediction of, earthquakes and volcanic eruptions. The theory of plate tectonics and the evolution of mountain belts of the world are studied.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOL 208 The Earth, Moon and the Planets",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "The course emphasizes the cosmic perspective of the Earth and focuses attention on how the results of the last two decades of planetary exploration have brought about an intellectual revolution concerning the planets, especially their surface features, processes, and histories.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "GEOL 210 Introduction to the Earth",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course provides an overview of the physical processes that govern how the Earth works. Topics include origin of the solar system and Earth; analysis of the internal structure of the Earth; minerals and rocks; igneous and metamorphic processes; deformation of the crust; surficial processes, including weathering, deposition and glaciation. The course culminates with the integration of these geological processes in the theory of plate tectonics, and goes on to examine the interactions of crust, mantle, atmosphere, and biosphere from this perspective. Laboratory work includes the identification of rocks and minerals, map exercises, and a field trip.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "GEOL 216 Field Methods",
    "credits": 3,
    "prerequisites": "GEOL 210.",
    "corequisites": "",
    "description": "The purpose of this course is twofold: to learn the basic methods that geologists, physical geographers, and environmental scientists use in the field (including learning how to map, measuring stratigraphic sections, and solving field problems based on observations) and to become familiar with the immediate geological environment of the Montreal region from the young Quaternary sediments, Mesozoic intrusive rocks and Paleozoic assemblages (including rocks of the St. Lawrence Lowlands) to the ancient Precambrian, crystalline basement. Two‑week field school in the spring, immediately after the final examination.",
    "components": "Field Studies",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOL 298 Selected Topics in Geology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOL 302 Palaeobiology",
    "credits": 3,
    "prerequisites": "GEOL 210.",
    "corequisites": "",
    "description": "General discussion covers taphonomy, processes and patterns of evolution, extinction, ontogeny, palaeoecology and taxonomy. Systematics, morphology, biostratigraphic value of selected macro‑invertebrate fossils will be included in the latter half of the course.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for GEOL 212 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOL 331 Evolution of the Earth",
    "credits": 3,
    "prerequisites": "GEOL 210. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "The geological evolution of planet Earth is studied in the context of the theory of plate tectonics using interpretations of stratigraphic, structural, seismic, paleontologic, and geochronologic data. A systematic review of the geological evolution of the Earth and development of life forms is examined from the time of formation of the Earth to the present, including case studies of mountain belts. In the lab, rock suites and geological maps representative of different periods of Earth history are examined.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for GEOL 310 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOL 398 Selected Topics in Geology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "GEOL 414 Undergraduate Research",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "Honours students in their final year are expected to show competence in isolating and examining a geological problem under the supervision of a faculty advisor. A written application to take the course, including a brief outline of the research project, must be made to the Department before April 15 of the second year. The application is reviewed by a committee and a decision forwarded by mail. The results of research must be presented in the form of an undergraduate thesis, two copies of which must be submitted by April 1.",
    "components": "Research",
    "notes": "Written requests from specialization students, with appropriate academic records, to take the course will be considered.",
    "offeredIn": []
  },
  {
    "title": "GEOL 415 Plate Tectonics and Crustal Evolution",
    "credits": 3,
    "prerequisites": "GEOL 210; GEOL 331 or GEOG 377. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "Techniques of data collection in tectonics. Structure and rheology of the upper mantle. Tectonics of crustal types to include shields, platforms, passive continental margins, phanerozoic foldbelts, continental rifts, island‑arc trench belts and oceanic rises, sea‑floor spreading, plate tectonics, magma associations, and plate reconstructions. Crustal origin and growth.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for GEOL 315 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOL 440 Seminar in Current Research on Environmental Earth Science",
    "credits": 3,
    "prerequisites": "GEOL 331 or GEOG 377, or 60 credits in an Engineering program. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course covers current research in environmental Earth science; topics vary from year to year, but will generally include: mantle‑biosphere‑atmosphere interactions, the carbon and methane cycles, and the geological climate record. Evaluation is based on seminar participation and written work.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a GEOG 498 or GEOL 498 number may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "GEOL 498 Advanced Topics in Geology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  }
]