[
  {
    "id": "ELEC 275",
    "title": "ELEC 275 Principles of Electrical Engineering",
    "credits": 3.5,
    "prereqs": "PHYS 205",
    "coreqs": "ENGR 213",
    "prerequisites": [],
    "corequisites": ["ENGR 213"],
    "description": "Fundamentals of electric circuits: Kirchoff’s laws, voltage and current sources, Ohm’s law, series and parallel circuits. Nodal and mesh analysis of DC circuits. Superposition theorem, Thevenin and Norton Equivalents. Use of operational amplifiers. Transient analysis of simple RC, RL and RLC circuits. Steady state analysis: Phasors and impedances, power and power factor. Single and three phase circuits. Magnetic circuits and transformers. Power generation and distribution.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week; Laboratory 15 hours total",
    "notes": ""
  },
  {
    "id": "ENCS 282",
    "title": "ENCS 282 Technical Writing and Communication",
    "credits": 3,
    "prereqs": "ENCS 272",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "Technical writing form and style. Technical and scientific papers, abstracts, reports. Library research and referencing methods for engineers and computer scientists. Technical communication using information technology: document processing software, computer‑assisted presentation, analysis and design of web presentation, choice and use of appropriate tools. Students will prepare an individual major report and make an oral presentation",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": ""
  },
  {
    "id": "ENGR 201",
    "title": "ENGR 201 Professional Practice and Responsibility",
    "credits": 1.5,
    "prereqs": "",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "Health and safety issues for engineering projects: Quebec and Canadian legislation; safe work practices; general laboratory safety common to all engineering disciplines, and specific laboratory safety pertaining to particular engineering disciplines. Review of the legal framework in Quebec, particularly the Professional Code and the Engineers Act, as well as professional ethics.",
    "components": "Lecture 1.5 hours per week; Tutorial 1 hour per week, alternate weeks",
    "notes": ""
  },
  {
    "id": "ENGR 202",
    "title": "ENGR 202 Sustainable Development and Environmental Stewardship",
    "credits": 1.5,
    "prereqs": "",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "Introduction to the concept of sustainable development and the approaches for achieving it. Relationships with economic, social, and technological development. Methods for evaluating sustainability of engineering projects, including utilization of relevant databases and software. Impact of engineering design and industrial development on the environment. Case studies.",
    "components": "Lecture 1.5 hours per week",
    "notes": ""
  },
  {
    "id": "ENGR 213",
    "title": "ENGR 213 Applied Ordinary Differential Equations",
    "credits": 3,
    "prereqs": "MATH 204 (Cegep Mathematics 105)",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "This course introduces Engineering students to the theory and application of ordinary differential equations. Definition and terminology, initial‑value problems, separable differential equations, linear equations, exact equations, solutions by substitution, linear models, orthogonal trajectories, complex numbers, form of complex numbers: powers and roots, theory: linear equations, homogeneous linear equations with constant coefficients, undetermined coefficients, variation of parameters, Cauchy‑Euler equation, reduction of order, linear models: initial value, review of power series, power series solutions, theory, homogeneous linear systems, solution by diagonalization, non‑homogeneous linear systems. Eigenvalues and eigenvectors.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": ""
  },
  {
    "id": "ENGR 233",
    "title": "ENGR 233 Applied Advanced Calculus",
    "credits": 3,
    "prereqs": "MATH 204 (Cegep Mathematics 105); MATH 205 (Cegep Mathematics 203)",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "This course introduces Engineering students to the theory and application of advanced calculus. Functions of several variables, partial derivatives, total and exact differentials, approximations with differentials. Tangent plane and normal line to a surface, directional derivatives, gradient. Double and triple integrals. Polar, cylindrical, and spherical coordinates. Change of variables in double and triple integrals. Vector differential calculus; divergence, curl, curvature, line integrals, Green’s theorem, surface integrals, divergence theorem, applications of divergence theorem, Stokes’ theorem.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": ""
  },
  {
    "id": "ENGR 301",
    "title": "ENGR 301 Engineering Management Principles and Economics",
    "credits": 3,
    "prereqs": "",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "Introduction to project delivery systems. Principles of project management; role and activity of a manager; enterprise organizational charts; cost estimating; planning and control. Company finances; interest and time value of money; discounted cash flow; evaluation of projects in private and public sectors; depreciation methods; business tax regulations; decision tree; sensitivity analysis.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
    "notes": ""
  },
  {
    "id": "ENGR 371",
    "title": "ENGR 371 Probability and Statistics in Engineering",
    "credits": 3,
    "prereqs": "ENGR 213 , ENGR 233 ",
    "coreqs": "",
    "prerequisites": ["ENGR 213", "ENGR 233"],
    "corequisites": [],
    "description": "This course starts out with axioms of probability theory, events, conditional probability and Bayes theorem. Next, random variables are introduced. Here, mathematical expectation, discrete and continuous probability density functions are covered. In statistics sampling distributions, interval estimation and hypothesis testing are introduced. The course includes applications to engineering problems.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
    "notes": ""
  },
  {
    "id": "ENGR 391",
    "title": "ENGR 391 Numerical Methods in Engineering",
    "credits": 3,
    "prereqs": "ENGR 213 , ENGR 233 ; COMP 248 or COEN 243 or MECH 215 or MIAE 215 or BCEE 231 ",
    "coreqs": "",
    "prerequisites": ["ENGR 213", "ENGR 233", "COMP 248"],
    "corequisites": [],
    "description": "This course focuses on roots of algebraic and transcendental equations; function approximation; solution of simultaneous algebraic equations; interpolation; regression; introduction to machine learning; numerical differentiation; numerical integration; numerical solutions of ordinary differential equations and partial differential equations; reliability; conditioning; error analysis. Implementation using GNU Octave/MATLAB.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
    "notes": ""
  },
  {
    "id": "ENGR 392",
    "title": "ENGR 392 Impact of Technology on Society",
    "credits": 3,
    "prereqs": "ENCS 282 ; ENGR 201 , ENGR 202 ",
    "coreqs": "",
    "prerequisites": ["ENCS 282", "ENGR 201", "ENGR 202"],
    "description": "Social history of technology and of science including the industrial revolution and modern times. Engineering and scientific creativity, social and environmental problems created by uncontrolled technology, appropriate technology.",
    "components": "Lecture 3 hours per week",
    "notes": ""
  }
]
