[
    {
        "title": "ENGR 108 Engineering C.Edge Option Reflective Learning I",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is a reflective learning module for students in their related field which is based on their academic requirements and their first C.Edge term.",
        "components": "Lecture",
        "notes": ""
    },
    {
        "title": "ENGR 201 Professional Practice and Responsibility (1.5 credits)",
        "credits": 0,
        "prerequisites": "",
        "corequisites": "",
        "description": "Health and safety issues for engineering projects: Quebec and Canadian legislation; safe work practices; general laboratory safety common to all engineering disciplines, and specific laboratory safety pertaining to particular engineering disciplines. Review of the legal framework in Quebec, particularly the Professional Code and the Engineers Act, as well as professional ethics.",
        "components": "Lecture 1.5 hours per week; Tutorial 1 hour per week, alternate weeks",
        "notes": ""
    },
    {
        "title": "ENGR 202 Sustainable Development and Environmental Stewardship (1.5 credits)",
        "credits": 0,
        "prerequisites": "",
        "corequisites": "",
        "description": "Introduction to the concept of sustainable development and the approaches for achieving it. Relationships with economic, social, and technological development. Methods for evaluating sustainability of engineering projects, including utilization of relevant databases and software. Impact of engineering design and industrial development on the environment. Case studies.",
        "components": "Lecture 1.5 hours per week",
        "notes": ""
    },
    {
        "title": "ENGR 208 Engineering C.Edge Option Reflective Learning II",
        "credits": 3,
        "prerequisites": "ENGR 108 ",
        "corequisites": "",
        "description": "This course expands on the students’ second C.Edge term in their related field of study to further develop their knowledge and work‑related skills.",
        "components": "Lecture",
        "notes": ""
    },
    {
        "title": "ENGR 213 Applied Ordinary Differential Equations",
        "credits": 3,
        "prerequisites": "MATH 204 (Cegep Mathematics 105)",
        "corequisites": "",
        "description": "This course introduces Engineering students to the theory and application of ordinary differential equations. Definition and terminology, initial‑value problems, separable differential equations, linear equations, exact equations, solutions by substitution, linear models, orthogonal trajectories, complex numbers, form of complex numbers: powers and roots, theory: linear equations, homogeneous linear equations with constant coefficients, undetermined coefficients, variation of parameters, Cauchy‑Euler equation, reduction of order, linear models: initial value, review of power series, power series solutions, theory, homogeneous linear systems, solution by diagonalization, non‑homogeneous linear systems. Eigenvalues and eigenvectors.",
        "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
        "notes": ""
    },
    {
        "title": "ENGR 233 Applied Advanced Calculus",
        "credits": 3,
        "prerequisites": "MATH 204 (Cegep Mathematics 105); MATH 205 (Cegep Mathematics 203)",
        "corequisites": "",
        "description": "This course introduces Engineering students to the theory and application of advanced calculus. Functions of several variables, partial derivatives, total and exact differentials, approximations with differentials. Tangent plane and normal line to a surface, directional derivatives, gradient. Double and triple integrals. Polar, cylindrical, and spherical coordinates. Change of variables in double and triple integrals. Vector differential calculus; divergence, curl, curvature, line integrals, Green’s theorem, surface integrals, divergence theorem, applications of divergence theorem, Stokes’ theorem.",
        "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
        "notes": ""
    },
    {
        "title": "ENGR 242 Statics",
        "credits": 3,
        "prerequisites": "ENGR 213 ",
        "corequisites": "",
        "description": "Resultant of  force  systems;  equilibrium  of  particles and  rigid  bodies;  distributed  forces;  statically  determinate  systems; trusses; friction; moments of inertia; virtual work. Shear and bending moment diagrams.",
        "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
        "notes": ""
    },
    {
        "title": "ENGR 243 Dynamics",
        "credits": 3,
        "prerequisites": "ENGR 213 , ENGR 242 ",
        "corequisites": "",
        "description": "Kinematics of a particle and rigid body; forces and accelerations; work and energy; impulse and momentum; dynamics of a system of particles and rigid bodies, introduction to vibrations.",
        "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
        "notes": ""
    },
    {
        "title": "ENGR 244 Mechanics of Materials (3.75 credits)",
        "credits": 0,
        "prerequisites": "ENGR 213 ; ENGR 242 or ENGR 245 ",
        "corequisites": "ENGR 233 ",
        "description": "This course covers the following topics: mechanical behaviour of materials; stress; strain; review of shear and bending moment diagrams; analysis and design of structural and machine elements subjected to axial, torsional, and flexural loadings; combined stresses and stress transformation; deflections; introduction to elastic stability and buckling behaviour.",
        "components": "Lecture 3 hours per week; Tutorial 2 hours per week; Laboratory 3 hours per week, alternate weeks",
        "notes": ""
    },
    {
        "title": "ENGR 245 Mechanical Analysis",
        "credits": 3,
        "prerequisites": "PHYS 204 ",
        "corequisites": "",
        "description": "This course covers the following topics: forces in a plane and in space, moments of forces, rigid bodies in equilibrium, and free‑body diagram; centroids and centres of gravity; distributed forces and moments of inertia; principle of virtual work; kinematics of particles and rigid bodies; forces and accelerations; work and energy; kinetics of particles and rigid bodies.",
        "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
        "notes": ""
    },
    {
        "title": "ENGR 251 Thermodynamics I",
        "credits": 3,
        "prerequisites": "MATH 203 (Cegep Mathematics 103)",
        "corequisites": "",
        "description": "Basic principles of thermodynamics and their application to various systems composed of pure substances and their homogeneous non‑reactive mixtures. Simple power production and utilization cycles.",
        "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
        "notes": ""
    },
    {
        "title": "ENGR 290 Introductory Engineering Team Design Project",
        "credits": 3,
        "prerequisites": "COEN 243 ; ENCS 282 ; ENGR 213 , ENGR 233 ",
        "corequisites": "",
        "description": "The introductory team design project introduces students to teamwork, project management, engineering design for a complex problem, technical writing and technical presentation in a team environment. Students work in teams and each team designs and builds a prototype defined by the Department. Students present their design and demonstrate that their design works in a competition at the end of the term. The students are also introduced to the basic principles of mechanics including the description of translational motion, rotational motion, forces and moments, work and energy, and they build a mechanical prototype to which the electronics and software are then added. A significant team project is required in this course.",
        "components": "Lecture 3 hours per week; Tutorial 2 hours per week Notes: All written documentation must follow the Concordia Form and Style guide. Students are responsible for obtaining this document before beginning the project.",
        "notes": "All written documentation mustfollow the Concordia Form and Style guide. Students are responsible for obtaining this document before beginning the project."
    },
    {
        "title": "ENGR 301 Engineering Management Principles and Economics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Introduction to project delivery systems. Principles of project management; role and activity of a manager; enterprise organizational charts; cost estimating; planning and control. Company finances; interest and time value of money; discounted cash flow; evaluation of projects in private and public sectors; depreciation methods; business tax regulations; decision tree; sensitivity analysis.",
        "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
        "notes": ""
    },
    {
        "title": "ENGR 308 Engineering C.Edge Option Reflective Learning III",
        "credits": 3,
        "prerequisites": "ENGR 208 ",
        "corequisites": "",
        "description": "This course further expands on the students’ third C.Edge term in their related field of study to further develop their knowledge and work‑related skills.",
        "components": "Lecture",
        "notes": ""
    },
    {
        "title": "ENGR 311 Transform Calculus and Partial Differential Equations",
        "credits": 3,
        "prerequisites": "ENGR 213 , ENGR 233 ",
        "corequisites": "",
        "description": "This course covers the following topics: the Laplace transforms and their application to the solution of ordinary differential equations; Fourier series; elements of partial differential equations; Fourier method of separation of variables for the solution of partial differential equations; the one-dimensional transient heat conduction parabolic equation; the one-dimensional wave hyperbolic equation; the two-dimensional Laplace elliptic equation.",
        "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
        "notes": ""
    },
    {
        "title": "ENGR 361 Fluid Mechanics I",
        "credits": 3,
        "prerequisites": "ENGR 213 , ENGR 233 , ENGR 251 ",
        "corequisites": "",
        "description": "Basic concepts and principles of fluid mechanics. Classification of fluid flow. Hydrostatic forces on plane and curved surfaces, buoyancy and stability, fluids in rigid body motion. Mass, momentum, and energy conservation integral equations. Bernoulli equation. Basic concepts of pipe and duct flow. Introduction to Navier‑Stokes equations. Similarity and model studies.",
        "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
        "notes": ""
    },
    {
        "title": "ENGR 371 Probability and Statistics in Engineering",
        "credits": 3,
        "prerequisites": "ENGR 213 , ENGR 233 ",
        "corequisites": "",
        "description": "This course starts out with axioms of probability theory, events, conditional probability and Bayes theorem. Next, random variables are introduced. Here, mathematical expectation, discrete and continuous probability density functions are covered. In statistics sampling distributions, interval estimation and hypothesis testing are introduced. The course includes applications to engineering problems.",
        "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
        "notes": ""
    },
    {
        "title": "ENGR 391 Numerical Methods in Engineering",
        "credits": 3,
        "prerequisites": "ENGR 213 , ENGR 233 ; COMP 248 or COEN 243 or MECH 215 or MIAE 215 or BCEE 231 ",
        "corequisites": "",
        "description": "This course focuses on roots of algebraic and transcendental equations; function approximation; solution of simultaneous algebraic equations; interpolation; regression; introduction to machine learning; numerical differentiation; numerical integration; numerical solutions of ordinary differential equations and partial differential equations; reliability; conditioning; error analysis. Implementation using GNU Octave/MATLAB.",
        "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
        "notes": ""
    },
    {
        "title": "ENGR 392 Impact of Technology on Society",
        "credits": 3,
        "prerequisites": "ENCS 282 ; ENGR 201 , ENGR 202 ",
        "corequisites": "",
        "description": "Social history of technology and of science including the industrial revolution and modern times. Engineering and scientific creativity, social and environmental problems created by uncontrolled technology, appropriate technology.",
        "components": "Lecture 3 hours per week",
        "notes": ""
    },
    {
        "title": "ENGR 411 Special Technical Report",
        "credits": 1,
        "prerequisites": "ENCS 282 ",
        "corequisites": "",
        "description": "Students must submit a report on a topic related to the students’ discipline and approved by the Department. The report must present a review of a current engineering problem, a proposal for a design project, or a current engineering practice.",
        "components": "Lecture Notes: Students who have received credit for ENGR 410 may not take this course for credit.",
        "notes": "Students who have received credit for ENGR 410 may not take this course for credit."
    },
    {
        "title": "ENGR 412 Honours Research Project",
        "credits": 3,
        "prerequisites": "ENCS 282 ",
        "corequisites": "",
        "description": "Students work on a research project in their area of concentration, selected in consultation with and conducted under the supervision of a faculty member of the Department. The student’s work must culminate in a final report, as well as an oral presentation. Students planning to register for this course should consult with the Department prior to term of planned registration. Intended for students with potential interest in graduate programs.",
        "components": "Research Notes: Must be approved by the Department prior to registration",
        "notes": "Mustbeapprovedby theDepartmentpriorto registration"
    },
    {
        "title": "ENGR 472 Robot Manipulators (3.5 credits)",
        "credits": 0,
        "prerequisites": "ELEC 372 or MECH 371 ",
        "corequisites": "",
        "description": "Spatial descriptions and transformations. Manipulator forward and inverse kinematics. Jacobians: velocities and static forces. Manipulator dynamics. Trajectory generation. Position control of manipulators. Force control of manipulators. Robot programming languages.",
        "components": "Lecture 3 hours per week; Laboratory 15 hours total",
        "notes": ""
    },
    {
        "title": "ENGR 490 Multidisciplinary Capstone Design Project",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Students work on a supervised team project to solve a complex interdisciplinary design problem. The project is completed by a team of students from at least two different departments in Gina Cody School of Engineering and Computer Science. The project must provide clear goals for each discipline‑specific task and each student must have sufficient exposure to subjects in their program of study. Student eligibility and project topics for this course are subject to approval by the ENGR 490 Design Committee, which includes a member from each department in Gina Cody School of Engineering and Computer Science that offers undergraduate programs. This committee vets each project to ensure the clarity and scope of the goals and its relevance to the learning outcomes of students from each discipline. The project is carried out over both fall and winter terms. Students are expected to provide a preliminary project proposal, a progress and a final report (as a group); take part in group discussions in audit sessions during the design phase; and participate in a poster session involving individual oral presentations at the end of the winter term. In addition to the technical aspects, students are expected to learn how to evaluate their designs for compliance to regulations, environmental and societal expectations and economic issues. Students learn how to work in a multidisciplinary environment and receive exposure to entrepreneurial skills.",
        "components": "Lecture 1 hour per week, two terms; Laboratory Equivalent time, 5 hours per week, two terms Notes: Students work in groups under direct supervision of a faculty member.",
        "notes": "Studentsworkin groupsunderdirectsupervisionof a facultymember."
    },
    {
        "title": "ENGR 498 Topics in Engineering",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course may be offered in a given year upon the authorization of the Gina Cody School of Engineering and Computer Science. The course content may vary from offering to offering. Notes: This course may be offered in a given year upon the authorization of the GCS.",
        "components": "",
        "notes": "Thiscoursemaybeofferedin a givenyearupontheauthorizationof theGCS."
    }
]