[
	{
		"title": "ARTH 353 Technology and Contemporary Art",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "A selective examination of the relationship between technology and contemporary art.",
		"components": "Lecture",
		"notes": ""
	},
	{
		"title": "ARTH 354 Studies in Interdisciplinarity in the Visual Arts",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "A selective examination of historical and contemporary art that utilizes a number of media.",
		"components": "Lecture",
		"notes": ""
	},
	{
		"title": "COMS 360 Mass Media",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "The course examines the nature and forms of mass media, its social sources and uses, audiences, and effects. Issues such as media ownership and access, government and self-regulation, technological implications, ethics and accountability may be discussed.",
		"components": "Lecture",
		"notes": ""
	},
	{
		"title": "ENGL 224 The Creative Process",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course introduces students to some options for developing their own process of literary creation, from the ENGLISH development of an idea through to the writing and editing of works of prose fiction, poetry, and/or drama. Coursework may include writing assignments, in‑class exercises, readings, group presentations, and discussions. This course is open to all students.",
		"components": "Lecture",
		"notes": "This course does not count for credit in any Creative Writing program (Major, Minor, Honours in English and Creative Writing)"
	},
	{
		"title": "ENGL 233 Critical Reading (3.00)",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course is an introduction to the practice of close reading of selections chosen from poetry, fiction, drama, and non‑literary prose with the aim of developing the skills necessary to respond to written texts.",
		"components": "Lecture",
		"notes": ""
	},
	{
		"title": "FLIT 240 Introduction aux littératures et aux cultures de la Francophonie (3.00)",
		"credits": 3,
		"prerequisites": "Le cours suivant doit être complété au préalable: FRAN 301 ou FRAN 303 ou l’équivalent.",
		"corequisites": "",
		"description": "Introduction aux littératures et aux cultures des pays francophones du sud et à leurs spécificités historiques, sociales et linguistiques par la lecture et l’étude de quelques oeuvres représentatives.",
		"components": "Lecture",
		"notes": "Ce cours est réservé aux étudiantes et étudiants ayant effectué leurs études secondaires dans une langue autre que le français."
	},
	{
		"title": "FMST 214 Canadian Cinema (3.00)",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "A survey of Canadian film from the earliest surviving works to the present. Topics include fiction, documentary, animation, and experimental film, as well as the role of the National Film Board. The course includes discussions of national and transnational cinema within the Canadian context. Weekly screenings.",
		"components": "Lecture",
		"notes": ""
	},
	{
		"title": "FMST 215 Le cinéma québécois (3.00)",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "Tour d’horizon du cinéma québécois mettant l’accent sur des œuvres contemporaines. Les films sont examinés en fonction de leur valeur culturelle et politique. On y traite également de la structure de l’industrie du cinéma au Québec et du rôle joué, entre autres, par l’Office national du film. Visionnements hebdomadaires.",
		"components": "Lecture",
		"notes": "Ce cours peut, à l’occasion, être offert en anglais. / This course may occasionally be taught in English."
	},
	{
		"title": "HIST 202 Modern Europe (3.00)",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "A survey of the history of Europe from the French Revolution to the present, with emphasis on the development of ideas and political institutions.",
		"components": "Lecture",
		"notes": "Students who have received credit for HISW 202 may not take this course for credit."
	},
	{
		"title": "HIST 205 History of Canada, Post‑Confederation (3.00)",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "A survey of Canadian history from Confederation to the present, emphasizing readings and discussions on selected problems.",
		"components": "Lecture",
		"notes": "Students who have received credit for HISW 205 or SCPA 205 may not take this course for credit."
	},
	{
		"title": "HIST 281 Film in History (3.00)",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course examines how selected commercial films interpret historical events or provide insight into the politics, society, and culture of the times in which they were produced. The course is designed to help develop critical skills for the understanding of film in an historical framework.",
		"components": "Lecture",
		"notes": "Students who have received credit for HISW 281 or this topic under a HIST 298 number may not take this course for credit."
	},
	{
		"title": "HIST 283 The 20th Century: A Global History (3.00)",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course introduces students to the history of some of the forces and institutions that have shaped the history of the world in the 20th century, which has been characterized by widespread warfare, genocides, and massive violations against human rights and the natural environment. It has also been a time of unprecedented prosperity of some groups and parts of the globe, as well as an era of tremendous scientific advances.",
		"components": "Lecture",
		"notes": "Students who have received credit for HISW 283, LOYC 210, or for this topic under a HIST 298 number may not take this course for credit."
	},
	{
		"title": "LBCL 201 Great Books: Western History and Thought from Antiquity through the Renaissance (3.00)",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "Social and political theory are central, and art, music, and scientific thought are represented. Key texts may include the Bible, Plato’s Republic, Thucydides’ Peloponnesian Wars, St. Augustine’s City of God, and Machiavelli’s Prince and Discourses.",
		"components": "Lecture; Seminar",
		"notes": "Students who have received credit for LBCL 291 or LBCL 292 may not take this course for credit."
	},
	{
		"title": "LBCL 202 Great Books: Western Culture and Expression from Antiquity through the Renaissance",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "Literature, religion, and philosophy are central, and art and music are represented. Key texts may include Homer’s Odyssey, Virgil’s Aeneid, Montaigne’s Essays, and Shakespeare’s King Lear.",
		"components": "Lecture; Seminar",
		"notes": "Students who have received credit for LBCL 291 or LBCL 292 may not take this course for credit."
	},
	{
		"title": "LBCL 203 Great Books: Western History and Thought from the Reformation through Modernity",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "Social and political theory are central, and art, music, and scientific thought are represented. Key texts may include Calvin’s Institutes, Descartes’ Discourses on Method, Hobbes’ Leviathan, and Mill’s Essay on Liberty.",
		"components": "Lecture; Seminar",
		"notes": "Students who have received credit for LBCL 291 or LBCL 292 may not take this course for credit."
	},
	{
		"title": "LBCL 204 Great Books: Western Culture and Expression from the Reformation through Modernity",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "Literature, religion, and philosophy are central, and art and music are represented. Key texts may include Milton’s Paradise Lost, Rousseau’s Confessions, Stendhal’s The Red and the Black, and Nietzsche’s Genealogy of Morals.",
		"components": "Lecture; Seminar",
		"notes": "Students who have received credit for LBCL 291 or LBCL 292 may not take this course for credit."
	},
	{
		"title": "PHIL 201 Problems of Philosophy",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course is an introduction to argumentation and reasoning. It focuses on the kinds of arguments one is likely to encounter in academic work, in the media, and in philosophical, social, and political debate. The course aims to improve students’ ability to advance arguments persuasively and their ability to respond critically to the arguments of others. Students will find the skills they gain in this course useful in virtually every area of study.",
		"components": "Online",
		"notes": ""
	},
	{
		"title": "PHIL 232 Introduction to Ethics",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "Philosophical discussions of ethics have both practical significance (What should one do?) and theoretical interest (What does imean to say, “That’s the right thing to do”?). In this course, students are introduced to some representative approaches to ethical thought and action. General questions about the nature of ethical reasoning are also considered. For example: Are there objective ethical truths or are ethical judgments merely relative to social norms? An effort is made to incorporate those ethical issues which are of specific importance to contemporary society.",
		"components": "Lecture; Conference",
		"notes": ""
	},
	{
		"title": "PHIL 233 Applied Ethics",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course focuses on ethical theory and its application to contemporary issues. The course covers central ethical theories such as virtue ethics (Aristotle), deontology (Kant), and utilitarianism (Mill). It applies these theories to contemporary moral issues such as humans’ relation to the environment and nonhuman animals, abortion, consumerism, the use of recreational drugs, the rationing of health-care resources, and national and international distributive justice.",
		"components": "Lecture",
		"notes": "Students who have received credit for this topic under a PHIL 298 number may not take this course for credit."
	},
	{
		"title": "PHIL 235 Biomedical Ethics",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course is primarily concerned with contemporary biomedical debates, many of which are of current social and political significance: euthanasia and physician‑assisted suicide, patients’ rights, animal experimentation, organ donation and transplantation, palliative care, abortion, genetic engineering, and new reproductive technologies.",
		"components": "Online",
		"notes": ""
	},
	{
		"title": "PHIL 275 From Modern to Postmodern: Philosophical Thought and Cultural Critique",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course focuses on key developments in modern and postmodern philosophy and their cultural influences. The course provides an introduction to philosophers (such as Kant, Nietzsche, and Foucault) and philosophical movements (such as empiricism, existentialism, and post‑structuralism) of the modern era. It also introduces students to the tremendous influence that philosophical theory has had on the arts, on social and political movements, and on virtually every field of study in the humanities and social sciences.",
		"components": "Lecture",
		"notes": ""
	},
	{
		"title": "PHIL 330 Contemporary Ethical Theory",
		"credits": 3,
		"prerequisites": " PHIL 232 or PHIL 233 or PHIL 235 or PHIL 236 or PHIL 241",
		"corequisites": "",
		"description": "This course provides an examination of contemporary ethical theories such as deontology, utilitarianism, virtue theory, feminist ethics, and narrative ethics.",
		"components": "Lecture",
		"notes": "Students who have received credit for this topic under a PHIL 398 number may not take this course for credit."
	},
	{
		"title": "THEO 202 Introduction to Biblical Studies",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course provides a survey of the contents of the Bible, from Genesis to Revelation, and a practical introduction to the skills required to understand biblical texts. Attention is paid to diverse approaches to interpretation which are used in historical, literary, or theological study of the Bible.",
		"components": "",
		"notes": ""
	},
	{
		"title": "THEO 204 Introduction to Christian Ethics",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course is an introduction to the field of ethics in the context of Christian faith. Christian ethics is presented as an active quest towards understanding and guiding Christian moral living. There are four parts to this course: 1) a brief exploration of the historical background; 2) key insights on moral knowing, moral persons and the social dimension of moral life; 3) a consideration of the problem of evil and the response of Christian faith; and 4) an exploration of how moral development shapes and informs one's relationship with and understanding of God.",
		"components": "Lecture",
		"notes": ""
	},
	{
		"title": "THEO 233 Religious Pluralism in a Secular Culture",
		"credits": 3,
		"prerequisites": "",
		"corequisites": "",
		"description": "This course focuses on the relationships between religion, pluralism, and secular culture. It deals specifically with secularization, secularism and theological responses that are rooted in historical discourses of church/state relations.",
		"components": "Lecture",
		"notes": ""
	}
]
