[
  {
    "id": "MANA 201",
    "title": "MANA 201 Introduction to Business and Management",
    "credits": 3,
    "prereqs": "",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "This course introduces students to the basic principles of management within a contemporary business context. The managerial process is explored in relation to issues such as organizational structure and innovation in large and small organizations, strategy formulation and planning, operations and marketing management. Students are exposed to in-depth industry and market analysis methods and do research pertaining to their chosen industry. The course includes basic readings in management and contemporary text from business publications. Particular focus is placed on entrepreneurship and its impact and value on economic and social systems.",
    "components": "Lecture",
    "notes": "John Molson School of Business students may not take this course for credit. Students entering the BComm or BAdmin program as of September 2013 may not take this course for credit. Students who have received credit for ADMI 201, ADMI 202, MANA 266, or COMM 210 may not take this course for credit."
  },
  {
    "id": "MANA 202",
    "title": "MANA 202 Human Behaviour in Organizations",
    "credits": 3,
    "prereqs": "",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "This course seeks to give students an understanding of behaviour in the workplace, the factors that influence behaviour, and the relationships among these factors. Conceptual frameworks, case discussions, and self-assessment tools complement the course material. Topics include personality and learning, motivation, group dynamics, teamwork and diversity, influence and leadership, and stress management.",
    "components": "Lecture",
    "notes": "John Molson School of Business students may not take this course for credit. Students entering the BComm or BAdmin program as of September 2013 may not take this course for credit. Students who have received credit for MANA 213 or COMM 222 may not take this course for credit."
  },
  {
    "id": "MANA 300",
    "title": "MANA 300 Entrepreneurship: Launching Your Business",
    "credits": 3,
    "prereqs": "ADMI 201 or ADMI 202 or MANA 201. Students must have completed 60 credits in a non-business program prior to enrolling. If prerequisites are not satisfied, written permission of the Department of Management is required.",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "This final‑year course offers students the opportunity to learn how to capitalize on their domain‑specific knowledge and recognize opportunities for self-employment or new venture creation. The course presumes that students have already developed an interest in entrepreneurial careers within their respective fields of study. The first phase of the course reviews fundamental concepts and issues in entrepreneurship and related business fields. The second phase introduces students to the elements of business planning in the context of entrepreneurial projects, followed by the third phase where students formulate their own business plans.",
    "components": "Lecture",
    "notes": "John Molson School of Business students may not take this course for credit. This course does not count toward the requirements of the Minor in Business Studies."
  },
  {
    "id": "MARK 201",
    "title": "MARK 201 Introduction to Marketing",
    "credits": 3,
    "prereqs": "",
    "coreqs": "",
    "prerequisites": [],
    "corequisites": [],
    "description": "This course introduces non-Commerce students to the managerial concepts and practices of marketing. The process of developing a marketing strategy is examined along with the factors and interrelationships related thereto. Readings and cases are used to help students apply these concepts in a variety of business settings.",
    "components": "Lecture",
    "notes": "This course is available to non-Commerce program students only. Any such student intending to register in the Marketing Elective Group for Non-Commerce Students or intending to take specific upper-level Marketing courses must take this course as a prerequisite."
  }
]
