[
  {
    "title": "ANTH 202 Introduction to Culture",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "An introduction to the anthropological study of culture. The course begins with a consideration of the concepts, models, and methods used by anthropologists. This is followed by an examination of the many ways in which peoples of the world, past and present, have organized the activities, institutions, and belief systems that sustain social life. The course concludes with a discussion of the relevance of cultural anthropology to contemporary issues.",
    "components": "Lecture; Tutorial",
    "notes": ""
  },
  {
      "title": "ECON 201 Introduction to Microeconomics",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course covers basic concepts in microeconomics. Students are introduced to a university-level approach to supply and demand, elasticity, and consumer behaviour, as well as production theory, firm behaviour, and market structures. The role of government and the gains from trade are also examined.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "ECON 203 Introduction to Macroeconomics",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "An introductory analysis of aggregate economic activity. The focus is on the principles of determination of the level of employment, national income, real output, inflation, and international balance of payments. The course also analyzes the principles which govern trade relations among countries. These topics are integrated by a discussion of government monetary and fiscal policies to stabilize economic activity.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "EDUC 230 Introduction to Philosophy of Education",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course introduces the student to the content and form of several major educational theories, and to conceptual and logical procedures of philosophizing about education, with particular reference to teaching and learning.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "ENCS 483 Creativity, Innovation and Critical Thinking in Science and Technology",
      "credits": 3,
      "prerequisites": "Students must complete a minimum of 60 credits in an engineering program or minimum of 45 credits in a non-engineering program prior to enrolling.",
      "corequisites": "",
      "description": "Understanding, thinking, arguing, and creativity in science and technology; analyzing and critiquing complex problems using multidisciplinary theories of creativity; exploring the processes of invention and innovation and their impact on economics, popular media, and social and cultural structures; case studies of why some inventions fail and others succeed. Students will be evaluated on case studies, assignments, and a project.",
      "components": "Lecture 3 hours per week",
      "notes": "Students who have received credit for ENCS 283 may not take this course for credit."
  },
  {
      "title": "ENCS 484 Development and Global Engineering",
      "credits": 3,
      "prerequisites": "Students must complete a minimum of 60 credits in an engineering program or minimum of 45 credits in a non-engineering program prior to enrolling.",
      "corequisites": "",
      "description": "International development and global engineering: globalization; development projects; planning and analysis; and participatory data gathering. A project.",
      "components": "Lecture 3 hours per week",
      "notes": "Students who have received credit for this topic under an ENCS 498 number may not take this course for credit."
  },
  {
      "title": "ENCS 485 Field Course in Engineering and Sustainable Development",
      "credits": 3,
      "prerequisites": "Students must complete a minimum of 24 credits towards an undergraduate program offered by the Gina Cody School of Engineering and Computer Science prior to enrolling, with a minimum GPA of 2.50.",
      "corequisites": "",
      "description": "This is a complementary field course for undergraduate students interested in areas of international development and global engineering. The course consists of lectures at Concordia University followed by a trip to a designated location where development is underway. Topics include location and context‑specific history and evolution of development, globalization, sustainability initiatives, technological planning and analysis, and participatory data gathering. Students are required to complete a project‑based research paper on a topic approved by the course instructor.",
      "components": "Lecture; Fieldwork",
      "notes": "Students from other Faculties may register for this course with permission from the course instructor."
  },
  {
      "title": "GEOG 203 Canadian Environmental Issues",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course examines the diversity and complexity of Canadian environmental issues from an interdisciplinary perspective. Natural science considerations are explored as well as the relationship of scientific understanding to policy and wider social action. Issues addressed include fisheries, animal rights, biodiversity conservation, protected areas, energy, and climate change.",
      "components": "Lecture",
      "notes": "Students currently registered in a Human Environment, Environmental Geography, or Environmental and Sustainability Science program may not take this course for credit."
  },
  {
      "title": "GEOG 204 Global Environmental Issues",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course examines a number of global environmental issues from an interdisciplinary perspective. The complex interactions and interdependencies among the biophysical, socio‑economic, political, and cultural aspects of global environmental change are explored in relation to issues such as global warming, desertification, deforestation, declining biodiversity, and acid rain.",
      "components": "Lecture",
      "notes": "Students currently registered in a Human Environment, Environmental Geography, or Environmental and Sustainability Science program may not take this course for credit."
  },
  {
      "title": "GEOG 210 Geography of Global Change",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course examines a variety of geographical changes related to globalization. It focuses mainly on the global political system and the global economy, and also considers transport and communications systems, culture, and environmental issues.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "GEOG 220 Place, Space, and Identity",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course examines how place is constructed through subjective encounters of humans with each other and with the non‑human world. This focus reveals how the unique and contested identities of places are created and how space itself is socially constructed. The ways in which place, space and identity affect and are affected by political, economic, cultural and environmental changes are then examined within the context of existing patterns of geographical unevenness.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "INST 250 Introductory Information Literacy Skills",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course is designed to introduce students to basic research practices. It familiarizes students with a variety of information sources in both print and non-print formats. Emphasis is placed on developing a systematic search strategy in the use and evaluation of the information sources. Topics such as outlining and bibliographic format are covered as part of the research process.",
      "components": "Lecture",
      "notes": "Students who have received credit for EDUC 250 may not take this course for credit."
  },
  {
      "title": "LING 222 Language and Mind: The Chomskyan Program",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course uses language as a tool to examine the workings of the human mind. It approaches the study of language from the perspective of generative grammar as developed by Noam Chomsky and his collaborators. It deals with patterns of linguistic structure, rather than content or meaning. The goal of this course is to develop an understanding of the field of cognitive science (the study of knowledge and the mind/brain) and determine how linguistics fits in with disciplines like the study of vision, auditory perception, and reasoning.",
      "components": "Lecture",
      "notes": "Students who have received credit for this topic under a LING 398 number may not take this course for credit."
  },
  {
      "title": "LING 300 Sociolinguistics",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course studies the beliefs, interrelationships, and values of societal groups as reflected in language.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "POLI 202 Introduction to Political Science",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course seeks to develop a broad basis from which to pursue further political inquiry. It offers an introductory examination of basic ideas regarding the state, power, authority, and systems of government. The course examines the diverse approaches to the specific study of political phenomena and provides a fundamental understanding of political concepts.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "RELI 214 Religions of the West",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course surveys the history, doctrines, institutions, and practices of religions that arose in Western Asia, including Judaism, Christianity, and Islam. The course examines contemporary forms of religious life in those parts of the world where these traditions have spread, as well as indigenous religions. The course explores the religious activities and experiences of both women and men within these various traditions.",
      "components": "Lecture",
      "notes": "Students who have received credit for RELI 213 may not take this course for credit."
  },
  {
      "title": "RELI 215 Religions of Asia",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course surveys the history, doctrines, institutions, and practices of religions that have arisen in and spread throughout Asia, including Hinduism, Buddhism, and the religions of China and Japan. The course explores the religious activities and experiences of both women and men within these traditions.",
      "components": "Lecture",
      "notes": "Students who have received credit for RELI 213 may not take this course for credit."
  },
  {
      "title": "RELI 216 Encountering Religions",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course serves as an introduction to some of the religions of today’s world, and explores several contemporary contexts where people of diverse religious backgrounds come into contact with one another.",
      "components": "Lecture",
      "notes": "Students who have received credit for this topic under a RELI 298 number may not take this course for credit."
  },
  {
      "title": "RELI 310 Self and Other: Identity and Ethical Development",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course considers ethical issues arising in the context of personal and interpersonal relations, families and friendships, and health and medical care. These issues are discussed in relation to traditional and contemporary moral perspectives, both religious and non‑religious. Topics covered may vary from year to year, but may include discussions of conscience and career, privacy, sexual relations, harassment, substance abuse, abortion, euthanasia, and gay and lesbian relations.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "RELI 312 Justice and Social Conflict in a Globalized World",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course considers ethical issues arising in the context of social, legal, and political relations. These issues are discussed in relation to both traditional and contemporary moral perspectives, both religious and non‑religious. Topics covered typically include discussions of social and economic inequality, welfare, poverty, just punishment, business ethics, public ethics, economic development, and sustainable development.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "RELI 374 Religion and Science",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "How has religion viewed science, and how has science viewed religion? This course explores the relationship between religion and science both within particular religio‑cultural contexts and in comparative perspective. The contexts considered may include those belonging to Christian, Jewish, Muslim, Hindu, or other Asian worldviews. Points of conflict and contact between scientific and religious discourses are also explored.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "SCPA 215 Economics for Public Policy and Community Development",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "Based on an overview of current economic issues, this course introduces students to the fundamental analytical tools and concepts that are necessary to understand economic public policy and relevant to community development and empowerment.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "SOCI 203 Introduction to Society",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "An introduction to the sociological study of society. The course begins with a consideration of the concepts, models, and methods used by sociologists. This is followed by an examination of selected substantive areas of social life, ranging from the relations between individuals and groups to total societies.",
      "components": "Lecture; Tutorial",
      "notes": ""
  },
  {
      "title": "URBS 230 Urbanization: Global and Historical Perspectives",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course examines how and why cities grow and change over time. The relationships between socio‑cultural, economic, and physical aspects of urban development are considered at the local, city, and regional scales.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "WSDB 290 Introduction to Historical Perspectives in Women’s Studies",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course provides an introduction to theories and writing that affect the lives of women. Through the writing of feminist authors, students examine, from mainly the 20th century, the development of feminist theories and debate. Specific authors may include Simone de Beauvoir, Audre Lorde, Gloria Anzaldua, Angela Davis, Adrienne Rich, Monique Wittig, and Chandra Mohanty.",
      "components": "Lecture",
      "notes": ""
  },
  {
      "title": "WSDB 291 Introduction to Contemporary Concerns in Women’s Studies",
      "credits": 3,
      "prerequisites": "",
      "corequisites": "",
      "description": "This course explores a range of current issues and debates within feminism. Using interdisciplinary feminist theories that consider how systems of power such as patriarchy, capitalism, racism, and heterosexism constitute one another, it examines particular local and global topics of interest/concern which may include health, education, work, violence against women, globalization, militarism, media and cultural representations, families, and feminist activism.",
      "components": "Lecture",
      "notes": "Students who have received credit for WSDZ 291 may not take this course for credit."
  }
]