[
  {
    "title": "SOCI 203 Introduction to Society",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "An introduction to the sociological study of society. The course begins with a consideration of the concepts, models, and methods used by sociologists. This is followed by an examination of selected substantive areas of social life, ranging from the relations between individuals and groups to total societies.",
    "components": "Lecture; Tutorial",
    "notes": null
  },
  {
    "title": "SOCI 212 Statistics I",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course provides an introduction to the basic principles of statistics for social scientists. Topics include the concept of the level of measurement, standardization, the interpretation of graphs, measures of univariate distributions, cross classification, elementary measures of association, and the logic of controls. The emphasis is on the implications of these statistical techniques for theoretical understanding of sociology and anthropology.",
    "components": "Lecture",
    "notes": "Priority to enrol in this course is given to students who are in a Sociology or Anthropology program.Students who have received credit for BIOL 322, COMM 215, ECON 221, GEOG 362, MAST 333 or PSYC 315 may not take this course for credit."
  },
  {
    "title": "SOCI 213 Statistics II",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: SOCI 212.",
    "corequisites": "",
    "description": "This course is designed to follow Statistics I. Topics include measures of association, the principles of probability and sampling distributions, hypothesis testing, and tests of significance. The emphasis is on the implications of these statistical techniques for theoretical understanding in sociology and anthropology. This course also introduces students to SPSS (statistical software).",
    "components": "Lecture",
    "notes": "Priority to enrol in this course is given to students who are in a Sociology or Anthropology program.Students who have received credit for ECON 221 and ECON 222, MAST 221 and MAST 333, PSYC 315 and PSYC 316, or STAT 249 and STAT 250 may not take this course for credit."
  },
  {
    "title": "SOCI 221 Digital Culture",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course offers a critical examination of the role of electronic communication, information technology, and the Internet in public culture and the organization of social behaviour and interaction.",
    "components": "Lecture; Tutorial",
    "notes": null
  },
  {
    "title": "SOCI 225 Sociology Through Film",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "The course introduces sociological topics through popular films. Cinema, television, and online videos are selected as examples that can be understood through sociological concepts. Students are provided with a general foundation in sociological thought and interdisciplinary approaches for study at more advanced levels.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a SOCI 298 number may not take this course for credit."
  },
  {
    "title": "SOCI 230 Race and Ethnic Relations",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Race and ethnicity are examined as bases of social differentiation. Ethnic group relations are analyzed in relation to stratification and the exercise of power. The course further involves exploration of the phenomena of discrimination, prejudice, and intergroup accommodation.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 230 or BLST 230 may not take this course for credit."
  },
  {
    "title": "SOCI 244 Sociology of Leisure",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "The course examines the effects of social, economic, and political institutions upon the structure and use of leisure time. The emphasis is upon historical changes and the implications of alienation, anomie, and inequality.",
    "components": "Lecture",
    "notes": "Students who have received credit for SOCI 344 may not take this course for credit."
  },
  {
    "title": "SOCI 250 Sociology of Culture",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course provides an introduction to theory and research on the sociology of culture, the organization and dynamics of cultural systems, cultural production and consumption, subcultures, mass culture, popular culture, and strategies of interpretive analysis for the study of culture.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 252 Food and Culture",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course is an introduction to the study of food from a cultural perspective. Themes may include a) archaeology of food production (domestication of plants and animals); b) class, cuisine, and the development of taste; c) food symbolism; and d) the political economy of food and hunger.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 252, or for this topic under an ANTH 298 or SOCI 298 number, may not take this course for credit."
  },
  {
    "title": "SOCI 261 Social Problems",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Students examine a range of social problems related to aging, health, poverty, population growth, crowding, crime and justice, gender and gender orientation, inequality, media, non‑medical drug use, suicide, globalization, and race, ethnicity, and language issues. Attention is focused on the process by which social problems are defined and recognized, and social policies developed and modified.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 262 Social Deviance",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course focuses on the ways in which deviance and normalcy are socially constructed. It examines how deviance is related to social norms and how norms come into being. Deviance is viewed as a social process of interaction and relation that derives from the social structure and has consequences for it. Various forms of deviance are also considered in terms of contemporary social theory and research.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 263 Youth Crime and Deviance",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines the nature of youth crime and youth deviance and their social causes and consequences. Youth crime, as a special kind of deviance, receives the focus of attention, with emphasis on youth criminal justice and the social control of youth deviance generally.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 264 Sociology of Sport",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course provides a systematic analysis of the social influences upon sport in North America. Special attention is directed to the interrelationships between sport and various social institutions.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 274 The Sociology of Aging",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines the changes in society and in living conditions as populations and people age. The sources and the effects of these changes are looked at in the light of several substantive areas and in terms of their implications for social policy. While the major emphasis is on the Canadian experience, some comparative materials are used to widen the perspective.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 275 Self and Society",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course studies the basic concepts and theories regarding social definitions of the Self. Emphasis is placed on ideas regarding personality, motivation, and interpersonal attitudes, viewed in terms of the interplay between actors and social structures.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 276 Gender and Society",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course explores the social construction of gender categories both historically and in the present. The focus is upon examining the various theoretical perspectives which attempt to explain the ways in which society has organized “masculine” and “feminine” as the basis for social inequalities.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 276 may not take this course for credit."
  },
  {
    "title": "SOCI 277 Contemporary Issues in Economy, Society, and Biodiversity",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course explores the contemporary intersection of economic, societal, and ecological dynamics in capitalist societies while providing students with tools to understand and explain the historical embeddedness of these processes. Offering a comprehensive introductory view of these issues, the course deploys a multidisciplinary socio‑anthropological approach that also incorporates insight from geography, environmental sciences, and political science.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 277, or for this topic under an ANTH 298 or SOCI 298 number, may not take this course for credit."
  },
  {
    "title": "SOCI 280 Debates and Challenges in Contemporary Quebec Society / La Société québécoise : défis et enjeux",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "How distinct is Quebec from the rest of Canada? What are the most important challenges confronting Quebec society? This course provides students with a sense of Quebec’s history and demographics, a basic knowledge of provincial social policies, information pertaining to culture, identity and language issues, as well as key concepts which are useful to anyone who aims to live and work in Quebec. Dans quelle mesure le Québec est‑il distinct du reste du Canada? Quels sont les principaux défis auxquels le Québec est confronté? Ce cours offre aux étudiants une fenêtre sur l’histoire du Québec, sa démographie, ses politiques publiques et sa culture, tout en procurant des repères utiles à quiconque souhaite vivre et travailler au Québec.",
    "components": "Lecture",
    "notes": "This course is offered in either English or French. Consult the Undergraduate Class Schedule for details. Ce cours est offert en anglais ou en français. Prière de consulter l’horaire des cours de premier cycle pour en savoir plus."
  },
  {
    "title": "SOCI 282 Canadian Society",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Analysis of Canadian social structure and change; the relation of the whole of Canadian society to its constituent elements; the relation of Canadian society to its international environment.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 284 Risk Society and Social Control",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course introduces students to literature that discusses risk, surveillance, and social control. Emphasizing sociological and anthropological approaches, topics may include risk and surveillance in the contexts of local and global migrations, our changing climate, policing and national security, public health and medical care, work and leisure, consumption and addiction, urban spaces, and digital traces of our social relations and cultures. The course also prepares students interested in taking more advanced courses that deal with themes of risk, surveillance, fear, digital culture, consumption and addiction in everyday life.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 284, or for this topic under an ANTH 298 or SOCI 298 number, may not take this course for credit."
  },
  {
    "title": "SOCI 285 Introduction to Law and Society",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This interdisciplinary course examines the roles law plays in Canada and internationally, from the perspectives of history, political science, anthropology, sociology, and philosophy.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 285, HIST 285, or POLI 285, or for this topic under an ANTH 298, HIST 298, POLI 298, or SOCI 298 number, may not take this course for credit."
  },
  {
    "title": "SOCI 2910 HIV/AIDS in the 20th Century: Historical, Cultural and Interdisciplinary Perspectives",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course is an interdisciplinary survey of the major issues and challenges of the AIDS pandemic before the year 2000, introducing students to a broadly based overview of its scientific, social and cultural impacts. Students examine the history of the pandemic and responses to it by governments, medical authorities, businesses, religious and community groups, as well as artists and cultural producers.",
    "components": "Lecture",
    "notes": "Students who have received credit for FFAR 290, FFAR 291, FFAR 390, INTE 270, INTE 390, SOCI 290, SSDB 270, or for this topic under a COMS 399, INTE 298, INTE 398, or SOCI 399 number, may not take this course for credit."
  },
  {
    "title": "SOCI 292 Cultural Studies and Creation in HIV/AIDS",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This interdisciplinary course examines the cultural, creative, and artistic responses to HIV/AIDS. Through the lens of diverse historical and contemporary forms of expression, course content and class discussions focus on pandemic-related narratives relevant to the intersections of race, gender and sexuality.",
    "components": "Lecture",
    "notes": "Students who have received credit for FFAR 290, FFAR 292, INTE 270, INTE 390, SOCI 290, SSDB 270, or for this topic under a FFAR 398, INTE 398, or SOCI 399 number, may not take this course for credit."
  },
  {
    "title": "SOCI 298 Selected Topics in Sociology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and the Departmental Handbook.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 299 Selected Topics in Sociology",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and the Departmental Handbook.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 300 Classical Social Theory",
    "credits": 6,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course involves an examination of the origins of sociology and of the sociological works of 19th‑ and early‑20th‑century European theorists, with consideration of the social and political context. Particular emphasis is given to the works of Durkheim, Marx, and Weber. Readings include primary sources and critical commentaries.",
    "components": "Lecture; Tutorial",
    "notes": null
  },
  {
    "title": "SOCI 303 Indigenous Resurgence",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Through a selection of case studies from the Americas, Australia, and New Zealand, this course focuses on contemporary indigenous political struggles, cultural resurgence, race and identity, language revival, urbanization, transnational organization, indigenous media, and debates concerning tradition.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 303 may not take this course for credit."
  },
  {
    "title": "SOCI 310 Research Methods",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: SOCI 212. 300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course introduces students to the concepts, language, and techniques of quantitative and qualitative research methods. It familiarizes students with the initiation of research problems, the gathering of accurate data, their analysis and the interpretation and reporting of research findings. This course also introduces students to library research.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 319 Socio-Environmental Issues",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course provides a comprehensive introduction to the main environmental issues and dilemmas affecting contemporary societies around the world, as well as the necessary sociological and anthropological tools to understand and tackle these challenges.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 319 may not take this course for credit."
  },
  {
    "title": "SOCI 320 The Governance of ‘Nature’",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: SOCI 203 or equivalent; and 3 credits of 200-level Sociology courses.",
    "corequisites": "",
    "description": "This course explores historically enduring non-governmental institutions - such as botanic gardens, museums, and zoos and/or other institutions similar in kind - that seek to work in the service of society and play a role in the governance of ‘nature’ by producing and disseminating social, cultural, and environmental scientific knowledge in informal education settings. Topics covered may include the intersection of these institutions with the emergence of Modernity, European colonialism/coloniality, and current decolonization debates, as well as their reinvention in the 20th and 21st century as sites of socio-environmental conservation and climate change adaptation.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 320, or for this topic under an ANTH 398 or SOCI 398 number, may not take this course for credit."
  },
  {
    "title": "SOCI 321 Sociology of Health, Illness and Medicine",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course examines health, illness and medicine as socio‑cultural, rather than strictly biomedical, phenomena. Topics may include the sick role; stigma; the experience of illness; the concept of disease and disease classification; the politics of disease; medicalization of gender, “race,” and disability; and the Canadian health‑care system, including Big Pharma and Complementary and Alternative Medicine.",
    "components": "Lecture",
    "notes": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background."
  },
  {
    "title": "SOCI 322 Popular Culture in the Middle East",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course examines areas of contestation between such social forces in the Middle East as the state, elders, women, and youth as they seek to control and define popular culture and everyday practices which have become highly politicized. Contested domains to be considered include mass media, dance and music, art, rituals, sexuality, and clothing, and their implications for the people and societies involved.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 322 or ANTH 323, or for this topic under an ANTH 398 or SOCI 398 number, may not take this course for credit."
  },
  {
    "title": "SOCI 323 Economic Transformations in Capitalist Society",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses.",
    "corequisites": "",
    "description": "This course maps the emergence of capitalist society and its transformations over the 20th century, and also explores a number of its contemporary dynamics. The course takes a panoramic and integrated approach to the analysis of capitalist society, demonstrating the deep interconnectedness of what is referred to as “the economy” to all aspects of social life.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 325 Social Change",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course examines the sources, mechanisms, and consequences of social and cultural change. Classical and contemporary theories of change are analyzed, as well as significant empirical studies.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 329 Sexual Labour and Society",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course explores the sociology of sexual labour; the historical and legal contexts of sex industries; health and safety; media representations; online interactions; the emergence of sex worker organizations; and the intersections of private belief, public morality, consumer capitalism and the organization of justice. In addition to providing an overview of theoretical and methodological paradigms, the course is grounded in a comparative perspective that critically examines a variety of current events.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a SOCI 398 number may not take this course for credit."
  },
  {
    "title": "SOCI 331 Social Inequalities",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course examines the dynamics of social stratification and differentiation, including economic distinctions and their consequences, social status, power, and mobility. Emphasis is placed upon Canadian society.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 333 Political Sociology",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course is concerned with the nature, organization, distribution, determinants, and consequences of power in social systems.",
    "components": "Lecture",
    "notes": "This course is equivalent to SCPA 333. Students who have received credit for SCPA 333 may not take this course for credit."
  },
  {
    "title": "SOCI 336 Collective Action",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course is concerned with the nature, emergence, and dynamics of short‑term collective action. Classical collective behaviour theories and contemporary interpretations of collective action are examined.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 338 Sociology of Religion",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background",
    "corequisites": "",
    "description": "This course presents an overview of the role of religion in society as found in the pertinent literature of sociology and anthropology. Special consideration is given to the relationship between religion and other social institutions, with particular attention to changes in the religious structures and practices in modern pluralistic societies.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 341 Sociology of the Media",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course provides an introduction to sociological debates on the relevance and impact of mass media in our society. With a focus on North American media, this course takes a historical perspective to explore the rise of the mass media and the transformation of its relation with culture, especially popular culture. Particular attention is given to themes such as media and identity, national identity; media structures and ownership concentration; media texts and audiences.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 342 Sociology of Occupations",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course examines the role played by occupations and the world of work in industrialized societies. Economic, social, psychological, and moral attributes of occupations are examined in relation to changing markets for labour. Specific problem areas to be covered include changes in the structure of professions, the effects of changing technology and organizational design on occupational requirements, issues in work and household demands, issues in employment equity and problems of unemployment.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 343 Media Ethnographies",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Focusing on mass media (radio, television, cinema, print), this course considers how ethnographic approaches to media production and consumption may alter, or sometimes reinforce, dominant understandings of the impact of media. A range of theories of the social and cultural impacts of mass media, as well as ethnographic perspectives on audiences in everyday life are explored.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 343, or for this topic under an ANTH 398 or SOCI 398 number, may not take this course for credit."
  },
  {
    "title": "SOCI 345 Movement and Travel",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Drawing on contemporary interdisciplinary studies of mobility, this course examines the processes, policies, and issues that may be common to different categories of travel and movement as well as those that can distinguish between them.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 345 or for this topic under an ANTH 398 number may not take this course for credit."
  },
  {
    "title": "SOCI 347 Sociology of Labour-Management Relations",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "The course includes analyses of theories of management; the impact of the labour union movement, changes in the nature of the labour market; the significance of the growth of the service sector; the changing role of governments in labour‑related issues; and contemporary thought on new forms of industrial organization.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 349 Youth: Anthropological and Sociological Perspectives",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course brings anthropological and sociological perspectives to bear on the ways in which youths view and interact with each other and the world.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 349, or for this topic under an ANTH 398 or SOCI 398 number, may not take this course for credit."
  },
  {
    "title": "SOCI 352 Population and Environment",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: SOCI 212. 300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Population and environment have become two of the most contested areas for theory, research, policy and public action. The course critically examines the pillars of the population and the environment discourses with attention to differences between developed and developing countries. It provides an overview of the evolution of demands for population control to a common acceptance of a reproductive rights perspective. Similarly, the course focuses on current debates on environment and the management of the global commons from both the industrialized and developing countries’ perspectives.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 352 may not take this course for credit."
  },
  {
    "title": "SOCI 353 Questioning Community",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Community is a term that appears frequently in academic as well as everyday language but it is used to convey a wide variety of meanings. This course provides a critical review of some of the groupings, feelings, claims, ideas as well as types and qualities of relationships that can be associated with community. Can such an ambiguous term still be analytically useful?",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 353 or SCPA 353 may not take this course for credit."
  },
  {
    "title": "SOCI 355 Urban Regions",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course reviews the work of anthropologists and sociologists in cities. The focus is on the social organization of social life in First and Third World urban spaces. Consideration is also given to the particular dynamics of fieldwork in urban settings.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 355 or SCPA 355 may not take this course for credit."
  },
  {
    "title": "SOCI 358 Population Challenges of the 21st Century",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course provides an introduction to the basic principles, data, and methods of population studies through an examination of current issues such as the aging of the population; the sex imbalance in some countries; immigration and globalization; the future of the world population; cohabitation and the growing diversity of families. Social factors and the consequences for our societies of these demographic challenges are discussed.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 362 Introduction to Criminology",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course is an introduction to criminology — the sociological study of crime. Through the course, students gain an understanding of criminality as a social phenomenon, including the role of criminal law in Canada; the social correlates of crime; underlying social processes involved in defining criminality; different approaches to the study of crime; and defining the concept of “crime” itself.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 363 Law and Society",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course situates the study of law in a historical, philosophical, and cross‑cultural perspective. It explores numerous issues of relevance to the legitimacy of contemporary Western legal systems, such as the relationship between law and morality, the idea of right prior to good, and the nature of legal reasoning. It may also involve an examination of the kinds of institutions found in place of courts in non‑Western societies.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 363 may not take this course for credit."
  },
  {
    "title": "SOCI 366 The History and Sociology of Genocide to 1945",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Through the comparative and historical examination of a number of cases, this course investigates the meaning of genocide and the processes that have led to genocide up to 1945.",
    "components": "Lecture",
    "notes": "This course is equivalent to HIST 359. Students who have received credit for HIST 359 may not take this course for credit."
  },
  {
    "title": "SOCI 367 The History and Sociology of Genocide from 1945 to the Present",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Through the comparative and historical examination of a number of cases, this course investigates the meaning of genocide and the processes that led to genocide from 1945 to the present.",
    "components": "Lecture",
    "notes": "This course is equivalent to HIST 360. Students who have received credit for HIST 360 may not take this course for credit."
  },
  {
    "title": "SOCI 375 Social Construction of Sexualities",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course provides a cross‑cultural, interdisciplinary approach to the study of human sexuality. There are three major components. One explores the validity of contemporary sexual beliefs and attitudes. Another focuses on the extent to which sexual beliefs and behaviours are socially organized. A third provides an introduction to theories which examine how biological and/or social forces shape our sexual lives.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 375 may not take this course for credit."
  },
  {
    "title": "SOCI 376 Socialization",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course examines the social and cultural processes by which the individual becomes a functioning member of society. Attention is given to adult socialization and re‑socialization in diverse institutional contexts such as schools, occupations, hospitals, prisons, the military. The relationship of social structure to role acquisition and role performance is a major focus of the course.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 378 The Family",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course examines the family as an institution in relation to its evolution from kinship societies up to the present. The course first introduces elementary structures of kinship and examines the family institution in the context of traditional societies. Special attention is devoted to the development of the modern family and to its current transformation.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 378 may not take this course for credit."
  },
  {
    "title": "SOCI 380 Contemporary Issues in Human Rights",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "The course develops, through case analysis, insight into the differing priorities and competing concepts of human rights and human dignity in “non‑Western” cultural traditions as well as in “Western” societies. It explores the significance of religious and other ideological positions in the use and abuse of human rights by governments, extra‑governments, international bodies, as well as the general public. The course also examines topics such as women’s human rights, sexuality and human rights, and human rights in development, the limits of sovereignty, and state accountability.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 380 may not take this course for credit."
  },
  {
    "title": "SOCI 381 Ethnic Communities in Canada",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course aims at familiarizing students with the social factors and dynamics of contemporary ethno‑cultural communities in Canada. Topics may include the immigration process and settlement; community development, structures, and organizations; the ethnic family; socio‑economic status and achievement; cultural continuity and change; minority‑majority relations and relations with other ethno‑cultural communities.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 381 may not take this course for credit."
  },
  {
    "title": "SOCI 383 Consumer Society",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course considers the historical emergence of consumerism in advanced industrial economies and continues to examine the developing characteristics of consumer societies in the present. Topics include the role of consumer goods in mediating social status and personal or collective identities, the relationship of consumerism to present ecological concerns, and the role of advertising and promotional discourse in the creation of new habits and expectations in everyday life.Notes:Students who have received credit for this topic under a SOCI 398 number may not take this course for credit.",
    "components": null,
    "notes": "Students who have received credit for this topic under a SOCI 398 number may not take this course for credit."
  },
  {
    "title": "SOCI 384 Food and Sustainability",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "This course critically examines the existing food system by asking whether it is economically, socially and ecologically sustainable. It explores the politics of food by introducing students to existing and emerging social movements whose goal is to build a more sustainable food system.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 384, or for this topic under an ANTH 398 or SOCI 398 number, may not take this course for credit."
  },
  {
    "title": "SOCI 398 Selected Topics in Sociology",
    "credits": 3,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and the Departmental Handbook.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 399 Selected Topics in Sociology",
    "credits": 6,
    "prerequisites": "300‑level courses are open to students who have successfully completed SOCI 203 or equivalent, plus at least three credits of 200‑level Sociology courses. Students in related disciplines who wish to take cognate courses in Sociology may apply to the Sociology undergraduate advisor for a prerequisite waiver on the basis of equivalent background.",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and the Departmental Handbook.",
    "components": "Lecture; Tutorial",
    "notes": null
  },
  {
    "title": "SOCI 402 Contemporary Sociological Theory",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: SOCI 300. 400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course examines contemporary sociological theory. It focuses on how sociologists synthesize concepts from different sociological schools and disciplines (interactionism, phenomenology, functionalism, conflict theory, critical theory, political and moral philosophy) into general theories that seek to explain how social action, structure, the self, symbolic order, communication, technology, and social division are produced and reproduced in modern and postmodern societies.",
    "components": "Lecture",
    "notes": "This course is equivalent to SOCI 408. Students who have received credit for SOCI 408 may not take this course for credit."
  },
  {
    "title": "SOCI 403 Contemporary Cultural Theory",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: SOCI 300. 400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course examines a variety of approaches and area studies (poststructuralism, deconstruction, postcolonialist and cultural studies). It looks at how they shift contemporary sociological theory toward a focus on relations between discourse, knowledge, and power, and toward a critical reflection on cultural systems and institutions. The emphasis is on theories that seek to explain and understand the emergence of cultural politics in modern and postmodern societies.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 404 Sociology of Literature",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course examines literature as a social practice and cultural artifact that is embedded in and shapes the emotional orientations, beliefs, behaviours, power relations, and material reality of readers. Issues may include the active role of readers in the production of texts’ meanings and emotional effects, the social forces involved in the appeal or condemnation of popular genres and in the banning or canonization of specific works, the development of literary fiction as a field, and the rise of the novel as a modern literary form.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 405 Cultural Imperialism",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course offers a critical investigation of theoretical work of cultural imperialism and is useful for exploring some prominent cultural and media theories in both sociology and anthropology. The course focuses particularly on the intersections of culture, media, and international relations. Students examine the role of propaganda in foreign policy; ownership and control over media production and distribution; questions of assimilation, acculturation, and resistance; theories of technological determinism and the critiques they have provoked; and cargo cults. A broad range of case studies dealing with the arts, news reporting, consumption, and knowledge production in academia is also considered.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 405, or for this topic under an ANTH 398 or SOCI 398 number, may not take this course for credit."
  },
  {
    "title": "SOCI 406 Sociology of Knowledge",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course examines a variety of theories of the relation of knowledge and belief to social contexts.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 409 Honours Seminar",
    "credits": 6,
    "prerequisites": "The following course must be completed previously or concurrently: SOCI 410 or SOCI 415. Permission of the honours advisor is required. 400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course involves the student formulating an honours research proposal, and the research and writing of an honours paper.",
    "components": "Seminar",
    "notes": null
  },
  {
    "title": "SOCI 410 Research Design and Analysis",
    "credits": 6,
    "prerequisites": "The following course must be completed previously: SOCI 310. 400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course looks at quantitative methods of data collection and analysis. Topics include experimental and quasi‑experimental design, principles of measurement, survey design, secondary data sources, techniques of multivariate analysis, and interpretation.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 415 Field Research",
    "credits": 6,
    "prerequisites": "The following course must be completed previously: SOCI 310. 400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course provides the opportunity for advanced qualitative research methods. Students are taught systematic procedures for the collection of primary data using methods that include participant‑observation and formal and informal interviewing, survey research, and library research.",
    "components": "Lecture",
    "notes": "This course is equivalent to SOCI 313, 314, 315 and ANTH 315. Students who have received credit for SOCI 313, 314, 315 or ANTH 315 may not take this course for credit."
  },
  {
    "title": "SOCI 421 Sociology of Emotions",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course explores the dynamic relationship between social and emotional life. Emotional experience is understood to emerge through interaction, to orient social action, and to form the basis of social order and social change. Topics may include forms of suffering and well‑being, health and illness, personal appearance, social movements, self‑help, consumption, identity, popular culture, and campaigns of fear and desire.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a SOCI 498 number may not take this course for credit."
  },
  {
    "title": "SOCI 424 Applied Social Statistics",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: SOCI 213 and SOCI 310. 400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course explores statistical tools and techniques commonly used in sociological research, and provides an opportunity to work with large databases. The sessions are designed in an applied manner with weekly hands‑on applications and/or case studies using the Statistical Package for the Social Sciences (SPSS) program.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a SOCI 498 number may not take this course for credit."
  },
  {
    "title": "SOCI 428 Capitalism and Crisis",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course offers an advanced study of the contemporary dimensions of capitalist society from an approach known as political economy, emphasizing the interconnectedness of those areas of social life that are conventionally differentiated as the economy, politics and culture. The course focuses on the dynamics of crisis — the breakdown of socio‑economic systems — and investigates crisis, in its various expressions, as a built‑in dynamic of capitalist societies.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a SOCI 498 number may not take this course for credit."
  },
  {
    "title": "SOCI 429 The Thought of Karl Marx",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "In this course, students undertake a study of Karl Marx’s critical theory of society through a sustained engagement with his most comprehensive work, Capital, and other texts. The course allows students to discover the continuing relevance of his thought in illuminating the deep structure and movement of contemporary capitalist society.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 429, or for this topic under an ANTH 498 or SOCI 498 number, may not take this course for credit."
  },
  {
    "title": "SOCI 430 Development Debates",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course considers the systematic reduction of poverty and powerlessness at individual and societal levels. Several development problems are examined, including national debt crisis, population growth, urbanization, and various degrees of state withdrawal from regulating the market. Special emphasis is given to case studies from major regions of the Third World on the varied impact of development on gender relations and on the eradication of social and economic inequalities.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 430 may not take this course for credit."
  },
  {
    "title": "SOCI 433 Theories of Identity",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course discusses theories of difference, pluralism, exclusion, nationalism, and racism within broader frameworks such as citizenship, multiculturalism, diaspora or transnationalism. This course will therefore review related theories of identity as these are currently addressed within anthropology/sociology and related disciplines.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 433 may not take this course for credit."
  },
  {
    "title": "SOCI 434 Sociology of Suicide",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course reviews the important body of literature on suicide since Durkheim’s foundational study, with a particular focus on the sociological writings.The course also provides an overview of the key features of contemporary suicide in Canada, including the emergence of youth suicide and suicide among First Peoples.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a SOCI 498 number may not take this course for credit."
  },
  {
    "title": "SOCI 437 Social Movements",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "The nature, emergence, and dynamics of organized collective behaviour and social movements are examined in light of classical and contemporary theories. The course focuses on the impact of leadership, organizational resources, and discontent with institutionalized social relations on social movements. Contemporary social movements in Quebec, the rest of Canada, and the U.S. serve as illustrations.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 441 Material Culture",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "The focus of this course is the study of material objects and technologies and their role in the production of everyday social life and culture.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 441 may not take this course for credit."
  },
  {
    "title": "SOCI 445 Sociology of Labour Movements",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course analyzes the origins and development of labour movements as well as contemporary characteristics of union organizations within the context of their social, political, and economic environments. Emphasis is placed on Canada and Quebec.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 449 The Culture of Touch",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course examines social practices involving touch, a basic medium for human interaction. Topics may include gender differences in the use of touch, how children are handled across cultures, the medical applications of touch in diverse traditions, the tactile dimensions of urban design, and humans’ contact with and impact on the natural world.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 449, or for this topic under an ANTH 498 or SOCI 498 number, may not take this course for credit."
  },
  {
    "title": "SOCI 450 Social Economy and Sustainable Futures",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course introduces a number of emerging alternative models of social economy that envision sustainable global futures in contrast to the current model of neoliberal globalization.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 450, or for this topic under an ANTH 498 or SOCI 498 number, may not take this course for credit."
  },
  {
    "title": "SOCI 451 Citizenship, Eros and the City",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course invites students to explore the relation between classic and contemporary texts in the field of social and political thought. The three interrelated areas of study include Citizenship, Eros and the City. The course explores diverse theories of democracy, community, love, and civil society. The integrating theme for these three areas is public and private relationships in the city.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 453 Media Sociology and Journalism",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course invites students to participate in developing a media sociology that situates journalism in broad social‑historical contexts. In addition to an introduction to media sociologies, the course explores current changes in journalism practices and the impact of digital culture on information, news and public life.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a SOCI 498 number may not take this course for credit."
  },
  {
    "title": "SOCI 460 Sociology of Fear and Risk",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course explores the subjective, moral, cultural, and embodied dimensions of the individual experience and social production of fear. It considers the role of fear in processes of social ordering and change, emotional socialization, and emotion management. Risk is examined as a dominant form of fear structured by the contemporary relationship to danger and security in Western societies.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 462 The New Imperialism",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This research seminar brings into focus the anthropology and sociology of contemporary empire‑building. Topics may include nation‑building, global and domestic counterinsurgency, “humanitarian intervention,” the ideologies of militarism, the militarization of the social sciences and the broader society, the national security state, soft power, the media and information operations, hegemony and capital accumulation.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 462, or for this topic under an ANTH 498 or SOCI 498 number, may not take this course for credit."
  },
  {
    "title": "SOCI 464 Advanced Studies in Law and Society",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "Law and society studies is an interdisciplinary field that seeks to understand the meaning of law and its role/effects in society. It draws variously on legal scholarship, sociological and anthropological theory, as well as empirical research in the social sciences. This course covers material from each of these domains, with a focus on issues such as the use of violence, the management of diversity, and the use of law as a tool for social change.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 464, or for this topic under an ANTH 498 or SOCI 498 number, may not take this course for credit."
  },
  {
    "title": "SOCI 474 The Body Social",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course examines the social roles of the body. Topics include body image and self‑esteem, the symbolism of beauty and ugliness, height, hair, dress, the face, body language, health and fitness, eating and drinking patterns. The subject is considered in anthropological and sociological perspectives.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 474 may not take this course for credit."
  },
  {
    "title": "SOCI 475 Men and Masculinities",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course is a review of the various and changing roles of men, the meanings of masculinity across cultures and the emerging men’s movements. In a dialogue with feminism, the course moves towards humanism.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH. Students who have received credit for ANTH 475 may not take this course for credit."
  },
  {
    "title": "SOCI 476 Contemporary Feminist Thought",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course examines contemporary feminist theories and the role of the feminist theorist in society. Focusing in particular on debates and perspectives since the latter part of the 20th century, the course addresses issues such as gender, equality, difference, identity, intersectionality, and power.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 478 Motherhood and Childlessness",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "This course focuses on motherhood, childlessness, and the reproductive decision-making process both critically and sociologically with a view to understanding what these phenomena can tell us about social relations generally. Topics may include involuntary and voluntary childlessness/child freedom, motherhood and mothering, single, queer, racialized and other motherhoods, intensive mothering, maternal ambivalence, maternal desire and regret, and mothers who leave.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a SOCI 498 number may not take this course for credit."
  },
  {
    "title": "SOCI 483 Nationalism and Racism",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "Nationalism and racism are modern social phenomena. Description: This course investigates the social conditions for their emergence and their political implications. Attention is given to case studies exemplifying these sociological developments.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 483, or for this topic under an ANTH 498 or SOCI 498 number, may not take this course for credit."
  },
  {
    "title": "SOCI 484 Surveillance Studies",
    "credits": 3,
    "prerequisites": "400‑level courses are open to students who have successfully completed at least six credits from 300‑level SOCI courses.",
    "corequisites": "",
    "description": "This course considers many facets of surveillance in daily life. Emphasizing sociological and anthropological approaches, topics may include communications surveillance, surveillance in schools and the workplace, surveillance in medical care and public health settings, surveillance in the city, and surveillance futures.",
    "components": "Lecture",
    "notes": "Entry requirements for Sociology/Anthropology crosslisted courses depend on the discipline through which the course was entered. A crosslisted SOCI/ANTH course counts as either SOCI or ANTH as needed to satisfy the program requirements regardless of whether the student registered for the course as SOCI or ANTH.Students who have received credit for ANTH 484 or for this topic under a SOCI 498 number may not take this course for credit."
  },
  {
    "title": "SOCI 498 Advanced Topics in Sociology",
    "credits": 3,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and the Departmental Handbook.",
    "components": "Lecture",
    "notes": null
  },
  {
    "title": "SOCI 499 Advanced Topics in Sociology",
    "credits": 6,
    "prerequisites": "400-level courses are open to students who have successfully completed at least six credits from 300-level SOCI courses.",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and the Departmental Handbook.",
    "components": "Lecture",
    "notes": null
  }
]
