[
    {
        "title": "EDUC 200 English Exam for Teacher Certification",
        "credits": 0,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization, the Teaching English as a Second Language Specialization, the Art Education Major, or the Art Education Specialization is required.",
        "corequisites": "",
        "description": "The regulation respecting teaching licences requires that all students admitted to a teacher education program demonstrate their proficiency in the language of instruction as a condition for certification. To fulfill this requirement, students are required to register and write the exam approved by the MEQ. Students must pass this exam prior to the start of the following internships: EDUC 493, TESL 486 or TESL 487, and ARTE 423.Notes:This course is marked on a pass/fail basis.",
        "components": null,
        "notes": "This course is marked on a pass/fail basis."
    },
    {
        "title": "EDUC 210 Psychology of Education",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces students to a broad range of content in educational psychology, including its scope and methods, learning motivation, growth and development, adjustment, individual differences, guidance, and concept of self.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 211 Child Development I",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization, or the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course provides an introduction to current theory (e.g. cognitive, social-cognitive, social learning) about children’s development and covers various domains of development (social, emotional, cognitive, physical) from conception to age 12. The implications of children’s development in relation to various contexts (e.g. family, neighbourhood, peers, education) are discussed.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 222 Exploring Movement with Children",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required.",
        "corequisites": "",
        "description": "From a multidisciplinary perspective, this course examines the following topics: the relationship between movement and self-knowledge, psychomotor development, and the role of physical activity in primary education. The course addresses the teacher’s role in incorporating movement into the curriculum for all children, including those with special needs through the use of specific techniques and activities.",
        "components": "Lecture",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 230 Introduction to Philosophy of Education",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces the student to the content and form of several major educational theories, and to conceptual and logical procedures of philosophizing about education, with particular reference to teaching and learning.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 240 Introduction to Training and Development",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course provides an overview of the design and development of training in organizations by introducing students to theoretical and practical concepts. Topics explored include the organizational and personal benefits of training, different modes of delivery including e-learning (an instructional systems design approach to training development), the transfer of learned skills to the workplace environment, the evaluation of training, the management of the development process, and trends and successful practices in the field.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an EDUC 298 number may not take this course for credit."
    },
    {
        "title": "EDUC 260 Historical and Current Curriculum Models for Early Childhood and Elementary Education",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization, or the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course provides an introduction to the historical and current curriculum models for early childhood and elementary education. The historical and philosophical roots of modern constructivist approaches to curriculum are discussed with an emphasis on how 20th‑century thinkers have influenced contemporary curriculum models. Recent Canadian approaches to curriculum development and provincial curriculum frameworks also are discussed.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 264 Communication: Child, Parent and Teacher",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course focuses on the role parents play in the various stages of the child’s academic, social, and emotional development. The format for this course is unique in that parents of the children in the observation nursery are involved, and students interact with them by conducting and participating in parent-teacher seminars. Topics include parenting, the impact of the family on the child’s classroom behaviour, child abuse, cultural issues, disciplinary measures at home and in school, the coordination of home-and-school academic goals, and achievement motivation.",
        "components": "Seminar; Laboratory",
        "notes": null
    },
    {
        "title": "EDUC 270 Educational Communication",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "In this course, students study fundamental communication skills used by effective instructors. By examining how to write the most basic types of instructional content, including definitions, objectives, descriptions and procedures, and the most common forms of written instructional content, including how-to articles and lesson plans, this practical, writing-intensive course emphasizes effective instructional communication methodologies.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an EDUC 298 number may not take this course for credit."
    },
    {
        "title": "EDUC 294 Prekindergarten Internship and Seminar",
        "credits": 6,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must be in their first year of the ECEE program in order to enrol.",
        "corequisites": "",
        "description": "In this course, students are placed in a prekindergarten class one day a week for a total of 60 hours. The internship gives students first-hand knowledge of the importance of early education. It permits students to develop preliminary skills in observing, assessing, and meeting the needs of individual children, articulating educational objectives, working effectively with small groups, and planning and implementing a play-based curriculum. The seminar complements the internship by offering a thorough introduction to theoretical and applied aspects of early childhood education through lectures, discussions, and video presentations on such topics as the educational and developmental needs of young children, models of early childhood education, the role of the teacher, play-based curriculum and instruction, health and safety issues, and the design of appropriate prekindergarten learning environments.",
        "components": "Lecture; Practicum/Internship/Work Term",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “B” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat this course only once, the next time the course is given, in order to achieve the required grade.Students who have received credit for EDUC 295 and EDUC 296 may not take this course for credit unless required by the Department."
    },
    {
        "title": "EDUC 297 Internship II: Observation and Evaluation in Education",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 294. Enrolment in the Early Childhood and Elementary Education Specialization is required.",
        "corequisites": "",
        "description": "The purpose of this course is to teach students how to conduct evaluations at the elementary-school level. Students learn observation techniques, documentation procedures, authentic assessment, and formative and summative evaluation. Students learn how to create a dynamic profile of the child and how to prepare reports for parents, administrators, and specialists. Students conduct observations in recognized educational institutions (40 hours).",
        "components": "Seminar; Practicum/Internship/Work Term",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “B” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade.Students who have received credit for EDUC 371, EDUC 373, and EDUC 375 may not take this course for credit."
    },
    {
        "title": "EDUC 298 Selected Topics in Education",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "EDUC 299 Selected Topics in Education",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "EDUC 301 Integrating Computers into the Elementary Classroom",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization, the Art Education Major or the Art Education Specialization is required.",
        "corequisites": "",
        "description": "This course provides an introduction to theoretical and practical knowledge regarding the use of computers in elementary school classrooms. Assignments are designed to provide students with hands-on experience with the computer. Topics include social interaction and equity, problem-solving skills, software evaluation, interactive technologies, and curriculum planning.",
        "components": "Lecture",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 302 Working in Childhood Settings: Leadership and Organizational Issues",
        "credits": 3,
        "prerequisites": "Enrolment in the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course provides students with an introduction to leadership in childhood settings, with a focus on child care. Issues reviewed include the organizational framework, quality of curriculum, human resources, leadership styles, financial and administrative matters, environments, and community relationships.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 303 Children, Families, and Social Policy",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: EDUC 210; EDUC 211. Enrolment in the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course examines social policy as it relates to children and families in Canada. Policies may include such areas as children’s rights, child care, education, health, and social welfare.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 304 Play in Childhood Settings",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: EDUC 210; EDUC 211. Enrolment in the Early Childhood and Elementary Education Specialization, or the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course introduces students to (1) developmental theories of children’s play, and (2) practical ways that play can be facilitated in early childhood settings. Emphasis is placed on understanding: types of play (e.g. pretend, physical, solitary, social, rough and tumble); play-based curriculum and the role of the educator; toys, materials, and environments that promote high-quality play; cultural diversity and play; and play in inclusive environments.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 305 Technology for Educational Change",
        "credits": 3,
        "prerequisites": "Enrolment in an Education program is required.",
        "corequisites": "",
        "description": "This course provides an introduction to advances in the theory, research, and practice of educational technology. Projects and activities allow for a diversity of interests.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 307 Integrating Digital Technologies and Social Media in Learning Environments",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces students to the social and cognitive theories of digital technologies in learning and training environments. These technologies include hardware such as interactive tablets and screens, mobile devices, and software such as online multimedia, video, serious games and social media. This course discusses these technologies using problem-based learning approaches. Students also engage in practical project-based activities.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 311 Child Development II: Ecology of the Family",
        "credits": 3,
        "prerequisites": "The following course must be completed concurrently or previously: EDUC 210. The following course must be completed previously: EDUC 211. Enrolment in the Early Childhood and Elementary Education Specialization, or the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course is designed to provide students with an in-depth review of the developmental, psychological, and socio-cultural aspects of the child and the family. Emphasis is placed on structural elements related to the modern family (e.g. family size, developmental tasks), family relations (e.g. transition to parenthood, parenting styles, early relationships) and issues related to contemporary families.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 315 Sexual Health Education for Children and Youths",
        "credits": 3,
        "prerequisites": "Enrolment in the Specialization in Early Childhood and Elementary Education, the Specialization in Teaching English as a Second Language, the Major in Child Studies, or the Minor in Interdisciplinary Studies in Sexuality is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "By evaluating research-informed best practices, this course familiarizes students with approaches to comprehensive sexual health education that are desirable for working with children and youth in a variety of educational settings, including the home, community agencies, and schools. Students critically engage with research-informed strategies, curricula, resources, pedagogies, and approaches to support comprehensive sex education inside and outside of school contexts. The importance of accounting for developmental considerations, learning needs, and local social contexts is stressed.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 321 Gender Socialization in Education",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses upon the role of gender in different levels of education. Factors such as culture, policy, and language are discussed. The mechanisms by which gender roles are maintained and challenged in educational institutions are also examined through the relevant theories.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 356 Teaching Culture and Citizenship in Quebec",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course enables students to develop a stimulating and sensitive Culture and Citizenship in Quebec program that promotes children’s ability to explore, examine, and reflect critically on cultural realities via dialogue with others. Relevant resource materials are examined and assignments focus upon development of activities for the elementary-level classroom.",
        "components": "Lecture",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat this course only once, the next time the course is given, in order to achieve the required grade.Students who have received credit for EDUC 355 may not take this course for credit."
    },
    {
        "title": "EDUC 359 Understanding and Supporting Children with Challenging Behaviours",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: EDUC 210 and EDUC 211. Enrolment in the Major in Child Studies is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course explores evidence-based approaches for working with children with challenging behaviours, with an emphasis on child-centered approaches. Topics may include the cognitive, affective, and motivational processes that underlie children’s challenging behaviours, and inclusive practices that support children’s engagement in meaningful learning experiences and positive relationships. The course also addresses intervention approaches and resources for teachers, families and communities, aimed at promoting children's resilience, self-regulation and positive classroom experiences.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 360 Introduction to Inclusive Practices",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 210. Enrolment in the Major in Child Studies or the Minor in Education is required.",
        "corequisites": "",
        "description": "This course is an introduction to inclusive practices for children with special needs in childhood settings. Topics include the evolution of special education; laws and policies; current models of service delivery; identification and assessment of learning needs; advocacy; and collaboration with families.",
        "components": "Lecture",
        "notes": "Students who have received credit for EDUC 450 may not take this course for credit."
    },
    {
        "title": "EDUC 361 Inclusive Practices in Early Childhood Settings",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 360. Enrolment in the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course focuses on the implementation of inclusive practices in early childhood settings. Topics include differentiating and adapting curriculum; meeting the needs of individual children; collaborating with families and professionals; implementing developmentally appropriate practices; and facilitating development in various domains (social-emotional, cognitive, behavioural and communication).",
        "components": "Lecture",
        "notes": "Students who have received credit for EDUC 490 may not take this course for credit."
    },
    {
        "title": "EDUC 362 Inclusive Practices for School-Aged Populations",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 360. Enrolment in the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course focuses on the implementation of inclusive practices in school-aged populations, (K – 11 settings). Topics include differentiating and adapting curriculum; meeting the needs of individual students; collaborating with families, teachers, and other professionals; implementing evidence-based strategies to promote literacy and academic achievement; and facilitating social-emotional, cognitive, and behavioural competencies.",
        "components": "Lecture",
        "notes": "Students who have received credit for EDUC 491 may not take this course for credit."
    },
    {
        "title": "EDUC 380 Teaching Language Arts I",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course enables students to acquire the necessary skills for developing a stimulating and appropriate language arts program for kindergarten and primary grades. Current theories of literacy development and implications for planning and instruction are addressed. The course focuses on listening, speaking, reading, and writing, emphasizing the integration of language arts activities into other subject areas.",
        "components": "Lecture",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 381 Teaching Language Arts II",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 380. Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course is a continuation of EDUC 380 with special emphasis on teaching language arts in Grades 3 to 6. Students become familiar with Quebec Education Program (QEP) guidelines, and various ways to organize and evaluate their implementation.",
        "components": "Lecture; Tutorial",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 382 Teaching Science Concepts in the Elementary Classroom",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course examines areas of science which are relevant to elementary education and emphasizes the development of the spirit of scientific inquiry. Resource materials, teaching methodology, and classroom activities are examined and evaluated in light of the MEQ guidelines. Assignments emphasize developing activities for classroom use.",
        "components": "Lecture",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 384 Teaching Social Studies in Elementary Schools",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course examines the teaching of social studies to elementary-school-age children.",
        "components": "Lecture",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 385 Teaching a Second Language in Early Childhood and Elementary School",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course is designed to give teachers a background in current theories of language acquisition and second language learning. Teaching methodologies such as immersion, enrichment, and core/complementary curricula are studied and resource materials are examined and evaluated. Assignments include the development of appropriate classroom activities at the elementary level.",
        "components": "Lecture",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 386 Teaching Mathematics I",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 12 University credits prior to enrolling.",
        "corequisites": "",
        "description": "This course introduces a conceptual analysis of school mathematics and its application to the early childhood and elementary education classrooms. Topics include numeracy acquisition, counting, whole number operations, and problem solving. Emphasis is placed on the development of children’s thinking and pedagogical practices aimed at assisting students to think mathematically. Current mathematics curricula are examined and evaluated in this context.",
        "components": "Lecture; Tutorial",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 387 Teaching Mathematics II",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 386. Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course continues a conceptual analysis of school mathematics and its application to the elementary classroom. Topics include fractions, decimals, proportions, per cents, algebraic reasoning, and geometry. Emphasis is placed on the development of children’s thinking and pedagogical practices aimed at assisting students to think mathematically. Current mathematics curricula are examined and evaluated in this context.",
        "components": "Lecture; Tutorial",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 388 Teaching Mathematics III",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 387. Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course continues a conceptual analysis of school mathematics and its application to the elementary classroom. Topics include algebra, geometry, probability, statistics, and data analysis. Emphasis is placed on the development of children’s thinking and pedagogical practices aimed at assisting students to think mathematically. Current mathematics curricula are examined and evaluated in this context.",
        "components": "Lecture; Tutorial",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “C+” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade."
    },
    {
        "title": "EDUC 395 Internship III: Kindergarten Teaching",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: EDUC 294; EDUC 297. The following course must be completed concurrently: EDUC 396. Enrolment in Early Childhood and Elementary Education Specialization is required. Students must have completed 60 credits prior to enrolling.",
        "corequisites": "",
        "description": "This internship is a seven-week (245 hours) supervised student-teaching experience in a full-day kindergarten classroom. Students share in the daily work of their co-operating teachers, and progress gradually from being participant observers working with small groups to taking charge of the whole class. Students practise their skills in activity planning, intervention strategies, the evaluation of student learning, and the management of classroom routines.",
        "components": "Practicum/Internship/Work Term",
        "notes": "This course is graded on a pass/fail basis. To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve a \"pass\" grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat this course only once, the next time the course is given, in order to achieve the required grade. Students who obtain a “fail” grade in EDUC 395 or a grade below the minimum “B” in EDUC 396 must repeat both courses concurrently, even if the student achieves the minimum grade in one of the two courses."
    },
    {
        "title": "EDUC 396 Kindergarten Teaching Seminar",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: EDUC 294, EDUC 297. The following course must be completed concurrently: EDUC 395. Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 60 credits prior to enrolling.",
        "corequisites": "",
        "description": "This seminar complements EDUC 395 by providing the opportunity, means, and impetus for students to reflect critically on their teaching philosophy and practice. Topics include the development of appropriate and stimulating learning environments, kindergarten program guidelines established by the MEQ, planning and implementation of learning centres, teaching centres, teaching the “whole” child, teacher-parent relationships, and other current issues in kindergarten education.",
        "components": "Seminar",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “B” grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade. Students who obtain a “fail” grade in EDUC 395 or a grade below the minimum “B” in EDUC 396 must repeat both courses concurrently, even if the student achieves the minimum grade in one of the two courses."
    },
    {
        "title": "EDUC 398 Selected Topics in Education",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "EDUC 399 Selected Topics in Education",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "EDUC 400 Teaching Across the Curriculum",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 30 University credits prior to enrolling.",
        "corequisites": "",
        "description": "Using language arts and the social sciences as the starting point, this course outlines different models for integrating school subjects in curriculum programming. Special attention is given to social science methodology, thematic planning and project work, and to the use of literature and drama. Students examine the links between the different programs of study developed for Quebec schools and their overall implications for curriculum planning.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 402 Diversity Issues in Childhood",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: EDUC 210 and EDUC 211. Enrolment in the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course explores the diversity of contemporary Canadian childhood, including issues related to immigration, language, culture, and socioeconomic status. The course reviews theoretical approaches to diversity and examines how these shape practice with children and families in education and other fields.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 405 Children and Technology",
        "credits": 3,
        "prerequisites": "Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course examines the interaction between children and technology from a socio-cultural perspective, including the effects of media such as television, computers, and the Internet. Emphasis is placed on the developing child in the context of communication and technology as related to informal educational activities and play.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 406 Physical Activity: Health and Well-being in Early Childhood Settings",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: EDUC 210; EDUC 211. Enrolment in the Early Childhood and Elementary Education Specialization, or the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course examines the basic principles and practices of health, safety, physical activity, and nutrition that promote the wellness of young children in early childhood environments. Topics include health promotion; illness and prevention; physical activity; nutrition; safety promotion; preventing child maltreatment; and stress in the lives of young children. Students examine legislative requirements of group care, which are necessary to plan safe, inclusive and developmentally appropriate environments.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 411 Toys, Media Literacy and Children’s Popular Culture",
        "credits": 3,
        "prerequisites": "Enrolment in an Education program is required.",
        "corequisites": "",
        "description": "This interdisciplinary course examines the multiple roles that toys and the popular culture of childhood and adolescence can play in relation to development, learning, socialization and identity processes. Topics addressed include cultural and personal meanings constructed around toys, media literacy, the increasing role of new technologies, and issues related to the branding and marketing of toys through the media.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an EDUC 498 number may not take this course for credit."
    },
    {
        "title": "EDUC 422 Sociology of Education I",
        "credits": 3,
        "prerequisites": "Students must have completed 12 University credits prior to enrolling.",
        "corequisites": "",
        "description": "This course emphasizes sociological concepts and their theoretical and practical applications to the study of education. The focus is on the following: how the education system is structured, how schooling and education fit into the overall social structure, how educational experiences vary for members of different social groups, the role education plays in gender, class, and racial inequalities, the complexity of issues relating to student evaluation and performance, and the role education plays in social change.",
        "components": "Lecture",
        "notes": "Students who have received credit for EDUC 421 may not take this course for credit."
    },
    {
        "title": "EDUC 423 Sociology of Education II",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 422.",
        "corequisites": "",
        "description": "This course considers how a particular sociological viewpoint contributes to our understanding of school life. Topics include family, socialization patterns, teacher and pupil perspectives, and how these are interrelated.",
        "components": "Lecture",
        "notes": "Students who have received credit for EDUC 421 may not take this course for credit."
    },
    {
        "title": "EDUC 426 Comparative Education I",
        "credits": 3,
        "prerequisites": "Students must have completed six credits in Education prior to enrolling.",
        "corequisites": "",
        "description": "This course undertakes the study of the impact of political and cultural differences upon educational systems (for example, the impact of language differences, nationalism, colonialism, neocolonialism, political socialization). The approach is comparative, with particular emphasis on contrasting educational systems and practice in selected countries.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 427 Comparative Education II",
        "credits": 3,
        "prerequisites": "Students must have completed six credits in Education prior to enrolling.",
        "corequisites": "",
        "description": "This course examines the sources and impacts of educational change from a comparative perspective. Topics include pedagogical alternatives; socio-political alternatives; educational implications of technological change and economic policy; policies of elitism and egalitarianism. Methods include comparative case study and analysis of specific theories of educational innovation.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 432 Seminar in Epistemology and Education",
        "credits": 3,
        "prerequisites": "Students must have completed six credits in Education prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Theories of knowledge are considered in this course, with special attention being given to the bearing of such topics as perception, evidence, truth, knowledge, and belief as relating to educational thought and practice. Students are expected to become familiar with recent periodical and other literature in the field.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 434 Aesthetics and Education",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 230. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "The nature of aesthetic value and experience, and theories of art and beauty are examined. The development of the emotions and imagination, and their functions in aesthetic awareness are central concerns of this course. Students are expected to become familiar with the relevant literature in the field.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 445 Education in Quebec",
        "credits": 3,
        "prerequisites": "Students must have completed 30 credits in a teacher certification program prior to enrolling or must hold a provisional teaching authorization. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course covers the history, the contemporary movements, and the structures of Quebec education. The historical section covers the period from 1608 until the present. Topics included are the legislation, regulations, rules, and directives pertaining to the respective roles of the MEQ, the school boards, the teachers, the parents, and the students in Quebec’s educational system.",
        "components": "Lecture",
        "notes": "Because this is a required course for all individuals enrolled in a Quebec program of teacher training, the content is controlled by the MEQ."
    },
    {
        "title": "EDUC 450 The Inclusive Classroom: Educating Exceptional Children",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 210 or EDUC 211. Enrolment in a teacher training program (ECEE, TESL, Art Education) is required. Students must have competed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "This course focuses on the education of children with special needs. Emphasis is placed on ways in which classroom teachers can provide appropriate help or instruction to meet the needs of exceptional children. Topics include identification and assessment of learning needs; adaptation of curriculum and activity design, service delivery models; parent-professional relationships; legislative policies.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 454 Diversity in the Classroom",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: EDUC 210 or EDUC 211. Students must have completed 30 credits prior to enrolling.",
        "corequisites": "",
        "description": "Students examine the implications of diversity in the classroom for teaching, curriculum, and children’s educational experience. Various theoretical approaches are analyzed, including critical pedagogy, multicultural education, and intercultural education. The importance of inclusive curricula is discussed.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 464 Research Methods in Child Studies",
        "credits": 3,
        "prerequisites": "The following courses must be completed previously: EDUC 210 and EDUC 211. Students must have competed 30 credits in the Early Childhood and Elementary Education Specialization, or the Major in Child Studies prior to enrolling.",
        "corequisites": "",
        "description": "This course introduces students to research approaches in child studies and education. Students learn how research studies are conceptualized and conducted, the similarities and differences between quantitative, qualitative and mixed-methods research designs, how data are analyzed and interpreted, and gain experience in the critical evaluation and application of research.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "EDUC 465 Child Studies Practicum and Seminar: Early Childhood Settings",
        "credits": 6,
        "prerequisites": "The following courses must be completed previously: EDUC 302, EDUC 304, EDUC 406. Enrolment in the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course has a practicum and seminar component. During the practicum, students develop skills in observation and curriculum planning for children in early childhood settings. Students are required to be on site for two mornings or one full day per week, for a minimum of 60 hours, in a centre-based child-care or preschool setting for children ages 0 to 5 years. The seminar complements the practicum experience and covers theoretical and applied aspects of working with children in early childhood settings. Seminar discussions focus on reflective practices, curriculum planning and using observational techniques, and organization of child-care settings that promote the health, safety and education of children ages 0 to 5 years.",
        "components": "Seminar; Practicum/Internship/Work Term",
        "notes": "A minimum “C+” grade is required for students enrolled in this course, in order to complete their Concentration A: Early Childhood Settings for the Major in Child Studies program. Any student who obtains a grade below the minimum “C+” must repeat the practicum and seminar activities (EDUC 465), even if the student achieved satisfactory standing in some of the competencies and/or assignments. Students are allowed to repeat this course only once. Students who achieve a final grade below “C+” during the second time are asked to withdraw from the Major in Child Studies program.Students who have received credit for EDUC 460 and EDUC 461 may not take this course for credit."
    },
    {
        "title": "EDUC 466 Child Studies Practicum and Seminar: Inclusive Practices in Childhood Settings",
        "credits": 6,
        "prerequisites": "The following courses must be completed previously: EDUC 360; EDUC 361 or EDUC 362. Enrolment in the Major in Child Studies is required.",
        "corequisites": "",
        "description": "This course has a seminar and practicum component. During the practicum, students develop skills in observing and planning curriculum for children exhibiting a range of social-emotional, cognitive, behavioural, and academic competencies and needs. Students are required to be in a field placement two mornings or one full day per week, for a minimum of 60 hours in settings such as schools, community organizations, hospitals, or rehabilitation centres. The seminar complements the practicum experience and covers theoretical and applied aspects of working with children in inclusive childhood settings. The focus is on reflective practices, curriculum planning, using observational techniques and monitoring students progress.",
        "components": "Seminar; Practicum/Internship/Work Term",
        "notes": "A minimum “C+” grade is required for students enrolled in this course, in order to complete their Concentration B: Exceptionality and Diversity in Childhood Settings for the Major in Child Studies program. Any student who obtains a grade below the minimum “C+” must repeat the practicum and seminar activities (EDUC 465), even if the student achieved satisfactory standing in some of the competencies and/or assignments. Students are allowed to repeat the course in question only once. Students who achieve a final grade below “C+” during the second time are asked to withdraw from the Major in Child Studies program.Students who have received credit for EDUC 462 and EDUC 463 may not take this course for credit."
    },
    {
        "title": "EDUC 493 Internship IV: Primary Teaching",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Specialization is required. Students must have completed 90 credits prior to enrolling. The following courses must be completed previously: EDUC 200, EDUC 222, EDUC 260, EDUC 264, EDUC 301, EDUC 311, EDUC 356, EDUC 381, EDUC 388, EDUC 395, EDUC 396, EDUC 450, EDUC 454. The following courses must be completed previously or concurrently: EDUC 382, EDUC 384, EDUC 400. The following course must be completed concurrently: EDUC 494.",
        "corequisites": "",
        "description": "The internship is a seven-week (245 hours) supervised student-teaching experience in a primary classroom (Grades 1 to 3). Students share in the daily work of their co-operating teachers, and progress gradually from being participant observers working with small groups to taking charge of the whole class as independent, creative practitioners. Students perfect their skills in lesson and unit planning, intervention strategies, the evaluation of student learning, and the management of classroom routines.",
        "components": "Practicum/Internship/Work Term",
        "notes": "This course is graded on a pass/fail basis.To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve a \"pass\" grade in this course. Students who obtain a grade that is below the required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat this course only once, the next time the course is given, in order to achieve the required grade. Students who obtain a “fail” grade in EDUC 493 or a grade below the minimum “B” in EDUC 494 must repeat both courses concurrently, even if the students achieve the minimum grade in one of the two courses."
    },
    {
        "title": "EDUC 494 Primary Teaching Seminar",
        "credits": 3,
        "prerequisites": "Enrolment in Early Childhood and Elementary Education Specialization is required. Students must have completed 90 credits prior to enrolling. The following courses must be completed previously: EDUC 200, EDUC 222, EDUC 260, EDUC 264, EDUC 301, EDUC 311, EDUC 356, EDUC 381, EDUC 388, EDUC 395, EDUC 396, EDUC 450, EDUC 454. The following courses must be completed previously or concurrently: EDUC 382, EDUC 384, EDUC 400. The following course must be completed concurrently: EDUC 493.",
        "corequisites": "",
        "description": "The seminar complements EDUC 493 by providing the opportunity, means, and impetus for students to reflect critically on their teaching philosophy and practice. Topics include the development of appropriate and stimulating learning environments, primary program guidelines set out by the MEQ, planning and implementation of curriculum units, and other current issues in primary education.",
        "components": "Seminar",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “B” grade in this course. Students who obtain a grade that is below the above-required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade. Students who obtain a “fail” grade in EDUC 493 or a grade below the minimum “B” in EDUC 494 must repeat both courses concurrently, even if the students achieve the minimum grade in one of the two courses."
    },
    {
        "title": "EDUC 495 Internship V: Upper Elementary Teaching",
        "credits": 3,
        "prerequisites": "Enrolment in the Early Childhood and Elementary Education Specialization is required. Students must have completed 90 credits prior to enrolling. The following courses must be completed previously: EDUC 200, EDUC 222, EDUC 260, EDUC 264, EDUC 301, EDUC 311, EDUC 356, EDUC 381, EDUC 388, EDUC 445, EDUC 450, EDUC 454. The following courses must be completed previously or concurrently: EDUC 382, EDUC 384, EDUC 400, EDUC 493, EDUC 494. The following course must be completed concurrently: EDUC 496.",
        "corequisites": "",
        "description": "Students are placed in an elementary classroom (Grades 4 to 6) for a seven-week student-teaching experience (245 hours). They are provided with the opportunity to continue to develop their own teaching strategies and enhance their skills in curriculum planning and implementation, preparing and evaluating classroom materials, and monitoring student progress. Students participate in the daily routines and educational duties of their co-operating teachers and become involved in student activities.",
        "components": "Practicum/Internship/Work Term",
        "notes": "This course is graded on a pass/fail basis.To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve a \"pass\" grade in this course. Students who obtain a grade that is below the above-required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat this course only once, the next time the course is given, in order to achieve the required grade. Students who obtain a “fail” grade in EDUC 495 or a grade below the minimum “B” in EDUC 496 must repeat both courses concurrently, even if the students achieve the minimum grade in one of the two courses."
    },
    {
        "title": "EDUC 496 Upper Elementary Teaching Seminar",
        "credits": 3,
        "prerequisites": "Enrolment in Early Childhood and Elementary Education Specialization is required. Students must have completed 90 credits prior to enrolling. The following courses must be completed previously: EDUC 200, EDUC 222, EDUC 260, EDUC 264, EDUC 301, EDUC 311, EDUC 356, EDUC 381, EDUC 388, EDUC 445, EDUC 450, EDUC 454. The following courses must be completed previously or concurrently: EDUC 382, EDUC 384, EDUC 400, EDUC 493, EDUC 494. The following course must be completed concurrently: EDUC 495.",
        "corequisites": "",
        "description": "This course focuses on the discussion, review, and analysis of relevant material in the context of students’ internship placements. Topics include assessment and evaluation; involvement of parents in their children’s education; guidelines established by the MEQ; teaching strategies; self‑reflection and evaluation.",
        "components": "Seminar",
        "notes": "To remain in the Early Childhood and Elementary Education Specialization program and to be recommended for certification, students must achieve at least a “B” grade in this course. Students who obtain a grade that is below the above-required level are placed on conditional standing within the program and are informed in writing. Students are allowed to repeat the course in question only once, the next time the course is given, in order to achieve the required grade. Students who obtain a “fail” grade in EDUC 495 or a grade below the minimum “B” in EDUC 496 must repeat both courses concurrently, even if the students achieve the minimum grade in one of the two courses."
    },
    {
        "title": "EDUC 498 Advanced Topics in Education",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "EDUC 499 Advanced Topics in Education",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    }
]