[
    {
        "title": "ENGL 206 Fundamentals of Written English – Stage I",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ESL 204 or placement test.",
        "corequisites": "",
        "description": "This course provides training in grammar and idiomatic usage, through practice with articles and plurals, verb forms and tenses, prepositions and verb‑preposition combinations, sentence structure, and punctuation, as well as reading comprehension and vocabulary development through practice in paraphrasing short texts.",
        "components": "Lecture",
        "notes": "This course does not count for credit within any English program.Students who have received credit for this course may not subsequently take any ESL course for credit."
    },
    {
        "title": "ENGL 207 Fundamentals of Written English – Stage II",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 206 or placement test.",
        "corequisites": "",
        "description": "This course continues the work begun in ENGL 206 by providing additional training and practice in grammar and idiomatic usage, sentence structure and punctuation, as well as vocabulary development and reading comprehension through practice in paraphrasing and summarizing.",
        "components": "Lecture",
        "notes": "This course does not count for credit within any English program.Students who have received credit for this course may not subsequently take any ESL course or English course earlier in the composition sequence for credit."
    },
    {
        "title": "ENGL 208 Introduction to English Composition and Literary Analysis",
        "credits": 3,
        "prerequisites": "Students must complete a placement test prior to enrolling.",
        "corequisites": "",
        "description": "This course is intended for students who wish to improve their writing skills through written analysis of fiction, drama, and literary essays.",
        "components": "Lecture",
        "notes": "This course does not count for credit within any English Literature, Creative Writing, or Professional Writing program.Students who have received credit for this course may not subsequently take any ESL course for credit."
    },
    {
        "title": "ENGL 210 Introduction to Essay Writing",
        "credits": 3,
        "prerequisites": "The following conditions must be met prior to enrolling: completion of ENGL 207 or placement test or enrolment in the Kaié:ri Nikawerá:ke Indigenous Bridging Program.",
        "corequisites": "",
        "description": "The course provides further practice in English composition by focusing on diction, sentence structure, punctuation, paragraph development, and essay writing.",
        "components": "Lecture",
        "notes": "This course does not count for credit within any English program. Students who have received credit for this course may not subsequently take ENGL 206 or ENGL 207 for credit."
    },
    {
        "title": "ENGL 212 English Composition — Stage I",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 210 or placement test.",
        "corequisites": "",
        "description": "This course is intended to help students produce clear, concise, logically organized essays and reports. Emphasis is placed on purpose, organization, and development through analysis and integration of information from a variety of sources.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take any ESL course or English course earlier in the composition sequence for credit."
    },
    {
        "title": "ENGL 213 English Composition — Stage II",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 212 or placement test.",
        "corequisites": "",
        "description": "This course further develops the writing skills acquired in ENGL 212 by familiarizing students with the processes and techniques necessary for the preparation of research papers and academic reports. Emphasis is placed on summarizing and paraphrasing, critiquing ideas and information, and synthesizing, citing, and documenting multiple sources. A library research skills component is a required part of this course.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take ENGL 206, ENGL 207, ENGL 210, or ENGL 212 for credit. The composition sequence also includes ENGL 396."
    },
    {
        "title": "ENGL 214 Editing I: Grammar, Usage, and Style",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 213. Enrolment in the Minor in Professional Writing is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course offers a practical analysis of the conventions governing contemporary English grammar and usage, punctuation, sentence structure, and syntax. It focuses on stylistic effectiveness and persuasive power in diverse professional situations.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take any ESL course or ENGL 206, ENGL 207, ENGL 210, or ENGL 212 for credit."
    },
    {
        "title": "ENGL 215 Editing II: Principles and Practice of Editing",
        "credits": 3,
        "prerequisites": "The following course must be completed previously or concurrently: ENGL 214.",
        "corequisites": "",
        "description": "This course builds on the concepts introduced in ENGL 214. Students are introduced also to copy editing and techniques for eliminating errors in style, mechanics, and fact, and substantive editing for identifying structural problems and reorganizing and rewriting documents.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take ENGL 206, ENGL 207, ENGL 210, or ENGL 212 for credit."
    },
    {
        "title": "ENGL 216 Audience and Purpose in Professional Writing",
        "credits": 3,
        "prerequisites": "The following course must be completed previously or concurrently: ENGL 213.",
        "corequisites": "",
        "description": "This course examines the ways that information is presented to a variety of audiences through writing and the interaction of texts and images.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take ENGL 206, ENGL 207, or ENGL 212 for credit."
    },
    {
        "title": "ENGL 224 The Creative Process",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces students to some options for developing their own process of literary creation, from the development of an idea through to the writing and editing of works of prose fiction, poetry, and/or drama. Coursework may include writing assignments, in‑class exercises, readings, group presentations, and discussions. This course is open to all students.",
        "components": "Lecture",
        "notes": "This course does not count for credit in any Creative Writing program (Major, Minor, Honours in English and Creative Writing)."
    },
    {
        "title": "ENGL 225 Introductory Creative Writing: Poetry",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "This is an introductory workshop in the writing of poetry. The first half of the course is an introduction to poetic forms and techniques. Required readings of poetry and critical essays, and exercises and assignments based on these readings, develop a common critical language and an understanding of poetry from a writer’s point of view. This knowledge is applied during the second half of the course, during which the class is conducted as a writing workshop. Students submit their original work for class discussion and evaluation.",
        "components": "Lecture",
        "notes": "Students wishing to register for ENGL 225, ENGL 226, or ENGL 227, should refer to admission requirements for Creative Writing."
    },
    {
        "title": "ENGL 226 Introductory Creative Writing: Prose Fiction",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "This is an introductory workshop in the writing of prose fiction. The first half of the course is an introduction to prose forms and techniques. Required readings of fiction and critical essays, and exercises and assignments based on these readings, develop a common critical language and an understanding of fiction from a writer’s point of view. This knowledge is applied during the second half of the course, during which the class is conducted as a writing workshop. Students submit their original work for class discussion and evaluation.",
        "components": "Lecture",
        "notes": "Students wishing to register for ENGL 225, ENGL 226, or ENGL 227, should refer to admission requirements for Creative Writing."
    },
    {
        "title": "ENGL 227 Introductory Creative Writing: Playwriting",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "This is an introductory workshop in the writing of plays. The first half of the course is an introduction to dramatic forms and techniques. Required readings of drama and critical essays, and exercises and assignments based on these readings, develop a common critical language and an understanding of drama from a writer’s point of view. This knowledge is applied during the second half of the course, during which the class is conducted as a writing workshop. Students submit their original work for class discussion and evaluation.",
        "components": "Lecture",
        "notes": "Students wishing to register for ENGL 225, ENGL 226, or ENGL 227, should refer to admission requirements for Creative Writing."
    },
    {
        "title": "ENGL 231 The Global Middle Ages",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies the texts and narrative traditions circulating in and through the trade networks of Europe, Asia, Africa, and the North Atlantic between 400 and 1500 CE. It examines such forms as histories, chronicles, travel narratives, letters, poems and sagas from diverse regions within the contexts of conquest, travel and cross-cultural contact.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 233 Methods of Literary Analysis",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This courses introduces students to the practice of literary analysis, with particular emphasis on methods for closely and critically reading literary texts. Attention is given to genre, form, rhetorical and figurative language and narrative structure with the aim of providing students with the necessary skills for literary analysis.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 234 Poetry",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Through detailed examination of various forms of poetry, this course familiarizes students with the critical vocabulary, techniques, and concepts of poetic analysis. It asks such questions as: what is poetry, how does it work, and how has it changed across the history of its formal and thematic developments?",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 235 Short Fiction",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Through a detailed examination of the various forms of short fiction and the novella, this course familiarizes students with the building blocks of narrative: story, plot, and narration; treatments of time and space; character; dialogue; focalization; and genre. Topics may include the history of the genre, critical approaches, and types of formal experiment.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 237 Tragedy",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the nature and varieties of tragic forms and sensibilities in literature. The course may include works from antiquity to the present.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 238 Comedy",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the nature and varieties of comic forms and sensibilities in literature. The course may include works from antiquity to the present.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 240 Drama",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to dramatic literature, familiarizing students with a selection of major works in this genre. The course may include plays and works written for the stage from antiquity to the present.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 241 The Novel",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to varieties of novelistic form, familiarizing students with the history of the novel and with critical approaches to the study of this literary genre.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 2420 Adaptations",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to theories and instances of adaptation, exploring the manner in which adapting works from one form to another can challenge notions of originality and illuminate the affordances of specific media.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 2421 Literature Out Loud",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces students to the significance of aurality in the making and reception of literary works and the boundaries that define them, with attention to histories, technologies, cultures, genres, and practices of attention that have shaped the relation between sound and literature.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 243 Satire",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the nature, varieties, and functions of satire. The course may include works from antiquity to the present.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 244 Quebec/Montreal Writing in English",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course surveys the literature of Quebec written in English, with emphasis on Montreal writing. Works studied may include poetry, novels, short stories, films, recordings, podcasts, experimental writing, interviews, essays, spoken word and plays, and address topics related to local publishers and literary communities.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 2450 Horror and the Gothic",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the intertwining genres of the gothic and horror. It familiarizes students with the formation of these genres, the history of their relationship, and their contemporary development.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 246 Science Fiction and Fantasy",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the intertwining genres of science fiction and fantasy. It familiarizes students with the formation of these genres, the history of their relationship, and their contemporary development.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 249 Children’s Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the varieties of children's literature. It familiarizes students with the characteristics of this genre, its relationship to folklore, fairy tales, and myths, and the narrative techniques, stylistic transformations, and cultural shifts that have shaped its history.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 250 Forms of Popular Writing",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "The topic of this course varies from year to year. It investigates such forms as spy novel, detective fiction, mystery, romance, travel writing, horror, and erotica in the context of the conventions, history, and popular appeal of the genre under discussion.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 251 The Graphic Novel",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the graphic novel, exploring the way in which narrative technique and the production of meaning are shaped by relationships between text and image. The course also familiarizes students with the graphic novel’s borrowings from other forms and genres of literature and popular culture.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an ENGL 398 number may not take this course for credit."
    },
    {
        "title": "ENGL 2520 Legends of Arthur",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies the figure of King Arthur from his first mention in medieval chronicles through the vast corpus of artistic production his myth inspired. Works and genres studied may include romances, poems, plays, novels, visual art, film, and digital media.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an ENGL 398 number may not take this course for credit."
    },
    {
        "title": "ENGL 2530 Shakespeare and Film",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores film adaptations of Shakespeare’s plays, examining the effects of translating the primarily verbal medium of Shakespeare’s theatre into the primarily visual medium of film. Studying adaptations from different periods and in different languages, while considering both filmed stage performances and cinematic works, students enrich their understanding of individual plays and their shifting meaning across discrepant media and historical contexts.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an ENGL 317 number may not take this course for credit."
    },
    {
        "title": "ENGL 2540 Detective Fiction",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to detective fiction, familiarizing students with variations of the genre in its treatment of both amateur and professional detectives. Topics may include the emergence of the private eye, the hardboiled style, police detection, noir, and crime fiction. Works studied may be drawn from literature, film, and other media.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 255 Video Games and/as Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the study of the formal, aesthetic and cultural aspects of video games. It places particular emphasis on the relationship of digital games to the history of literary form, introducing students to critical approaches that address the importance of narrative, the materiality of digital text, and the role of interpretive communities.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an ENGL 398 number may not take this course for credit."
    },
    {
        "title": "ENGL 2550 Reading Pop Culture",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course traverses different media to familiarize students with varieties of pop culture and approaches to studying it. It interrogates what is included in or excluded from the boundaries of literature and how the history of popular culture has been transformed by the rise of \"pop\" in the mid-20th century.Notes:Students who have received credit for this topic under an ENGL 298 number may not take this course for credit.",
        "components": null,
        "notes": "Students who have received credit for this topic under an ENGL 298 number may not take this course for credit."
    },
    {
        "title": "ENGL 260 Introduction to Literary Studies",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course provides students with a broad introduction to the practice of literary study. Central to the course is an exploration of critical approaches to literature and the major political and aesthetic considerations framing the discipline. Students read and write about a variety of texts while developing the critical tools and perspectives with which to analyze them.",
        "components": "Lecture; Conference",
        "notes": null
    },
    {
        "title": "ENGL 261 Literatures in English before 1660",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course surveys literary production in the medieval and early-modern periods, situating texts written in English historical dialects in relation to the major literary languages of the British Isles before the Restoration. Genres and forms such as alliterative poetry, romance, lais, fabliaux, courtly love lyric, sonnets, comedy, tragedy, and epic are examined in relation to historical events like the conversion of the English to Christianity, the Danish and Norman Conquests, the beginning of secular book production, the introduction of print, the English Reformation, and the establishment of the first English colonies.",
        "components": "Lecture; Conference",
        "notes": null
    },
    {
        "title": "ENGL 262 Literatures in English after 1660",
        "credits": 3,
        "prerequisites": "It is recommended that students complete ENGL 261 prior to enrolling.",
        "corequisites": "",
        "description": "This course surveys literary production in the English language during and after the Age of Enlightenment, beginning with the Restoration and continuing to the present. Genres and forms such as epic, mock-epic, satire, the novel, the Romantic lyric, and the comedy of manners are examined in relation to historical events like the commercialization of print, the professionalization of authorship, the global expansion of the British Empire, the increased activity of women writers, and the emergence of modernism.",
        "components": "Lecture; Conference",
        "notes": null
    },
    {
        "title": "ENGL 298 Selected Topics in English",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "ENGL 300 Video Games and/as Theory",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Video game studies is a broad discipline that draws on many different philosophical perspectives and methodologies. Focusing on the key topics of history, ideology, political economy and cultural production, this course pairs a range of critical texts from literary history and cultural studies with specific video games in order to consider what games can teach people about theory as well as what theory can teach people about games.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an ENGL 398 number may not take this course for credit."
    },
    {
        "title": "ENGL 3010 Literature and Media",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines how literature represents media technologies and has been transformed by their history. It explores how the development of media theory has altered approaches to literary studies.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 302 History of the English Language",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course surveys the development of the English language from its Indo-European origins through its first written attestations into the present, demonstrating how historical events and language contact have contributed to its changes. Topics may include historical sound changes, the impact on English of Norse and Norman settlers, the development of both official and local varieties of English during and after the period of the British Empire, and the distinctive uses of English in multilingual localities like contemporary Montreal.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3030 Gender and Sexuality in the Middle Ages",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Through such discourses as literature, law, and natural philosophy, this course investigates debates about misogyny and courtly love, virginity and chastity, marriage, reproduction, same-sex desire, and female autonomy. Genres surveyed may include romance, hagiography, letter collections, medical texts, charms, spells, dream visions, and prophecies.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3040 Chaucer: Tragedy and Philosophy",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines select major and minor works by Geoffrey Chaucer.Texts surveyed may include Chaucer’s dream visions, short poems, translations, and his major tragedy Troilus and Criseyde. Texts are situated in the intellectual and historical context of their production and considered in terms of their influence on later periods.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 304 may not take this course for credit."
    },
    {
        "title": "ENGL 3041 Chaucer: The Canterbury Tales",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines The Canterbury Tales, one of the most enduring and influential works in the English language. Texts are situated in the intellectual and historical context of their production and considered in terms of their influence on later periods.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 304 may not take this course for credit."
    },
    {
        "title": "ENGL 305 Studies in Medieval English Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in the history of Old English and Middle English literature. Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 306 Tolkien’s Old English",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies works of Old English literature that inspired J.R.R. Tolkien’s fantasy novels. Tolkien’s scholarship on Old English, his rewritings of Old English texts, and his original compositions in Old English are studied to understand his world-building methods. The course provides an introduction to the basic elements of Old English for students with no knowledge of the language.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an ENGL 305 number may not take this course for credit."
    },
    {
        "title": "ENGL 307 The Viking Age in Poetry and Prose",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies the literature of and about England between 793 and 1066 CE, when Scandinavian kings controlled a trade network extending from Constantinople to Kalaallit Nunaat (Greenland). Works may include Old English poetry, eddic and skaldic verse, chronicles, sagas, runic inscriptions, romances, novels, film, television, and video games.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 308 Mysteries, Miracles, and Medieval Drama",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies drama in the period between the fall of the Western Roman Empire and the rise of the commercial theatre in the 16th century, focusing particularly on late‑medieval England. It may include mystery plays from York, Chester and elsewhere, as well as morality plays like Everyman and The Castle of Perseverance.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3090 Women Writers of the Early Modern Period",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the emergence into print of women writers from the late-16th to the late-17th centuries, by exploring such issues as the construction of literary history, histories of gender and sexuality, and the relations between gender and genre. Students examine a variety of genres, including poetry, drama, prose, and letters, with attention to how women navigated and contributed to the literary culture of their time.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 435 or for this topic under an ENGL 317 number may not take this course for credit."
    },
    {
        "title": "ENGL 310 English Renaissance Poetry",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines aspects of the development of Renaissance poetry from the late‑15th century to the Civil War and Commonwealth periods, through an examination of representative writers in their historical and cultural contexts. It explores how lyric poetry participates in the languages of love, religion, politics, colonialism, philosophy, and science in early modern England.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 311 English Renaissance Prose",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines aspects of the development of prose from the 1590s through the Civil War and Commonwealth periods, including such issues as the representation of subjectivity and gender, the function of patronage, the relationship between high and low culture, and the shift to print culture. It explores how such early modern social and cultural preoccupations as public and private religious sensibility, toleration, empire and nation, and environmental issues emerge in such prose forms as the essay, dialogue, newsbook, sermon, popular romance, diary, conduct book, and travel writing.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3150 Major Author, Renaissance",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on the work of one author in the Renaissance period. Specific authors covered for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 316 Spenser",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on the works of Edmund Spenser, with particular emphasis on The Faerie Queene. It explores Spenser's experimentation with genre and considers his works in their historical and cultural contexts.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 317 Studies in English Renaissance Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in the history of English Renaissance literature. Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 318 English Renaissance Drama",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course covers a range of plays written in the period from the start of the English commercial theatre in 1576 until its closing in 1642. It examines the cultural, political and intellectual contexts of individual plays, as well as the social and economic place of the stage.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 319 Milton",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines Milton's prose, poetry and dramatic works primarily as they illuminate his epic. It sets Paradise Lost in its literary, intellectual and religious contexts.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3200 Shakespeare: Histories and Tragedies",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines a selection of Shakespeare's Histories and Tragedies. It explores individual plays in relation to such matters as dramatic and theatrical conventions, social history, poetic language, high and popular culture, critical history, and influence.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 320 may not take this course for credit."
    },
    {
        "title": "ENGL 3201 Shakespeare: Comedies and Romances",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines a selection of Shakespeare's Comedies and Romances. It explores individual plays in relation to such matters as dramatic and theatrical conventions, social history, poetic language, high and popular culture, critical history, and influence.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 320 may not take this course for credit."
    },
    {
        "title": "ENGL 321 Studies in Restoration and Early 18th-Century Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies literature in English from 1660, when the British monarchy was returned to power, to 1730, when the court no longer dominated British literary culture. The course examines the wide range of genres introduced or transformed by the period’s restless literary imagination, including the novel, satire, the letter, and the essay. It situates these developments in the context of changing ideas of status, gender, sexuality, science, politics, and economics.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 322 Restoration and 18th-Century Drama",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the changing role of theatre in English culture after the re‑opening of the theatres in 1660 to the middle years of the 18th century: from aristocratic heroism and libertine scandals to increasingly middle‑class pleasures. It focuses on the transformation of dramatic conventions in such forms as the comedy of manners and sentimental tragedy and familiarizes students with the history of performance in the period, including the introduction of actresses and the codification of new acting styles.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 323 The Literature of Sensibility",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the structure and nature of feeling in British literature of the mid‑ and late‑18th century along with some consideration of concurrent developments in philosophy, historical and critical writing, and biography. It explores the contributions of concepts of sensibility and sympathy to aesthetic innovations such as realism, pornography, the gothic, and the sublime, and political developments such as feminism, abolitionism, and an emergent discourse of human rights.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3250 Major Author, 18th Century",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on the work of one author in the 18th century. Specific authors covered for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 326 Studies in 18th-Century British Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in the history of 18th-century literature in English. Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 327 Restoration and 18th-Century Satire",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the development of satirical poetry, prose, and drama in the Restoration and 18th century. It explores formal issues such as satire’s debts and contributions to pastoral, georgic, epic, comedy and the novel alongside such social, political, and intellectual concerns as the battle of the ancients and the moderns, libel, sedition, and copyright law, the rise of party politics, and changing gender roles.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 328 The Rise of the Novel",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the emergence and evolution of the novel and novel criticism from their beginnings in the 1680s until the end of the 18th century. It explores the reciprocal pressures of romance and realism in the formation of the novel in order to consider the ethical and aesthetic issues raised by this popular genre as well as the influences of other genres such as journalism, letters, diaries, and travel writing.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3290 Romanticism",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the prose and poetry of the Romantic period (ca. 1790 to 1830s) in relation to such topics as the French Revolution and Napoleonic wars, colonialism, empire, and migration, the industrial revolution, urbanization, changing concepts of nature, and the figure of the Romantic writer.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 329 may not take this course for credit."
    },
    {
        "title": "ENGL 331 Women Writers of the 18th Century",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the poetry, prose, and drama of 18th-century women writers in such contexts as the gendering of authorship, the making of literary history, and the uses and transformations of literary conventions.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 332 Studies in 19th-Century Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in the history of 19th-century literature in English. Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 333 19th-Century Poetry",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores 19th-century poetry from the Victorian period to the Fin de siècle. Forms studied may include narrative verse, dramatic monologue, sonnet sequence, romance, ballad and elegy.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 334 19th-Century Fiction",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores the Victorian novel, the dominant genre of the century, as well as examples of other prominent prose genres, including memoir, biography, history, natural history and speculative fiction.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3341 Women Writers of the 19th Century",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the poetry, prose, and drama of 19th-century women writers. It sets select works in such contexts as the gendering of authorship, the making of literary history, and the uses and transformations of literary conventions.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3350 The Bible and Contemporary Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces students to important literary works of the past century that update, revise, or provocatively interrogate established religious texts and narratives. It engages with the history and literary character of the Hebrew Bible and its influence on literary tradition, focusing on the way its narratives supply archetypal stories, characters, and motifs.",
        "components": "Lecture",
        "notes": "Students who have received credit for RELI 3350, or for this topic under an ENGL 398 or RELI 398 number, may not take this course for credit."
    },
    {
        "title": "ENGL 3351 Colonialism and Empire in the Victorian period",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies the colonial and imperialist politics of the expansion over vast territories during the reign of Queen Victoria as crucial to the historical context and thematic content of literature in English written during this period. In addition to 19th-century novels, poems, essays, political writings, and literary criticism, the course may also include theoretical texts on colonialism and empire by 20th- and 21st-century thinkers.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3361 Major Author, 19th Century",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on the work of one author in the 19th century. Specific authors covered for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 338 Studies in 20th-Century British Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in 20th-century British literature. Topics may include the modernist coteries of Imagism, Vorticism, and Bloomsbury; the two World Wars; the decline of the empire and the arrival of immigrants from formerly colonized nations; the rise of British cultural studies and the British Black arts movement; postmodernism, punk, and camp. Readings of diverse works from a range of genres trace the literary history of this period of profound change.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 337 may not take this course for credit."
    },
    {
        "title": "ENGL 3390 Black British Literature and Culture",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This class examines literature by British writers of African and Caribbean descent. Topics may include national belonging and canonicity; the interrelationship of Britishness and Blackness; notions of post-imperial, multi-ethnic space, place, and temporality; the Black Atlantic, or cross-fertilizations between British culture and North American, Caribbean, and African cultures; and art as activism. The course explores fiction and non-fiction alongside such elements of popular Black culture as music and film.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3400 Modernism",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores how, in the first half of the 20th century, modernist experiments with formal possibilities pressed the limits of art's social function and expressive powers while enabling new modes of collectivity and political engagement. Considering this cultural ferment in the context of cataclysmic wars and revolutions, students engage with the fundamental transformations of art and literature that energized several generations of international modernists.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 340 may not take this course for credit."
    },
    {
        "title": "ENGL 341 Modern Fiction",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores developments in international literary culture from the late-19th century to the post‑war period, a time of rapid and tumultuous change. Studying novels and short stories, with attention to formal experiments with stream of consciousness narration, unreliable narrators, and non-linear storytelling, students consider how modern fiction responds to new communication technologies, including radio and cinema, two world wars, the waning of empire, women’s suffrage, and intellectual provocations in philosophy, psychology, and science.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 342 Creative Writing: Prose Fiction",
        "credits": 6,
        "prerequisites": "The following course must be completed previously: ENGL 226. Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Through intensive analysis and discussion of submitted work and directed reading in modern fiction, this workshop extends the development of students’ narrative skills and their understanding of fictional forms.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 426 may not take this course for credit."
    },
    {
        "title": "ENGL 343 Modern European Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on literature in translation by continental European authors of the late-19th and 20th century, as modern societies were transformed by new media, communication, and transportation technologies (photography, cinema, telegraph, phonograph, automobile), increasing urbanization, imperialist rivalries, world wars, political revolutions, colonialism and decolonization. Literary techniques likewise underwent major transformations, including the emergence of stream of consciousness narration, free verse, formal fragmentation, and new methods of defamiliarization. Genres covered may include fiction, poetry, and drama.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 346 may not take this course for credit."
    },
    {
        "title": "ENGL 345 Modern Drama",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces students to modern drama, focusing on plays from the late-19th and 20th century that challenge theatrical conventions and social norms. It considers works that are realistic in subject matter, dialogue, setting and character, as well as others that are self-consciously abstract and experimental.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 347 Creative Non-Fiction Writing",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 225 or ENGL 226 or ENGL 227. Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course is a workshop in the writing of creative non‑fiction (journal, personal essay, travel, biography and autobiography) including the reading of selected texts and discussion and criticism of students’ work.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 410 or for this topic under an ENGL 429 number may not take this course for credit."
    },
    {
        "title": "ENGL 348 Creative Writing: Poetry",
        "credits": 6,
        "prerequisites": "The following course must be completed previously: ENGL 225. Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Through intensive analysis and discussion of students’ work, experimentation with a variety of forms, and selected reading, this workshop helps students extend their grasp of poetics and their competence in the writing of poetry.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 425 may not take this course for credit."
    },
    {
        "title": "ENGL 349 Modern Poetry",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course surveys major trends in poetry of the late-19th and 20th century, a period in which poetic form undergoes important transformations. It considers modernist experimentation with free verse, fragmentary language, collage composition, and other innovative practices alongside traditional verse forms applied to modern experience in the context of the First World War, urbanization, new technologies, and rapidly changing social relations.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3491 Major Author, 20th Century",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on the work of one author in the 20th century. Specific authors covered for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 351 Women Writers of the 20th Century",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Through fiction, personal writing, essays, poetry, and drama written by women, this course examines gender and its discontents over a period of significant cultural and social change. Emphasis is placed on how these writers engaged with, and responded to, the three waves of 20th-century feminism, addressing issues such as gender, identity, race, sexuality, power, work, family, and politics.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 352 Contemporary Women Writers",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course deals with fiction, personal writings, poetry, and drama written by women from the late 20th century to the present. Its concerns may include the challenges and possibilities of new literary forms; experiments in writing the life, writing the body, writing race, writing between genres and between cultures; collaborative writing; and the uses and transformations of traditional and popular forms of writing.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 354 may not take this course for credit."
    },
    {
        "title": "ENGL 3521 Queer and Trans Writers",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on queer and trans writers in literature and theory. It addresses transformations of gender/sexuality studies since the late-20th century alongside works of fiction, poetry, and drama which may be chosen from any period of literary history.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 353 Contemporary Irish Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines Irish literary texts which reflect the social, economic, political and cultural transformations on the island of Ireland since the 1960s, including insurrectionary civil strife, confrontations with systemic and institutional abuse, the liberalizing constitution, changing economic and social policies, and environmental crises.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an ENGL 359 or IRST 398 number may not take this course for credit."
    },
    {
        "title": "ENGL 354 Studies in 21st-Century Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in the history of 21st-century literature in English. Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 350 may not take this course for credit."
    },
    {
        "title": "ENGL 355 Joyce",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on James Joyce’s epochal novel Ulysses in its formal, historical, and cultural contexts. Other writings of Joyce may also be covered.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 356 The Irish Short Story Tradition",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course traces the development of the Irish short story from its roots in the Gaelic story‑telling tradition to its development into a literary form in the 19th century and its blossoming in the 20th century. Students discuss the narrative strategies used to explore various versions of Irish identity.",
        "components": "Lecture",
        "notes": "Students have received credit for this topic under an ENGL 359 or IRST 398 number may not take this course for credit."
    },
    {
        "title": "ENGL 357 The Irish Literary Revival",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course traces the origins and nature of the Irish literary renaissance that began in the 1880s. It examines such issues as the rise of cultural nationalism and concomitant turn to Ireland’s past, both mythic and historic, as well as the continuing influence of the Catholic Church and the British State.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 359 Studies in Irish Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in the history of Irish literature. Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3600 Studies in American Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in American literature. Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 360 may not take this course for credit."
    },
    {
        "title": "ENGL 362 Pre-Civil War American Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines early American literature, from early contact with Indigenous communities to slavery and the Civil War, with attention to the uneven development of what would later be understood as a national literature. Themes and genres may include captivity and slave narratives; individualism and self-reliance; Puritanism and its aftermath; transcendentalism and its advocates; and the Civil War and its divisions.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 363 Post-Civil War American Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines American literature from the end of the civil war to the early decades of the 20th century, with attention to the rise of urban culture, post-Reconstruction racial politics, and the emergence of modernism. Themes may include the efflorescence of Black authorship; the construction of new literary forms and movements, such as realism and naturalism; and the effects of migration and dislocation.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 364 20th-Century American Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines American literature of the 20th century, either through a survey of the period or a focus on particular sub-periods or themes. Historical and thematic emphases may include literary modernism and the Harlem renaissance; transformations of American culture by the two World Wars; literature of the Cold War and the counterculture; the postwar welfare state and the rise of neoliberalism; postmodern or late-modernist formal experiments; and complex intersections of race, class, gender, and sexuality under changing historical circumstances.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3651 Race and Ethnicity in American Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores ethnicity and race in American literature by examining the works of writers from historically marginalized communities, highlighting their challenge to and/or consolidation of notions of a perceived national identity.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 381 may not take this course for credit."
    },
    {
        "title": "ENGL 366 The American Novel",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the tradition of the American novel from its origins to its postmodern redefinition, through such exemplary genres and modes as gothic, adventure, romance, sentimental fiction, science fiction, naturalism, and realism.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 367 American Poetry",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the tradition of American poetry from the colonial period to contemporary developments. It explores such exemplary forms and themes as the lyric, narrative verse, free verse, Civil War poetry, Modernist collage and the formal experimentation of the postwar New American Poetry.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 369 African-American Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course concentrates on African-American literature, with potential areas of focus including early forms such as slave narratives and spirituals; transformations of Black writing and culture through the Reconstruction and segregation eras; the relation of literary forms to jazz and blues; transformations of literary possibilities through the Harlem Renaissance, the Civil Rights Movement, and the Black Arts movement; and generic styles such as Black comedy, Afrofuturism, and African-American gothic.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3700 Studies in Canadian Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines selected subjects in Canadian literature. Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 370 may not take this course for credit."
    },
    {
        "title": "ENGL 373 19th-Century Canadian Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course traces the development of Canadian literature from colonial origins to the Confederation era. Historical, thematic, and formal topics may include literary responses to the War of 1812; Black migration via the underground railroad; Indigenous histories and cultures; Confederation; regional literatures; feminist literature; post-Romantic nature writing; and literary treatments of debates concerning religion, technological change, and the relation between science and morality.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 374 20th-Century Canadian Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines the development of Canadian literature as it emerges from the tension between literary modernism and local or regional styles through periods of cultural nationalism and multicultural diversity. Historical, thematic, and formal topics may include transformations of Canadian culture by the two World Wars; the concrete images and free verse forms of modernist poetry; social, religious, and cultural tensions between French and English communities in Quebec; the recovery of Indigenous histories and assertion of Indigenous literary and storytelling traditions by First Nations, Métis, and Inuit writers; self-reflexive, feminist, and poetic experiments of the 1960s and 1970s; and the rewriting of colonial and diasporic histories.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3771 Race and Ethnicity in Canadian Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course reflects on how race and ethnicity have shaped the practice and critical approaches to Canadian literature and its exclusions. The course may explore literatures that consider race and racism in Canada and Quebec, diasporic and migratory histories, critical perspectives on whiteness, and perspectives from Black Canadian literatures. It may centre on specific themes, forms, events, or communities in relation to the broader course theme or offer a general survey of literatures engaging with race and ethnicity in Canada.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 378 Canadian Poetry",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course examines developments in Canadian poetry from colonial beginnings to contemporary experimentation. Attention is given to oral forms of poetry as well as to formal experiments in such genres as the lyric and long poem.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3790 Canadian Fiction",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course traces the development of Canadian fiction from regionalism and naturalism to modernist experimentation, postmodern multiculturalism and Indigenous innovation. Including short stories, novels, and occasionally adaptations, it situates selected works of Canadian fiction within critical contexts and current discourses of the discipline.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 380 Indigenous Literatures",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on literature by Indigenous authors and critical approaches to it. It introduces the study of Indigenous literatures of Turtle Island with attention to history, scope and diversity. It may also feature Indigenous literatures from different areas of the globe, a survey of literatures by specific Indigenous nations and communities, or an examination of a particular theme within Indigenous literatures. The course considers Indigenous storytelling alongside ancestral traditions, resurgent practices, and resistance movements.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3811 Critical Perspectives on Settler Colonialism",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces students to critical approaches to settler colonialism informed by postcolonial, anticolonial, and decolonial thought, global Indigenous resistance movements, critical race theory, and Black studies. Focusing upon a particular geographical context or surveying different contexts, the course addresses such issues as the difference between settler and other forms of colonialism, the intercontinental scope of settler colonialism (as well as its legacies and failures), and the status of land in Indigenous and settler epistemologies.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 382 Literature of Migration and Diaspora",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores literatures of, and critical approaches to, peoples who have migrated or been displaced from their homelands, including diasporic and refugee literatures. The course may focus on a specific diasporic community or offer a survey of various literatures of migration.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 383 African Literatures",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores literatures by African writers and may include other media and cultural forms, focusing on the political and aesthetic concerns emerging from these texts. It may feature investigations of how these texts are informed by colonialism and postcolonialism, the limits of these terms in studying contemporary African cultural texts, how resource extraction has shaped contemporary African art and social movements, environmental concerns, histories of violence, perspectives on the limits of English in reading African literature, gender and sexuality, and discussions of race and blackness. The course may offer a survey of cultural texts from across the continent or of a particular region, period, or theme in African literary studies.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 384 Creative Writing: Playwriting",
        "credits": 6,
        "prerequisites": "The following course must be completed previously: ENGL 227. Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Through reading of contemporary playwrights and intensive discussion and analysis of submitted work, this workshop helps students refine their skills in the process of completing a fully formed one‑act play.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 344 or ENGL 427 may not take this course for credit."
    },
    {
        "title": "ENGL 385 Studies in Postcolonial Literature and Theory",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores topics and themes in postcolonial literature and theory, aiming to offer students a broad understanding of the enduring significance of postcolonial studies to various literatures across the globe. Topics may include approaches to extractive and settler colonialism, the significance of national liberation, how literature written after liberation grapples with ongoing colonial legacies, how race functions in relation to colonialism, critiques of how colonialism continues to shape global literatures, and critiques of the term “postcolonial” and “decolonial” for studying contemporary global literatures.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 386 Caribbean Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores Caribbean literature in English by authors from nations such as Barbados, Trinidad, Antigua, Jamaica, Grenada, St. Lucia, and Guyana, as well as diasporic literatures of the region. The course may explore the history of slavery, indenture, resistance, race and racism, plantation culture, migration, colonialism, and postcolonialism in the region, with a focus on the political and aesthetic issues raised by its literatures.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 387 South Asian Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies literature and critical approaches from South Asia written in English by authors from India, Pakistan, Bangladesh, and Sri Lanka. It may include discussions of the political and economic forces shaping South Asian literary and cultural study, colonialism and postcolonialism, partition, environmental concerns, South Asian diaspora literatures, and the relationship between South Asian and other locations' postcolonial movements.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 388 Literature from Australia and New Zealand",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores literary and cultural texts of Australia and New Zealand and may also address the Pacific Islands. The exploration of themes related to settler colonialism may include the region’s literary history; literary and cultural depictions of the region’s ecologies; the effects of state racism; reflections on migration and diaspora; and texts and stories by Aboriginal, Torres Strait Islander, and Māori peoples.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 388N may not take this course for credit."
    },
    {
        "title": "ENGL 389 History of Literary Theory",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course surveys and contrasts major thinkers in the tradition of literary theory from antiquity to the present. Issues covered may include theories of genre, character, literary representation, aesthetic experience, critical methodology, narrative/poetic forms, and the relationship between literature and history.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 390 Studies in Rhetoric",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course offers an inquiry into the nature and function of rhetoric, the art of convincing others through persuasive speech and writing, through an examination of classical writers and contemporary critical discourse. Attention is paid to rhetorical tropes and figurative language, to styles of argumentation and discursive ornament, and to the relationship between rhetoric, grammar, description, and logic. The course considers how rhetoric traverses literature, philosophy, political discourse, and other forms of speech and writing.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 391 Studies in Health Humanities and Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This interdisciplinary course explores the intersection of literature and the emerging field of health humanities. This course examines how literary works engage with topics such as health, illness, disability, and medical ethics, while considering the role of narrative and metaphor in shaping one's understanding of the human experience of wellness and disease.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 392 Introduction to Critical Theory",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces students to thinkers and approaches in modern and contemporary critical theory. Areas of focus may include the emergence of new forms of critique, dialectical thinking, and genealogical investigation in the late-18th and 19th century; transformations of linguistic theory in the 20th century; the rise of French structuralism and poststructuralist theory; theories of colonialism, orientalism, decolonization, and postcoloniality; critical race theory; gender/sexuality studies; media theory and science/technology studies.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 393 Gender and Sexuality in Literary Studies",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course focuses on developments in gender/sexuality studies and their relationship to literature and literary theory. It explores how waves of feminist theory and practice, gay and lesbian struggles, the emergence of queer theory and trans theory, and changing approaches to the intersections of gender, race and class have played a major role in critical theory, literary studies and political practice.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 445 may not take this course for credit."
    },
    {
        "title": "ENGL 394 Critical Race Theory",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to critical race theory and its contributions to the understanding of structural racism. The course may explore various approaches to, and definitions of, race and how it continues to be central to the institutional and social functioning of everyday life. Given the vast global array of critical race theory’s ideas and influence, the course may take the form of a survey of approaches from the field or an investigation of a specific theme. Attention may be given to the limits of critical race theory’s approaches voiced by perspectives in Black and Decolonial Studies.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3945 Black Studies and Literature",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is an introduction to the interdisciplinary field of Black Studies, focusing on concepts and experiences of Blackness. Studying the historical construction of figures of Blackness through the violence of slavery, colonialism, and anti-Black racism, the course focuses as well on how such violent histories have been challenged by revolution, decolonization, by affirmations of Black life and collective struggle, and by works of art and literature that intervene in the meaning of Blackness and its centrality to modernity.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 3946 Environmental Humanities",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores the interdisciplinary field of Environmental Humanities, focusing on what literature, art, culture, and humanities disciplines offer to the study of climate change, environment, and ecology. It may explore the relationship between humanities-based and technoscientific approaches to environmental damage, critical approaches to animal, botanical, and geological forms, and how contributions from various disciplines in the Humanities reflect on planetary ecologies and crises. The course may offer a broad survey of themes within this field or focus on a specific aspect of environmental concern.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 395 Technical Writing",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 213. Enrolment in the Minor in Professional Writing is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course examines written and visual strategies for communicating information in technical fields. Practice includes experience in audience analysis and visual design in the preparation of such documents as technical abstracts, reports, proposals, descriptions, and instructional manuals.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take ENGL 206, ENGL 207, or ENGL 212 for credit."
    },
    {
        "title": "ENGL 396 Content Creation and Management in Professional Writing",
        "credits": 6,
        "prerequisites": "The following course must be completed previously: ENGL 213. Enrolment in the Minor in Professional Writing is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course is intended for students who have mastered the essentials of composition and who wish to develop their ability to write effectively for professional purposes. Emphasis is placed on creating content for different media platforms, working in teams, and managing writing projects.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take ENGL 206, ENGL 207, or ENGL 212 for credit."
    },
    {
        "title": "ENGL 397 Writing for Business",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 213. Enrolment in the Minor in Professional Writing is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course examines strategies for communicating information in business contexts. Practice includes audience analysis and visual design in the creation of such business documents as letters, memos, minutes, brochures, press releases, and company newsletters.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take ENGL 206, ENGL 207, or ENGL 212 for credit."
    },
    {
        "title": "ENGL 398 Selected Topics in English",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "ENGL 3999 Selected Topics in Critical Theory",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 414 Literary Publishing and Editing",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 225 or ENGL 226 or ENGL 227. Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course explores the process of founding and operating small presses or magazines, and follows the creation of a book from manuscript to the marketplace. It includes accessing primary research materials; understanding how the writer and editor collaborate to arrive at the best possible literary text for publication; agents, copyright contracts and other essential issues for writers; understanding the parts of a book; the design and production values that make a good book; and the transition from print to digital.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 413 may not take this course for credit."
    },
    {
        "title": "ENGL 415 Literary Production: Curating and Archiving the Literary Event",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 225 or ENGL 226 or ENGL 227. Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course introduces contemporary modes of distributing literary production. Students conceive, implement, and manage all aspects of a reading series, including the development of a mandate, solicitation and review of materials, event organization, and the introduction of work online, verbally, and in print. Students also aid in the development and maintenance of a related blog and an archive of current and previous reading series.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under an ENGL 429 number may not take this course for credit."
    },
    {
        "title": "ENGL 417 Writing for Media",
        "credits": 6,
        "prerequisites": "The following course must be completed previously: ENGL 227 and at least one 300‑level creative writing class. Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course is a creative writing workshop in the composition and development of scripts for media that may include film, TV, video games and podcasts. In any given year, the course focus is determined by the instructor.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 411 may not take this course for credit."
    },
    {
        "title": "ENGL 4180 Digital Editing and Publishing",
        "credits": 3,
        "prerequisites": "The following course must be completed previously: ENGL 213. Enrolment in the Minor in Professional Writing is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This project-based course focuses on writing, editing, and managing content for a web-based magazine. Through hands-on experience, students learn the workflow of a digital publication environment. Building on professional writing skills including grammar, editing, and writing for diverse contexts, they produce and refine polished articles for an online publication.",
        "components": "Lecture",
        "notes": "Students who have received credit for this course may not subsequently take ENGL 206, ENGL 207, ENGL 210, or ENGL 212 for credit."
    },
    {
        "title": "ENGL 428 Advanced Studies in Creative Writing",
        "credits": 6,
        "prerequisites": "Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required. See current Undergraduate Class Schedule for specific workshop prerequisites.",
        "corequisites": "",
        "description": "This course is an advanced workshop intended for students who have completed at least six credits of workshops at the 300 or 400 level in an appropriate field. The subject and prerequisites for each year are found in the current Undergraduate Class Schedule. Submission of a brief portfolio may be required for admission.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 429 Advanced Studies in Creative Writing",
        "credits": 3,
        "prerequisites": "Enrolment in a Creative Writing program is required. If prerequisites are not satisfied, permission of the Department is required. See current Undergraduate Class Schedule for specific workshop prerequisites.",
        "corequisites": "",
        "description": "This course is an advanced workshop intended for students who have completed at least six credits of workshops at the 300 or 400 level in an appropriate field. The subject and prerequisites for each year are found in the current Undergraduate Class Schedule. Submission of a brief portfolio may be required for admission.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 430 Old English: Intensive Course",
        "credits": 6,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course provides a comprehensive introduction to the Old English language, covering the fundamental aspects of grammar and studying major works of Old English poetry and prose.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 4320 Middle English",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This course studies the dialects of English appearing in texts dated between 1200 and 1500 CE. Linguistic studies of this key period in the history of the English language may also inform studies of historical topics, themes, and/or literary genres of the time.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 432 may not take this course for credit."
    },
    {
        "title": "ENGL 434 Advanced Topics in Medieval Literature",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 437 Advanced Topics in Renaissance Literature",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 441 Advanced Topics in 18th-Century Literature",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 443 Advanced Topics in 19th-Century Literature",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 444 Advanced Topics in Gender and Sexuality Studies",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": "Students who have received credit for ENGL 445 may not take this course for credit."
    },
    {
        "title": "ENGL 446 Advanced Topics in 20th-Century Literature",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 447 Advanced Topics in Critical Theory",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 4480 Advanced Topics in Environmental Humanities",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 4481 Advanced Topics in Literature and Media",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 4482 Advanced Topics in Critical Race Theory",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 4490 Advanced Topics in International Modernism",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 450 Advanced Topics in American Literature",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 453 Advanced Topics in Canadian Literature",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 454 Advanced Topics in Postcolonial Studies",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 4560 Advanced Topics in Decolonizing Theories and Literatures",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 4561 Advanced Topics in Indigenous Studies",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 470 Honours Seminar",
        "credits": 3,
        "prerequisites": "Students must complete 30 credits in English. Enrolment in the Honours English Literature is required.",
        "corequisites": "",
        "description": "The topic of this course varies from year to year. The course provides the opportunity for final‑year honours students to apply their experience of literature, literary theory, and criticism on a more advanced level.",
        "components": "Lecture",
        "notes": "In consultation with the honours/majors advisor, honours students may substitute another course at the 400 level for ENGL 470."
    },
    {
        "title": "ENGL 474 Honours Essay",
        "credits": 3,
        "prerequisites": "Students must complete 30 credits in English prior to enrolling. Enrolment in the Honours English Literature is required. Permission of the Department is required.",
        "corequisites": "",
        "description": "With the permission of the Department, an honours student may arrange a tutorial program with a faculty member, culminating in the writing of a long paper.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 480 Independent Studies",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling Enrolment in an English program is required. Permission of the Department is required.",
        "corequisites": "",
        "description": "With the permission of the Department, a student may arrange a tutorial program with a faculty member.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 490 Joint Seminar in History and English",
        "credits": 6,
        "prerequisites": "Students must complete 30 university credits prior to enrolling. Enrolment in the honours or specialization is required. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This upper-level seminar explores literary and historical approaches to a selected topic, which varies from year to year. The course offers a unique opportunity for students to explore how the different disciplines of English and History think about knowledge production under the collaborative guidance of scholars in these two fields.",
        "components": "Seminar",
        "notes": "Students who have received credit for HIST 4900 or for this topic under a HIST 498 number may not take this course for credit."
    },
    {
        "title": "ENGL 498 Advanced Topics in English",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "ENGL 4990 Advanced Topics, Major Author",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "ENGL 4991 Major Texts in Modern Thought",
        "credits": 3,
        "prerequisites": "Students must complete nine credits at the 300 level prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "Specific topics and prerequisites for this course are stated in the Undergraduate Class Schedule.",
        "components": "Lecture",
        "notes": null
    }
]