[
  {
    "title": "FPST 201 Introduction to First Peoples Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course introduces the guiding concepts central to First Peoples Studies at Concordia. These guiding concepts are often misunderstood by mainstream society. Themes include the Medicine Wheel as a structuring approach to course content and teaching/learning; worldviews; colonization and decolonization; First Peoples thought and knowledge; the diversity among First Peoples; and individual and community empowerment within First Peoples frames of reference. Principles and practices of dialogue and cross‑cultural communication are introduced. A key process goal of the course is for students to explore, with increasing skill and knowledge, their own motivations, positioning, and goals in relation to pursuing First Peoples Studies.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "FPST 202 Research Strategies in First Peoples Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course introduces basic concepts, practices, and issues for study and research consistent with the goals of First Peoples Studies, including the historical relation of First Peoples to academic research; ethical considerations; the social construction of knowledge, the influence of First Peoples thought, knowledge, and ways of knowing on the development of relevant contemporary research; basic steps of designing, carrying out, and presenting research within several contemporary models, including participatory research; constructive relations of people of other cultures to researching in the area; qualitative and quantitative research methods, including asking research questions; and basic skills of interviewing, as well as treating, analyzing and presenting interview data, within qualitative research.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "FPST 203 First Peoples of Canada",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course provides an introductory overview of knowledge related to the eleven cultural groups of First Peoples in Canada. It explores theories of migration, geographic location, cultural and linguistic diversity, historical socio‑economic and political systems as well as the relationships with the environment and traditional practices and beliefs. In‑depth focus is placed on representative nations within each group.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "FPST 210 Haudenosaunee Peoples",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course traces the history of the Haudenosaunee (Iroquois) from the period of the founding of the Confederacy to the present. With particular focus on the Kanien’kehaka (Mohawk) of Quebec, it includes discussion on the culture, language, and structure of Haudenosaunee society, the formation of the Haudenosaunee Confederacy, traditional philosophies such as the Kaienerekowa (Great Law of Peace) and the Code of Handsome Lake, Kanonsesro:non (people who adhere to the ways of the Longhouse), symbolism, as well as contemporary issues, including the impact of Euro‑Canadian government policies.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "FPST 211 Algonquian Peoples",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course explores the specific cultures of the Algonquian peoples of Canada with an emphasis on the peoples of Quebec (the Abenaki, the Algonquin, the Attikamek, the Cree, the Innu, the Malecite, the Mik’maq, and the Naskapi) and in particular the Eeyouch (the Cree Nations). From a historical perspective and using a sociological approach, this course examines social and political structures, gender‑defined roles, relationship with the environment, as well as spirituality and language. This course also examines changing roles and structures influenced by colonization, including the imposition of federal policies.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "FPST 212 Inuit Peoples",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course explores the specific cultures of the Inuit peoples in Canada with a particular emphasis on the Inuit people of Nunavik (Northern Quebec). The course examines social and political structures, gender‑defined roles, the Arctic way of life, the Inuit language and its dialects, as well as the spiritual beliefs of the Inuit. This course also examines changing roles and structures influenced by colonization, including the imposition of federal policies.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 297 Proseminar 1: Indigenous Ways of Knowing",
    "credits": 1,
    "prerequisites": "Registration in the BA Major in First Peoples Studies is required. Permission of the School is required.",
    "corequisites": "",
    "description": "This course examines how traditional knowledge continues to maintain relevance in the modern world. Students learn, both personally and professionally, how to work with, incorporate, and record indigenous knowledge.",
    "components": "Modular",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 298 Selected Topics in First Peoples Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 301 The Indian Act",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: FPST 201, FPST 202.",
    "corequisites": "",
    "description": "This course focuses on the Indian Act, with an emphasis on its impact on the First Peoples of Quebec. This includes discussion of the events leading up to its imposition, its implications for First Peoples cultures and societies, as well as related policies and other instruments of assimilation and colonization. Issues of accommodation and resistance are discussed. Effects of proposed changes to the Indian Act are analyzed and alternative solutions are explored.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "FPST 302 First Peoples and Education",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: FPST 201, FPST 202.",
    "corequisites": "",
    "description": "This course traces the history of the education of the First Peoples. It explores current issues in education, including educational approaches defined and implemented by First Peoples. Topics covered include traditional ways of learning and teaching. The issue of colonization, including early attempts at religious and linguistic conversion, as well as Canada’s residential school system and its continuing legacy, are discussed in depth.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "FPST 303 First Peoples and Health",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: FPST 201, FPST 202.",
    "corequisites": "",
    "description": "This course addresses First Peoples wellness philosophies and healing approaches in dealing with contemporary health problems. It draws significantly on historical perspectives of First Peoples mental, physical, spiritual, and emotional health issues, including pre‑contact health and environments, the introduction of alcohol and viral disease, as well as the emergence of lifestyle‑related diseases. Some of the current health issues to be explored include structural inequalities, institutional mistreatment, addictions, diabetes, HIV/AIDS, and mental health.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "FPST 306 Contemporary First Peoples Art",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: FPST 201, FPST 202.",
    "corequisites": "",
    "description": "This course provides an in‑depth examination of various artist traditions among First Peoples. Beginning in the post‑World War II era, topics covered include historical and contemporary trends and influences in artistic production, biopics of prominent artists, and issues surrounding museum collection and arts patronage by settlers/non‑autochtons. The lived experiences and realities of First Peoples will inform all topics examined in the course.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 310 Linguistic Introduction to Algonquian Languages",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course presents a general overview of the eight Algonquian languages spoken in Quebec, with special emphasis on the Cree language. The course introduces the student to basic vocabulary, different dialects and writing systems. It explores the basic components that make up Algonquian languages, including sounds, word composition, sentence structure and meaning. Other topics include linguistic interference from dominant languages, semantic shift and the use of language as a social tool. This course assists the student to recognize and value the social and cultural context of language.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "FPST 311 Linguistic Introduction to Haudenosaunee Languages",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course presents a general overview of the six Haudenosaunee (Iroquoian) languages, with special emphasis on Kanien’kehaka (the Mohawk language). The course introduces the student to basic vocabulary, different dialects and writing systems. It explores the basic components that make up Haudenosaunee languages including sounds, word composition, sentence structure and meaning. Other topics include linguistic interference from dominant languages. This course assists the student to recognize and value the social and cultural context of language.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 312 Linguistic Introduction to Inuktitut Language",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course presents a general overview of the Inuktitut language, with special emphasis on the dialect spoken in Nunavik (Northern Quebec). The course introduces the student to basic vocabulary, different dialects, and the syllabic writing system used by Inuit people. It explores the basic components that make up Inuktitut, including sounds, word composition, sentence structure and meaning. Other topics include linguistic interference from dominant languages. This course assists the student to recognize and value the social and cultural context of language.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 320 First Peoples and the Media",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course explores how First Peoples have been portrayed in selected media such as television, film, and advertising by looking at different representations in various industries such as advertising, sports, and tourism. This includes discussion on the relationship between media and First Peoples including the media’s impact on relations between the mainstream society and First Peoples. The social role of different forms of media as used by First Peoples in the process of empowerment is also discussed.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 321 First Peoples and Justice",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: FPST 301.",
    "corequisites": "",
    "description": "This course focuses on the relationship between First Peoples and the Canadian justice system. It looks specifically at how the Canadian legal, judicial, and penal system has dealt with First Peoples through time. The course also explores pre‑contact forms of justice, tensions between European and indigenous conceptions of justice, First Peoples response to Canadian justice, and the emergence of alternative, indigenous mechanisms of judicial administration within communities in Quebec and Canada.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 322 First Peoples and the Fur Trade",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course provides an in‑depth historical and sociological analysis of the impact of the fur trade on the First Peoples of Canada. Topics include the emergence of the fur trade, and fur‑trading companies’ dependence on First Peoples. Special emphasis is placed on changing demographics as a result of the fur trade, the increasing reliance on European goods, First Peoples entrepreneurial spirit, the birth of the Métis Nation, as well as the evolving political and economic role of women within fur‑trading society.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 323 First Peoples Sacred Stories",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: FPST 201 or FPST 203.",
    "corequisites": "",
    "description": "Through storytelling, reading, discussion, and writing, this course explores themes of fundamental human concern for First Peoples. It considers oral traditions as integral to broader, culturally defined systems of knowledge and explores the role of sacred stories in traditional and contemporary societies. This includes discussion on the role of stories as vehicles for encoding and transmitting knowledge about the people, the environment, the culture and history. Stories analyzed include creation stories, trickster tales, oral historical accounts, and stories relating to natural phenomena.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "FPST 341 Globalization and Indigenous Peoples",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course explores the situation of First Peoples across the world from a comparative indigenous perspective. The primary aim of the course is to familiarize students with the similarities and differences between indigenous cultures and nations within the context of global colonialism past and present.",
    "components": "Lecture",
    "notes": "Students who have received credit for ANTH 303 or SOCI 303 may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "FPST 397 Proseminar 2: Ethics and First Peoples",
    "credits": 1,
    "prerequisites": "Registration in the BA Major in First Peoples Studies is required. Permission of the School is required.",
    "corequisites": "",
    "description": "This course examines ethical issues pertaining to First Peoples from traditional and non‑traditional perspectives. In addition to addressing community/research conflict and co‑operation, concerns of insider/outsider research and cultural considerations in conducting research are also studied.",
    "components": "Modular",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "FPST 398 Special Topics in First Peoples Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 401 Contemporary Politics in First Peoples Communities",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: FPST 301. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course focuses on First Peoples politics in the Quebec and Canadian contexts. It explores more specifically the emergence and actions of First Peoples political organizations over the past 40 years, First Peoples relationships with successive federal and provincial governments, movements of national self‑affirmation, and the nature of the political interface between competing groups inside First Peoples communities.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "FPST 402 First Peoples Contemporary Social Issues",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: FPST 302, FPST 303. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course addresses contemporary social issues and challenges faced by First Peoples. It analyzes the underlying causes of issues such as poverty, lack of formal education, isolation, alcohol and substance abuse, family violence and sexual abuse. The course also examines current healing approaches and programs used to deal with these issues, and fosters discussion on possible alternatives.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "FPST 406 Decolonizing First Peoples Art",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: FPST 306. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course examines First Peoples artistic contributions within the context of decolonizing indigenous art globally. Topics explored highlight the relationship between culture, society, politics and visual art that illustrate art as part of the anticolonial resistance by First Peoples as well as the role of museums and exhibitions in fictioning national identities.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 410 First Peoples Community Development",
    "credits": 3,
    "prerequisites": "The following course must be completed previously or concurrently: FPST 401. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course examines the concepts and experiences of community development among First Peoples, with an emphasis on Quebec. Selected community development models, their goals, processes, and means of evaluation, are analyzed. The course introduces students to analytical and practical skills in context‑sensitive community development guided by First Peoples thought and knowledge. Students explore dynamics of nourishing community participation and leadership, as well as analyze community structures and inter‑group relations within communities. Reference is made to on‑reserve, urban, rural, and northern contexts. Ethical considerations are discussed. This course includes analysis of case studies.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 411 First Peoples Treaties and Agreements",
    "credits": 3,
    "prerequisites": "The following course must be completed previously or concurrently: FPST 401. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course explores the contemporary issues associated with treaties and indigenous land claims agreements. Emphasis is placed on selected historically significant treaties between the First Peoples, and those between the First Peoples and the Europeans. The original intent and framework of treaties and agreements, the negotiation processes involved, and the implementation of treaties and modern agreements are also discussed.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 412 First Peoples and Governance",
    "credits": 3,
    "prerequisites": "The following course must be completed previously or concurrently: FPST 401. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course examines the political and administrative mechanisms which First Peoples use to arbitrate competing interests, manage conflict, and formulate policies in their communities across Quebec and Canada. The course analyzes political and administrative institutions inherited from the Indian Act, as well as governance strategies developed in conformity with First Peoples traditions and in resistance to the Canadian state’s institutional dominion. The course also explores the tensions created by the coexistence of European and indigenous modes of governance within and outside First Peoples communities.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 413 First Peoples International Relations and Diplomacy",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: FPST 321. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course focuses on the actions and interventions of various First Peoples on the international scene, both in the past and in the present. The course’s primary aim is to explore the reasons why First Peoples have resorted to international forums and institutions, how they conduct their international action and whether in the end international diplomacy works to their advantage.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 414 First Peoples Rights Movements",
    "credits": 3,
    "prerequisites": "The following course must be completed previously or concurrently: FPST 401 and FPST 402. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course focuses on the many historical and contemporary forms of First Peoples resistance to colonization, including violent and non-violent resistance, revitalization movements and self-determination. It explores liberation theory and its roots in colonial oppression and analyzes historical and contemporary resistance movements such as the confrontation at Kanehsatake (Oka) and Esgenoopetitj (Burnt Church) and the movement for decolonization through self-determination.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 415 Indigenous Identity and Nationalism",
    "credits": 3,
    "prerequisites": "The following course must be completed previously or concurrently: FPST 401. If prerequisites are not satisfied, permission of the School is required.",
    "corequisites": "",
    "description": "This course explores the political and ideological ramifications of the expression of indigenous identity. It focuses on the emergence of First Peoples nationalist movements, compares them with non-Aboriginal nationalisms, and examines the nature and conceptual foundations of the indigenous sense of nation. Attention is devoted to the political efficiency of indigenous nationalism in its interface with the Canadian and Quebec states. Case studies particularly emphasize Kanien’kehaka and Eeyou nationalisms.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 490 Aboriginal Community Economic Development I",
    "credits": 3,
    "prerequisites": "Students must have completed 60 credits prior to enrolling. Enrolment in the BA Major in First Peoples Studies is required. Permission of the School is required.",
    "corequisites": "",
    "description": "This course assists participants in exploring specific issues related to Aboriginal economic development in particular settings (in reserve, urban, rural, and northern communities), as well as addressing challenges common to Aboriginal CED. It assists participants in exploring historical and contemporary relationships between Aboriginal communities and the predominant cultural and economic forces, and comparing traditional Aboriginal organizational and economic practices with the new approaches being proposed by CED.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "summer"
    ]
  },
  {
    "title": "FPST 491 Aboriginal Community Economic Development II",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: FPST 490. If prerequisites are not satisfied permission of the School is required.",
    "corequisites": "",
    "description": "This course uses a case study approach to evaluate one or more economic development strategies applied within an Aboriginal community. An historical overview of this experience outlines the cultural and political context which has shaped these strategies as well as their results. CED approaches are examined in the context of this individual experience. This course may include on‑site visits and guest lecturers.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "FPST 497 Proseminar 3: Oral Traditions as Methodology",
    "credits": 1,
    "prerequisites": "Registration in the BA Major in First Peoples Studies is required. Permission of the School is required.",
    "corequisites": "",
    "description": "This course explores the validity and importance of oral traditions as a way to comprehend First Peoples knowledge and its continued relevance in the modern world.",
    "components": "Modular",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "FPST 498 Advanced Topics in First Peoples Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and relevant prerequisites, are stated in the Undergraduate Class Schedule.",
    "components": null,
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  }
]