[
  {
    "title": "BIOL 200 Fundamentals of Human Biology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "A series of lectures, demonstrations, and seminars to provide non‑biologists with a general survey of the fundamental principles of life, with special emphasis on the structures and functions of human beings.",
    "components": "Lecture",
    "notes": "Students registered in a Biology or Biochemistry program may not take this course for credit. Students who have completed Cegep Biology 921/931 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 201 Introductory Biology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Fundamentals of plant and animal biology: basic physics and chemistry of life; cell and tissue structures and functions; anatomy and physiology of human systems; survey of plant and animal taxonomy, ecology, heredity, and evolution.",
    "components": "Lecture; Laboratory",
    "notes": "Students entering BIOL programs without Cegep Biology 301 or equivalent must take this course, but not for program credit.Students with Cegep Biology 301 or equivalent may not take this course for credit.",
    "offeredIn": [
      "fall",
      "summer",
      "winter"
    ]
  },
  {
    "title": "BIOL 202 General Biology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course presents the fundamentals of biology including the basic physics and chemistry of life, the structure and functions of cell and tissues, and aspects of anatomy, physiology, taxonomy, heredity and evolution, with examples ranging from micro‑organisms to humans.",
    "components": "Lecture",
    "notes": "Students enrolled in BSc programs may not take this course for credit.Students with Cegep Biology 301, 101‑NYA or BIOL 201 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 203 Fundamental Nutrition",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course deals with food composition (carbohydrates, lipids, proteins, vitamins, and minerals), its absorption and utilization, energy balance, special diets, and food technology.",
    "components": "Lecture",
    "notes": "Students registered in a Biology or Biochemistry program may not take this course for credit.",
    "offeredIn": [
      "fall",
      "summer",
      "winter"
    ]
  },
  {
    "title": "BIOL 205 Introduction to Sustainability",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course begins with an introduction to the science of ecology and to the concept of sustainability as an ecological principle. The concept of sustainability is then broadened to include humans, as students are introduced to ethics, economics, and resource management from an eco‑centric point of view. Students are encouraged to think critically about current environmental problems and to take action on an individual project.",
    "components": "Lecture",
    "notes": "Students registered in a Biology program may not take this course for program credit.Students who have received credit for BIOL 208, LOYC 205 or for this topic under a BIOL 298 number may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 206 Elementary Genetics",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "A survey of classical and contemporary developments in the study of heredity, with particular attention to human examples. This course is open to the general student body.",
    "components": "Lecture",
    "notes": "Students transferring into a Biology program may retain degree credit for this course.Students who have received credit for BIOL 261 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 225 Form and Function of Organisms",
    "credits": 3,
    "prerequisites": "Cegep Biology 301 or 101‑NYA or BIOL 201.",
    "corequisites": "",
    "description": "An introduction to plant and animal form and function is presented. This course provides an overview of basic physiological and morphological aspects of plants and animals that allow survival and reproduction. Topics in animal biology include animal architecture, internal fluids, homeostasis, digestion and nutrition, nervous and chemical coordination; topics in plant biology include plant organization, photosynthesis, respiration, water relations, and growth regulation. Reproduction and development of both plants and animals are introduced.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 226 Biodiversity and Ecology",
    "credits": 3,
    "prerequisites": "Cegep Biology 301 or 101‑NYA or BIOL 201.",
    "corequisites": "",
    "description": "This course introduces the evolution, biodiversity, and ecology of organisms. The origin and diversity of life, from prokaryotes, through simple eukaryotes to multi‑cellular organisms are introduced. Natural selection, speciation, and phylogeny, stressing evolutionary relationships in conjunction with changing conditions on earth, are presented. The course introduces major concepts in ecology: the physical and chemical environment, population structure, life histories, species interactions, communities, and ecosystems.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 227 Laboratory Studies in Biodiversity",
    "credits": 3,
    "prerequisites": "BIOL 225",
    "corequisites": "BIOL 226",
    "description": "This course reviews the diversity of organisms and introduces methods used in their study. The tutorials focus on key evolutionary mechanisms associated with organism diversity, model organisms that illustrate it and phylogenies that integrate diversity. The laboratory exercises are in basic protocols and may include bacterial classification; the structural diversity of protists; reproductive diversity among fungi; invertebrate internal morphology and behaviour; arthropod and mollusk classification; exercises in vertebrate homology; and studies on plant structure, development and physiology.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 261 Molecular and General Genetics",
    "credits": 3,
    "prerequisites": "Cegep Biology 301 or 101‑NYA or BIOL 201; 202 NYA or CHEM 205; 202‑NYB or CHEM 206.",
    "corequisites": "",
    "description": "Basic genetic principles, including mechanisms of meiosis and mitosis, Mendelian genetics, recombination, gene mapping, and chromosome rearrangements; an introduction to molecular genetics, including nucleic acid structure and biosynthesis transcription and translation; the course also includes an introduction to recombinant DNA technology and to concepts of population genetics.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 266 Cell Biology",
    "credits": 3,
    "prerequisites": "Cegep Biology 301 or 101‑NYA or BIOL 201; 202‑NYA or CHEM 205; 202‑NYB or CHEM 206.",
    "corequisites": "",
    "description": "Structure and functions of the cell and its organelles: cytoskeleton, chromosomes, cell cycle and cell division, organelle biogenesis, molecular motors, trafficking of proteins and membranes, signal transduction, trans‑membrane transport, cancer, apoptosis.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 298 Selected Topics in Biology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "BIOL 321 Evolution",
    "credits": 3,
    "prerequisites": "BIOL 225, BIOL 226.",
    "corequisites": "",
    "description": "Through readings, discussions, and lectures, students explore the evidence for evolution, as well as current theories for the mechanisms that cause evolutionary change. Topics covered include principles of inheritance and variation, adaptation through natural selection, random processes in evolution, and the role of molecular and macroevolutionary processes in shaping current patterns of biodiversity.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 322 Biostatistics",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines statistical methods for the biological sciences; experimental design; data description; binomial, Poisson and Normal distributions; statistical inference; hypothesis testing; chi‑square; one and two sample tests of the mean; analysis of variance including 2‑way and nested ANOVAs; correlation; regression; and analogous non‑parametric techniques.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for COMM 215, ECON 222, GEOG 362, MAST 333, PSYC 316, SOCI 213 or STAT 250 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 330 Vertebrate Biology",
    "credits": 3,
    "prerequisites": "BIOL 225, BIOL 226.",
    "corequisites": "",
    "description": "This course explores how the anatomy, physiology, life history, ecology and behaviour of vertebrates interact to generate animals that function effectively in their environments, and how different vertebrate groups have evolved over the past few hundred million years. Major vertebrate groups discussed are cartilaginous fishes, bony fishes, amphibians, reptiles, birds and mammals. Other special topics on vertebrate biology considered include the role of ecology in vertebrate speciation, vertebrate adaptations to extreme environments, seasonal migrations, human evolution, as well as conservation issues facing different vertebrate groups worldwide.",
    "components": "Lecture",
    "notes": "Students who have received credit for BIOL 387 may not take this course for credit.",
    "offeredIn": [
      "summer",
      "winter"
    ]
  },
  {
    "title": "BIOL 337 Invertebrate Biology",
    "credits": 3,
    "prerequisites": "BIOL 225, BIOL 226, BIOL 227.",
    "corequisites": "",
    "description": "This course surveys the diversity of invertebrates and their functional systems, emphasizing the basic themes that define each phylum and those that are common to all animals. The course focuses on evolution, life histories, physiology, and anatomy of the major phyla and the diversity of the minor phyla.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for this topic under a BIOL 398 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 340 Plant Biology",
    "credits": 3,
    "prerequisites": "BIOL 225, BIOL 226.",
    "corequisites": "",
    "description": "This course surveys the biology of the plant kingdom. Topics include the evolution of the major groups and a comparative analysis of the form (anatomy), function (physiology), and life history of plants. Examples from the local flora are emphasized.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 350 The Ecology of Individuals",
    "credits": 3,
    "prerequisites": "BIOL 225, BIOL 226.",
    "corequisites": "",
    "description": "This course is designed to introduce students to the diversity of adaptations possessed by individuals which enables them to interact successfully with the abiotic and biotic environment. Major topics include responses to temperature, water, gas exchange, light, and other species. In addition, sensory ecology and escape in time and space are covered. Physiological adaptations are emphasized.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "BIOL 351 Basic Population Ecology",
    "credits": 3,
    "prerequisites": "BIOL 226.",
    "corequisites": "",
    "description": "This course introduces the processes which determine the distribution and abundance of individuals in populations. Population growth, density‑dependent and density‑independent population regulation, survivorship, life history parameters, the population dynamics of competition, predation and parasitism, and the roles of predation and competition in affecting community structure are discussed.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 353 Communities and Ecosystems",
    "credits": 3,
    "prerequisites": "BIOL 225, BIOL 226.",
    "corequisites": "",
    "description": "This course presents an introduction to biological communities, the processes that maintain them and their emergent properties. Topics include the interactions between abiotic and biotic factors in determining community composition, the concepts of niche and habitat, succession theory, community diversity and stability, energy flow and nutrient cycling. Examples emphasize both aquatic and terrestrial ecosystems, and the major global biomes.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 354 Behavioural Ecology",
    "credits": 3,
    "prerequisites": "BIOL 226.",
    "corequisites": "",
    "description": "Behavioural ecology is the study of behavioural adaptation. The topics include foraging, anti‑predator, fighting, mating, reproductive and social behaviour. Students are introduced to optimality and game theories.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 364 Cell Physiology",
    "credits": 3,
    "prerequisites": "BIOL 266; CHEM 271.",
    "corequisites": "",
    "description": "This course covers general and specialized processes at the molecular and cellular level in eukaryotes and prokaryotes; protein folding and degradation, signalling by nerves, bioenergetics (respiration and photosynthesis), cell motility, muscle contraction, eukaryotic cilia and flagella, sensory perception, and fundamental immunology.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 366 Mechanisms of Development",
    "credits": 3,
    "prerequisites": "BIOL 261, BIOL 266.",
    "corequisites": "",
    "description": "This course explores the mechanisms of cellular interactions and genetic control that govern cell differentiation and development in a range of organisms, from simple model systems to mammals. Specific questions address how cell movement and cell recognition take place, how the genome is restricted in differentiation, how cytoplasmic signals influence differentiation, how gradients affect development, how genes control segmentation, and how growth factors and hormones influence development. The role of genetic engineering in the understanding of developmental processes is discussed. The course is based on gaining an understanding of the basic concepts, mechanisms, and experimental tools used in developmental research.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 367 Molecular Biology",
    "credits": 3,
    "prerequisites": "BIOL 261; CHEM 271.",
    "corequisites": "",
    "description": "This course examines DNA structure, recombinant DNA methodologies, gene structure, transcriptional and post‑transcriptional regulation, RNA processing events, translation, chromatin modification, chromatin remodelling and DNA replication. The experimental evidence supporting these concepts is also discussed.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 368 Genetics and Cell Biology Laboratory",
    "credits": 3,
    "prerequisites": "BIOL 261, BIOL 266; CHEM 212 or CHEM 217 or BIOL 227.",
    "corequisites": "",
    "description": "This course introduces students to the basic laboratory techniques of cell biology, microbiology, bacterial genetics, and molecular biology. Experiments include cell membrane functions in red blood cells, bacterial identification, mutagenesis, genetic transformation, gene mapping, DNA isolation and recombinant DNA techniques. Through tutorials, students learn the theory behind techniques and their use in research. Special focus is placed on lab manipulation skill, data organization, and data interpretation.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 371 Microbiology",
    "credits": 3,
    "prerequisites": "six credits chosen from BIOL 226, BIOL 261, CHEM 271. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course provides an in‑depth study of the structure and function of microbes. It emphasizes the genetic and biochemical characteristics of microbes which distinguish them from plants and animals. Consideration is also given to the impact of microbes on the global environment and on the quality of human life.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 380 Nutrition",
    "credits": 3,
    "prerequisites": "CHEM 221, CHEM 271.",
    "corequisites": "",
    "description": "The concept of a balanced diet is studied in relation to caloric content and to protein, lipid, carbohydrate, vitamin, and mineral requirements. The consequences of dietary deficiencies are examined. Special topics such as dieting, organic foods, vitamins, food additives, and toxins are discussed.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "summer"
    ]
  },
  {
    "title": "BIOL 382 Comparative Animal Physiology",
    "credits": 3,
    "prerequisites": "BIOL 225, BIOL 226, BIOL 266.",
    "corequisites": "",
    "description": "This course offers a comparative analysis of physiological processes across diverse animal groups at the cellular and systems levels. Topics include endocrinology, muscle contraction, sensory integration, nervous systems, respiration, digestion, and circulation.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 385 Entomology",
    "credits": 3,
    "prerequisites": "BIOL 225",
    "corequisites": "BIOL 226",
    "description": "This course introduces the student to the variety and complexity of insect life. Basic classification is followed by a more detailed study of morphology and anatomy, together with some physiological considerations. Other topics such as adaptations for aquatic life and social behaviour are discussed. Laboratories include the identification of insects collected by students, as well as structured laboratory sessions which complement the lectures.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "BIOL 398 Intermediate Topics in Biology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
    "components": null,
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 421 Philosophical Foundations of Biology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course helps students critically engage biology’s philosophical foundations. Topics typically include the nature of scientific reasoning, testing, and evidence in biology; how best to discover, define, and apply biological concepts; and how to structure the aims of biology to fit our diverse and changing societies.",
    "components": "Lecture",
    "notes": "Students who have received credit for PHIL 441 may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 422 Advanced Statistics for Biological Sciences",
    "credits": 3,
    "prerequisites": "BIOL 322. Students must be within 45 credits of graduating with a BSc in a Department of Biology honours or specialization.",
    "corequisites": "",
    "description": "This course presents, explains and provides practice with modern statistical tools applied to biological sciences for data exploration and hypotheses testing. The course provides students with the theoretical and practical knowledge to decide which techniques are best suited for particular biological problems, to report statistical results in an effective manner, and to apply their understanding to new biological questions. Examples and applications are drawn from a wide range of biological fields including ecology, epidemiology, genetics, molecular biology and genomics.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for this topic under a BIOL 498 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 443 Plant Molecular Genetics",
    "credits": 3,
    "prerequisites": "BIOL 367.",
    "corequisites": "",
    "description": "This course covers a survey of specialized topics in plant molecular genetics including plant disease resistance, flower induction, signal transduction, bioinformatics and genetically modified organisms (GMOs) which have strongly influenced plant improvement in modern agriculture through genetic engineering.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 450 Techniques in Ecology",
    "credits": 3,
    "prerequisites": "BIOL 227, BIOL 322 or equivalent, and a minimum of six credits from BIOL 321, BIOL 350, BIOL 351, BIOL 353, BIOL 354.",
    "corequisites": "",
    "description": "This course introduces students to a variety of techniques of experimental design, data collection, and quantitative analysis. Students participate in a series of modules, each of which presents experimental and analytical techniques appropriate for one area of modern research in ecology, behaviour, or evolution. Some modules require students to collect and subsequently analyze original data from field or laboratory settings. Modules and their contents may vary from year to year.",
    "components": "Tutorial; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 451 Field Ecology",
    "credits": 3,
    "prerequisites": "BIOL 322 or equivalent, and BIOL 353.",
    "corequisites": "",
    "description": "This course is designed to give students practical experience working with field‑based community ecology. It involves one or two weeks of fieldwork in a research station (mandatory sleepover), followed by weekly meetings during the fall term. Students learn about sampling methods, experimental design, and statistical tools with the aim of estimating and comparing patterns of biological diversity. Students design and implement their own short study in the field. In the weekly meetings, students process samples collected in the field, perform analysis, present their results in the form of oral presentation as well as written assignment. Students reside in a field station during the field‑based portion of the course. They are expected to cover the cost of room and board, and other necessary fees. The location and cost of the fieldwork may change from year to year. Interested students must contact the instructor to obtain detailed information.",
    "components": "Tutorial",
    "notes": null,
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 452 Population and Conservation Genetics",
    "credits": 3,
    "prerequisites": "BIOL 261; and three credits chosen from BIOL 321, BIOL 351, BIOL 353, BIOL 367.",
    "corequisites": "",
    "description": "Conservation genetics employ the principles of population genetics and systematics to address problems related to conservation of biodiversity. This course examines the main factors that affect genetic variation within and among populations, including natural selection, random genetic drift, mutation and gene flow. The impact of human activities on levels and patterns of genetic variation in both plant and animal communities is discussed. The utility of molecular markers in determining conservation units is examined. Several case studies from the current literature are used to illustrate the many applications of modern molecular techniques in conservation genetics. The course comprises lectures, student presentations, and use of software in genetic data analysis.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 457 Conservation Biology",
    "credits": 3,
    "prerequisites": "A minimum of nine credits chosen from BIOL 321, BIOL 350, BIOL 351, BIOL 353, BIOL 354.",
    "corequisites": "",
    "description": "This course introduces students to the scientific principles of conservation biology, an interdisciplinary science which aims at identifying and managing environmental problems. Topics may include pollution, climate change, farming, renewable resources, designing nature reserves and conserving biodiversity. Course assignments emphasize effective scientific communication, collaboration and problem‑solving skills.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 459 Aquatic Ecology",
    "credits": 3,
    "prerequisites": "BIOL 322 or equivalent, BIOL 353.",
    "corequisites": "",
    "description": "The course begins with the molecular structure of water and its relationship to life in aquatic ecosystems. Lectures deal with primary and secondary production in streams, lakes, oceans and estuaries. The role of fish in aquatic communities is introduced in the second half of the course and is the subject of a field trip.",
    "components": "Lecture; Laboratory; Field Studies",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "BIOL 461 Advanced Genetics",
    "credits": 3,
    "prerequisites": "BIOL 367.",
    "corequisites": "",
    "description": "Through lectures and directed readings in classical and contemporary genetics, students are exposed to research literature and problems in this area. Students probe in greater depth areas of particular interest in order to develop a critical sense and deepen an understanding of past and current work in this field.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 462 Immunology",
    "credits": 3,
    "prerequisites": "BIOL 266, BIOL 364, BIOL 367.",
    "corequisites": "",
    "description": "The role of the immune system in maintenance of body homeostasis is presented with particular reference to cells and tissues of the immune system, their organization as well as their structural and functional relationships. Topics include: maturation and differentiation of B and T lymphocytes; structure and properties of antibodies; immune responses to antigens; genetic aspects of anti‑body synthesis; immunological considerations in AIDS, cancer, and autoimmune diseases.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 463 Comparative Genomics and Genome Evolution",
    "credits": 3,
    "prerequisites": "BIOL 367.",
    "corequisites": "",
    "description": "This course covers modern comparative genomics including the nature and scope of the various genome projects, gene discovery and data mining, molecular phylogenies, origin of the eukaryotic cell, evolution of gene regulatory networks, concerted evolution, and haplotype mapping.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a BIOL 498 number may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "BIOL 466 Advanced Techniques in Molecular Biology",
    "credits": 3,
    "prerequisites": "BIOL 367, BIOL 368.",
    "corequisites": "",
    "description": "This course covers the theory and practice of modern experimental procedures in molecular biology, including use of restriction enzymes, gene cloning and hybridizations, DNA sequencing, site‑directed mutagenesis, RT‑PCR, and yeast two‑hybrid analysis.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "BIOL 467 Advanced Cell Biology",
    "credits": 3,
    "prerequisites": "BIOL 266, BIOL 364.",
    "corequisites": "",
    "description": "This course examines selected topics in cell and molecular biology including the growth and division of differentiated and non‑differentiated eukaryotic cells. The focus is on the control of cell cycling under normal and abnormal states, such as cancer and viral infection.",
    "components": "Lecture",
    "notes": "Students who have received credit for BIOL 464 or this topic under a BIOL 498 number may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 468 Gene Structure",
    "credits": 3,
    "prerequisites": "BIOL 367.",
    "corequisites": "",
    "description": "This course covers fundamental principles and essential concepts underlying the present understanding of gene expression in eukaryotes. Topics may include the role of RNA transcription, RNA localization, RNA transport and microRNAs in eukaryotic gene regulation; the role of DNA methylation, alternative splicing, the histone code and chromatin remodelling in genomic imprinting and epigenetics; and large scale approaches to understanding gene expression such as high throughput sequencing methods, genome wide profiling of mRNA expression, proteomics, and CHIP and CHIP‑CHIP analysis.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "BIOL 472 Virology",
    "credits": 3,
    "prerequisites": "BIOL 266, BIOL 367.",
    "corequisites": "",
    "description": "The life cycles of viruses are discussed with emphasis on the molecular basis of their entry into, reproduction in, and exit from host cells. These life cycles are related to the pathogenicity of different groups of viruses to provide an understanding of the variety of viral diseases.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a BIOL 498 number may not take this course for credit.",
    "offeredIn": [
      "summer"
    ]
  },
  {
    "title": "BIOL 473 Environmental Microbiology",
    "credits": 3,
    "prerequisites": "BIOL 371 or BIOL 353.",
    "corequisites": "",
    "description": "This course surveys microbial diversity and ecophysiology with emphasis on how the activities and interactions of individual organisms influence Earth systems at the ecosystem scale. Topics may include the origin and evolution of the biosphere, microbial interactions and ecosystems, nutrient cycling, molecular and genomic methods in environmental microbiology, microbial associations with plants and animals, and the application of microorganisms to environmental sustainability and bioremediation, human welfare, health, and biotechnology.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a BIOL 498 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 474 Cellular Neuroscience",
    "credits": 3,
    "prerequisites": "BIOL 364.",
    "corequisites": "",
    "description": "This course familiarizes students with current theory and research in cellular neuroscience through student presentations and discussions of original scientific literature. Topics include neural circuitry, brain genomics, neuronal structure, synaptic plasticity, neurotransmission, and molecular basis of neurological disease.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a BIOL 498 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 475 Biological Computing and Synthetic Biology",
    "credits": 3,
    "prerequisites": "BIOL 367.",
    "corequisites": "",
    "description": "This is an interdisciplinary course offered to students who are either in Biology or Electrical and Computer Engineering programs. Students are introduced to the emerging field of synthetic biology and learn to design computational machines that can be implemented in biological media. The term is divided into two phases. In Phase I, Biology students learn basic computer hardware and software concepts, while Engineering students are introduced to gene structure and recombinant DNA technology. In Phase II, all students learn the principles and various applications of cell‑based computational machines. Students work in teams to create a project proposal to describe the design of a computational machine using gene regulatory networks.",
    "components": "Lecture",
    "notes": "Students who have received credit for COEN 433 or for this topic under a BIOL 498 number may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 476 Microfluidic Devices for Synthetic Biology",
    "credits": 3,
    "prerequisites": "BIOL 367.",
    "corequisites": "",
    "description": "Students are introduced to microfluidic components (pumps, valves, automation), programming microfluidics, paradigms, and applications for chemical and biological analysis. Introduction to synthetic biology; biological parts and their properties, network structure and pathway engineering, synthetic networks, manipulating DNA and measuring responses, basic behaviour of genetic circuits, building complex genetic networks; integration of microfluidics and synthetic biology; economic implications.",
    "components": "Lecture 3 hours per week",
    "notes": "Students who have received credit for COEN 434 or for this topic under a BIOL 498 number may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 479 Computational Biology",
    "credits": 3,
    "prerequisites": "BIOL 261; COMP 352.",
    "corequisites": "",
    "description": "In this course, students are introduced to the fundamental computational and statistical techniques used to address problems from biology and the life sciences. Students are introduced to dynamic programming for pairwise and multiple sequence alignment, enrichment statistics for biological pathway analysis, statistical classification for predicting clinical end‑points including patient prognosis in breast cancer, Hidden Markov Models (HMM) used to predict the locations of genes in a genome, and probabilistic models for detecting mutations in next generation sequencing data. The lectures are supplemented by programming and analytic exercises to implement these statistical and computational frameworks.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "BIOL 480 Bioinformatics",
    "credits": 3,
    "prerequisites": "BIOL 367. Students must be within 30 credits of graduating with a BSc in a Department of Biology honours or specialization program. Permission of the Department is required.",
    "corequisites": "",
    "description": "This course provides students from Biology with instruction in the basic techniques of bioinformatics, computational biology and biological data science. There are three major goals. The first goal is to introduce common bioinformatic software, databases and tools for analyzing molecular data. The second is to provide students with methods from computational biology to test hypotheses using programming techniques. The third is to provide an introduction to methods from data science for exploring large biological data sets using visualization, statistics and machine learning.",
    "components": "Lecture; Laboratory",
    "notes": "This is primarily a graduate course with a limited number of places for undergraduate students depending upon availability.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 481 Genome Structure",
    "credits": 3,
    "prerequisites": "BIOL 367. Permission of the Department is required.",
    "corequisites": "",
    "description": "This course provides an overview of genome analysis including cloning systems; sequencing strategies; methods of detecting genes and approaches to mapping genomes. It covers the theory and design of the different approaches, and the analysis of genomic data generated from them.",
    "components": "Lecture",
    "notes": "This is primarily a graduate course with a limited number of places for undergraduate students depending upon availability.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 482 Functional Genomics",
    "credits": 3,
    "prerequisites": "BIOL 367. Permission of the Department is required.",
    "corequisites": "",
    "description": "This course focuses on the functional analysis of expressed genes and their products. Course content includes transcription profiling using microarrays and RNA‑Seq, systematic identification of proteins using mass spectrometry, functional analysis by gene knock‑outs, localization of gene products by gene knock‑ins, recombinant protein synthesis and protein‑protein interactions using affinity co‑purification and protein complementation assays.",
    "components": "Lecture",
    "notes": "This is primarily a graduate course with a limited number of places for undergraduate students depending upon availability.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "BIOL 487 Capstone Seminar in Environmental Science",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "The course is designed to integrate the knowledge from several courses and provide students an opportunity to apply this knowledge to a current issue in environmental sciences through experiential learning. Students work in small groups made up from participants of all streams and critically evaluate an environmental issue using the expertise of all participants. Examples could be the reclamation of a former mining site, plans for expansion of a landfill or plans for a new water treatment plant. Aspects evaluated include, but are not limited to, land use, impact on vegetation and biota, availability of critical chemical data (e.g. trace metals, water/runoff quality, and impact on the local population). The result is a detailed environmental assessment report prepared by students.",
    "components": "Seminar",
    "notes": "Students who have received credit for CHEM 487 or GEOG 487 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "BIOL 490 Independent Study",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "In this course, the student undertakes a special research project selected in consultation with, and conducted under, the supervision of a faculty member of the Department. The project is intended to develop the student’s knowledge of standard scientific procedures, including methods of researching scientific literature, the planning and execution of experimental and analytical procedures, the writing of a formal report, and the presentation of a seminar on the project.",
    "components": "Lecture",
    "notes": "Work in this course must be carried out over two consecutive terms: either the summer session and fall term or fall term and winter term.",
    "offeredIn": []
  },
  {
    "title": "BIOL 493 Computational Biology Team Project",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "Students form teams or join existing teams (such as those in research labs) and work under faculty supervision to solve a computational biology research problem or to carry out a computational biology research project. The research problem or project involves the utilization of knowledge of biology and of computing, involves computing lab and/or wet lab practice and contributes to any of the areas of computational biology. The project fosters teamwork and allows students to develop their project management, technical writing and oral presentation skills. Notes:Students who have received credit for COMP 493 may not take this course for credit.",
    "components": null,
    "notes": "Students who have received credit for COMP 493 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "BIOL 498 Advanced Topics in Biology",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
    "components": null,
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  }
]