[
    {
        "title": "PHYS 200 Frontiers in Physics – Without Mathematics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is a non-mathematical introduction to cutting-edge physics. Topics may include quantum mechanics, Einstein’s theory of relativity, cosmology, and particle physics. Students investigate fundamental concepts in physics along with cutting-edge applications like quantum computing and biomedical imaging. Current physics publications and resources, as well as careers involving physics, are discussed.",
        "components": "Lecture",
        "notes": "Students registered in a Physics program may not take this course for credit towards their degree requirements."
    },
    {
        "title": "PHYS 204 Mechanics",
        "credits": 3,
        "prerequisites": "MATH 203",
        "corequisites": "",
        "description": "Kinematics, Newton’s laws of motion. Statics, dynamics. Conservation of momentum and energy. Rotational motion. Periodic motion.",
        "components": "Lecture",
        "notes": "Students in programs leading to the BSc degree may not take this course for credit to be applied to their program of concentration. See PHYS 224 for laboratory associated with this course."
    },
    {
        "title": "PHYS 205 Electricity and Magnetism",
        "credits": 3,
        "prerequisites": "MATH 203; PHYS 204 or equivalent.",
        "corequisites": "",
        "description": "Electrical charge and Coulomb’s law. Electrical field and potential. Capacity, steady state, and transient currents. Electromagnetic induction and alternating currents.",
        "components": "Lecture",
        "notes": "Students in programs leading to the BSc degree may not take this course for credit to be applied to their program of concentration. See PHYS 225 for laboratory associated with this course."
    },
    {
        "title": "PHYS 206 Waves and Modern Physics",
        "credits": 3,
        "prerequisites": "PHYS 204 or equivalent.",
        "corequisites": "",
        "description": "This course reviews Geometrical optics, together with wave propagation and interference. It covers special relativity and the photoelectric and Compton effects as well as introduces the Shrödinger equation and wave function, the uncertainty principle, Bohr’s atom, and radioactivity. Selected topics from high energy physics may be included.",
        "components": "Lecture",
        "notes": "Students in programs leading to the BSc degree may not take this course for credit to be applied to their program of concentration. See PHYS 226 for laboratory associated with this course."
    },
    {
        "title": "PHYS 210 Discoveries in Physics",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "A non‑mathematical course in physics specifically designed for students who have had little or no experience in physics. This course traces the fundamental ideas from which modern physics has emerged, and attempts to develop insights into the understanding of natural phenomena.",
        "components": "Lecture",
        "notes": "Students in programs leading to the BSc degree may not take this course for credit."
    },
    {
        "title": "PHYS 235 Object-Oriented Programming and Applications",
        "credits": 3,
        "prerequisites": "MATH 203, MATH 204.",
        "corequisites": "",
        "description": "Introduction to problem solving with computers; programming. Basic elements of an object‑oriented language; basic data types, objects, expressions, simple programs. Control structures; library functions, one‑ and two‑dimensional arrays. Introduction to mathematics software (Maple and/or Mathematica) and to programming languages (C/C++ and/or Fortran 77). The material is illustrated with simple examples from physics.",
        "components": "Lecture",
        "notes": "Students may replace this course with COMP 248.Students who have received credit for COMP 248 or PHYS 233 may not take this course for credit."
    },
    {
        "title": "PHYS 236 Numerical Methods in Physics with Python",
        "credits": 3,
        "prerequisites": "MATH 204, MATH 205.",
        "corequisites": "",
        "description": "This course is an introduction to computational physics using Python, assuming no background knowledge in programming. Topics may include basic programming, data analysis and visualization, curve fitting, numerical differentiation and integration, solving systems of linear equations, and solving differential equations. Material is presented in the context of applications in physics, including medical biophysics, fluid mechanics, and optics.",
        "components": "Lecture; Tutorial",
        "notes": null
    },
    {
        "title": "PHYS 245 Classical Mechanics",
        "credits": 3,
        "prerequisites": "MATH 204, MATH 205 or equivalent.",
        "corequisites": "",
        "description": "Statics of rigid bodies, work and potential functions, motion in uniform field. Particle motion in an accelerated frame, rotation coordinate systems, motion in a resisting medium, small oscillations, damped (harmonic) motion, motion under central forces, mechanics of a rigid body, dynamics of systems of particles, motion of rigid bodies in three dimensions, elements of Lagrangian mechanics.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 252 Optics",
        "credits": 3,
        "prerequisites": "PHYS 206.",
        "corequisites": "",
        "description": "Wave equation, phasors, EM waves, linear, circular and elliptical polarization, polariscope, Malus’ law, dichroism, polaroid, polarizing Prism, quarter and half wave plates, wave superposition, interference, Young’s double slit experiment, Michelson interferometer, reflectance and transmittance of thin films, interferometers, dispersion, elements of Fourier analysis, diffraction, single slit diffraction, double slit, Fraunhofer and Fresnel limits, diffraction grating, Fresnel diffraction, instruments, introduction to lasers.",
        "components": "Lecture; Tutorial",
        "notes": null
    },
    {
        "title": "PHYS 253 Electricity and Magnetism I",
        "credits": 3,
        "prerequisites": "PHYS 205 or equivalent",
        "corequisites": "MAST 218 or equivalent",
        "description": "Electrostatics, Gauss’ law, electric potential, curl and divergence of fields, capacitance, RC circuits, Laplace’s equation, Legendre equation, method of images, multipole expansion, dielectrics, polarization, dipole moments, electric displacement.",
        "components": "Lecture; Tutorial",
        "notes": null
    },
    {
        "title": "PHYS 260 Introductory Biophysics",
        "credits": 3,
        "prerequisites": "BIOL 201; CHEM 205; MATH 203; PHYS 204, PHYS 205, PHYS 206; or equivalent.",
        "corequisites": "",
        "description": "Cell physiology; macromolecules and molecular devices; transmission of genetic information; random walks, friction and diffusion; Reynolds number; entropy, temperature and free energy; entropic forces; chemical forces; self‑assembly; membranes; active transport; nerve impulses. Overview of experimental techniques: X‑ray crystallography; atomic force, electron and optical microscopies; patch‑clamp techniques.",
        "components": "Lecture; Tutorial",
        "notes": "Students who have received credit for this topic under a PHYS 298 number may not take this course for credit."
    },
    {
        "title": "PHYS 270 Introduction to Energy and Environment",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is designed for students who have little or no background in physics. Topics covered include relationship of physics to environment and energy. Concept and definition of work and energy. Interaction of people and inanimate objects with the environment. Heat and chemical energy. Electromagnetic and nuclear energy. Conservation of energy — how it affects everyday life. Sources of energy used on Earth. Solar energy. Production of wind power, water power, solar cells from sun’s energy, biological uses, biopower.",
        "components": "Lecture",
        "notes": "Students in programs leading to the BSc degree may not take this course for credit."
    },
    {
        "title": "PHYS 273 Energy and Environment",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course studies energy — a critical resource for civilization — and the impact of energy consumption on societies and the environment. Topics include renewable and non‑renewable energy sources, the physics of energy including the second law of thermodynamics and the notion of entropy, energy production and distribution, and social and global environmental issues such as pollution, sustainability, climate change, regulation and the future of energy.",
        "components": "Lecture",
        "notes": "Students registered in a Physics program may only count this course for credit towards their degree requirements as an out-of-program elective, or towards the completion of an additional program of concentration outside of Physics."
    },
    {
        "title": "PHYS 284 Introduction to Astronomy",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course explores current knowledge of the cosmos from the celestial sphere towards the farthest reaches of the universe. The journey begins with a description of planet earth, its place in the solar system, and resulting seasonal changes, tidal movements, and earth’s precession. Farther out, the solar system, the planets, star clusters, the Milky Way galaxy, and modern strange systems such as black holes, quasars, and supernovae are explored. The physical, theoretical and experimental grounds for understanding are described including Newton’s laws, quantum and relativistic theories of light and matter, the science of visual and microwave telescopes, and techniques for discovering the existence of planets in other solar systems are also described.",
        "components": "Lecture",
        "notes": "Students registered in a Physics program may only count this course for credit towards their degree requirements as an out-of-program elective, or towards the completion of an additional program of concentration outside of Physics."
    },
    {
        "title": "PHYS 289 Honours Research Experience I",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course is a first supervised research project in Physics or Biophysics. Students work under the supervision of a member of the Faculty on either an experimental, computational, or theoretical research project.The learning outcomes include, but are not limited to, developing the ability to do an overview literature review, develop awareness of methods used to troubleshoot research work progress, develop familiarity with organization and communication of research results, understand the importance of collaborative and ethical research, make a targeted research contribution on a current research project. A formal, written report is required.",
        "components": "Research",
        "notes": "This course is intended as an elective physics course for honours students doing research in the Department."
    },
    {
        "title": "PHYS 292 Experimental Mechanics II",
        "credits": 1,
        "prerequisites": "PHYS 230.",
        "corequisites": "",
        "description": "A laboratory course in mechanics. Experiments include the use of air tracks to study acceleration, collisions, dissipative forces, and periodic motion. Other experiments include viscosity and surface tension of liquids.",
        "components": "Laboratory",
        "notes": null
    },
    {
        "title": "PHYS 294 Experimental Electricity and Magnetism II",
        "credits": 1,
        "prerequisites": "PHYS 230.",
        "corequisites": "",
        "description": "A laboratory course in electricity and magnetism. Experiments include the transistor, amplification and frequency response, transient response and negative feedback, positive feedback and oscillation, periodic structures.",
        "components": "Laboratory",
        "notes": null
    },
    {
        "title": "PHYS 295 Experimental Electronics I",
        "credits": 2,
        "prerequisites": "",
        "corequisites": "",
        "description": "A practical laboratory course in electronics. Experiments include resistors in series and parallel, voltameter, Ohm’s law, Kirchhoff’s current and voltage laws, Ohmmeter, capacitor, inductor, transformer, rectifiers, voltage doubler, zener diode, power supplies.",
        "components": "Laboratory",
        "notes": "Students who have received credit for PHYS 290 may not take this course for credit."
    },
    {
        "title": "PHYS 296 Experimental Electronics II",
        "credits": 2,
        "prerequisites": "PHYS 295.",
        "corequisites": "",
        "description": "A practical laboratory course in electronics. Experiments include oscilloscope, biasing of bipolar transistors, transistor amplifiers, voltage and current regulators, field‑effect transistor, oscillators, operational amplifier circuits, audio amplifier, I‑F transformer, limiter, amplitude and frequency modulation.",
        "components": "Laboratory",
        "notes": "Students who have received credit for PHYS 290 may not take this course for credit."
    },
    {
        "title": "PHYS 298 Selected Topics in Physics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 299 Selected Topics in Physics",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 330 Experimental Physics II",
        "credits": 3,
        "prerequisites": "PHYS 230.",
        "corequisites": "",
        "description": "This course builds on the competencies developed in Experimental Physics I, introducing various physics experiments that require a higher level of experimental skills and deeper insight into how an experiment should be conducted. The data analysis required by these experiments is more involved than that of Experimental Physics I. Students develop their scientific communication skills through the production of reports and an oral presentation.",
        "components": "Laboratory",
        "notes": null
    },
    {
        "title": "PHYS 334 Thermodynamics",
        "credits": 3,
        "prerequisites": "PHYS 204 or equivalent; MAST 218 or equivalent",
        "corequisites": "MAST 219",
        "description": "Equation of state, ideal and real gases, thermodynamic surfaces, first law of thermodynamics, isothermal and adiabatic processes, the energy equation, liquefaction of gases, Carnot engine, second law of thermodynamics, entropy, third law, thermodynamic potentials, Clausius‑Clapeyron equation, kinetic theory, equipartition of energy, Van der Waals’ equation, transport phenomena, probability and thermal distributions.",
        "components": "Lecture",
        "notes": "See PHYS 393 for laboratory associated with this course."
    },
    {
        "title": "PHYS 335 Methods of Theoretical Physics II",
        "credits": 3,
        "prerequisites": "PHYS 232 or equivalent",
        "corequisites": "MAST 219",
        "description": "Function of a complex variable, Fourier series, applications to a vibrating string, heat conduction, Fourier transform, Laplace transform, application to differential equations, delta functions, eigenvalue problems.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 345 Advanced Classical Mechanics",
        "credits": 3,
        "prerequisites": "PHYS 232 or equivalent; PHYS 245 or equivalent; MAST 219.",
        "corequisites": "",
        "description": "Survey of Newtonian mechanics; D’Alembert’s principle and Lagrangian formulation; variational formulation and Hamilton’s principle. Hamiltonian formulation, canonical transformations, Poisson brackets (connection to quantum mechanics); central force motion; planetary motion; scattering in a central field, dynamics of rigid bodies; Euler’s equations; Hamilton‑Jacobi theory, applications. Introduction to non‑linear mechanics.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 354 Electricity and Magnetism II",
        "credits": 3,
        "prerequisites": "PHYS 253 or equivalent",
        "corequisites": "MAST 219 or equivalent",
        "description": "Biot‑Savart Law, Ampere’s law, divergence and curl of B, magnetic vector potential, magnetization, ferromagnetism, electromagnetic induction, motional EMF, inductance, transformer, ac‑circuits, Maxwell’s equations, the wave equation, polarization, reflection and transmission of em waves, rectangular wave guide, half‑wave antenna.",
        "components": "Lecture",
        "notes": "Students who have received credit for PHYS 254 may not take this course for credit."
    },
    {
        "title": "PHYS 355 Electronics",
        "credits": 3,
        "prerequisites": "PHYS 205.",
        "corequisites": "",
        "description": "Basic circuit analysis, network theorems, maximum power transfer, diode characteristics and circuits, power supply designs, transistor characteristics, incremental equivalent circuits, input and output impedance calculations, emitter follower and Darlington amplifiers, power amplifiers, dc stabilization and negative feedback, operational amplifiers, phase detection, frequency multiplier and special circuits.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 367 Modern Physics and Relativity",
        "credits": 3,
        "prerequisites": "PHYS 205, PHYS 206 or equivalent.",
        "corequisites": "",
        "description": "This course covers basics of special relativity and some aspects of modern physics up to quantum mechanics. It covers Lorentz transformations, space-time and four-tensors, Minkowski map of space-time, four-velocity and four-acceleration, four-momentum, equivalence of mass and energy, angular momentum, three- and four-force as well as formal structure of Maxwell’s theory, transformation of E and B and electromagnetic energy tensor. The course also offers details on atomic structure such as orbital magnetization and the normal Zeeman effect, electron spin, spin-orbit interaction and other magnetic effects, exchange symmetry and the exclusion principle, electron interactions and screening effects, X-ray spectra and Mosley’s law and the periodic table.",
        "components": "Lecture; Tutorial",
        "notes": null
    },
    {
        "title": "PHYS 370 Nonlinear Dynamics/Chaos/Fractals",
        "credits": 3,
        "prerequisites": "PHYS 232 or equivalent.",
        "corequisites": "",
        "description": "One-dimensional flows and maps, bifurcations, two-dimensional flows and maps, phase plane and limit cycles. Lorenz equations, strange attractors, chaos and nonlinearity, deterministic chaos, period doubling, experimental manifestations. Fractals, fractal dimension, examples of chaos and of fractals. Applications in physics, biology, chemistry, and engineering.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under a PHYS 498 number may not take this course for credit."
    },
    {
        "title": "PHYS 377 Quantum Mechanics I",
        "credits": 3,
        "prerequisites": "PHYS 206.",
        "corequisites": "",
        "description": "This course covers the basics of quantum mechanics, including Schrödinger equation, probabilistic interpretation of the wavefunction, normalization, expectation values, the uncertainty principle, stationary states, solutions of Schrödinger’s equation for simple 1D potentials, the scattering matrix, vector spaces, postulates of quantum mechanics, operators and eigenvectors, compatible observables, the uncertainty relations, time‑evolution of states, Ehrenfest’s equations, time‑independent perturbation theory, hydrogen atom, angular momentum, spin, addition of angular momenta.",
        "components": "Lecture; Tutorial",
        "notes": null
    },
    {
        "title": "PHYS 385 Astrophysics",
        "credits": 3,
        "prerequisites": "PHYS 284.",
        "corequisites": "",
        "description": "The stars, stellar atmospheres, motion, interiors, and populations. Variable stars. Nebulae. Radio, X‑ray, and infrared sources. The galaxy — population and dynamics. The extragalactic universe.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 389 Honours Research Experience II",
        "credits": 3,
        "prerequisites": "PHYS 289. Enrolment in the Honours in Physics program is required. Permission of the Department is required.",
        "corequisites": "",
        "description": "This course is a second supervised research project in Physics or Biophysics. Students work under the supervision of a member of the Faculty on either an experimental, computational, or theoretical research project. The learning outcomes include, but are not limited to, developing the ability to conduct a detailed literature review, develop productive methods to troubleshoot research work progress, learn to organize and communicate research results at an intermediate level, develop the ability to work collaboratively and ethically, and make a targeted, but substantive, research contribution on a current research project. A formal, written report is required.",
        "components": "Research",
        "notes": "This course is intended as an elective physics course for honours students doing research in the Department."
    },
    {
        "title": "PHYS 390 Applied Electronics for Scientists",
        "credits": 3,
        "prerequisites": "PHYS 355 or equivalent.",
        "corequisites": "",
        "description": "This course introduces students to hands-on design, assembly, analysis, and testing of electronic control and measurement circuits for modern laboratory experiments. Topics may include linear components, filters, transistors, semiconductor devices, operational amplifiers, integrated circuits, networks, ADCs/DACs, and microcontrollers/microprocessors (Arduino/Raspberry Pi).",
        "components": "Laboratory",
        "notes": null
    },
    {
        "title": "PHYS 392 Experimental Medical Electronics",
        "credits": 3,
        "prerequisites": "PHYS 296 or PHYS 330, or equivalent.",
        "corequisites": "",
        "description": "A laboratory course in the maintenance and use of medical instruments, including ECG monitor, electrocardiograph, cardio‑tachometer, blood‑pressure recorder, respiration‑rate recorder, and clinical thermometer. The component parts of the instruments are studied first, and then the instruments are constructed and tested.",
        "components": "Laboratory",
        "notes": null
    },
    {
        "title": "PHYS 398 Selected Topics in Physics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 399 Selected Topics in Physics",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 435 Statistical Physics",
        "credits": 3,
        "prerequisites": "PHYS 334, PHYS 367.",
        "corequisites": "",
        "description": "This course focuses on statistical ensembles (micro, macro, and grand canonical); introduces Maxwell-Boltzmann, Fermi-Dirac, and Bose-Einstein distributions for the microstates and their applications, and formulates a statistical treatment of the laws of thermodynamics. These concepts are applied to classical problems like black-body radiation, thermodynamics of free elections, and phase transitions involving ferromagnetism and the Ising model. This course also covers fluctuations and Onsager relations, Nyquist's theorem, Brownian motion and the diffusion equation, and selected topics on transport.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 436 Methods of Theoretical Physics III",
        "credits": 3,
        "prerequisites": "PHYS 335 or equivalent.",
        "corequisites": "",
        "description": "Partial differential equations, eigenfunction expansion and finite transforms, Laplace, Poisson, wave and diffusion equations, applications, special functions, boundary value problems, Sturm‑Liouville theory, Bessel functions, Legendre and Hermite polynomials, spherical harmonics, Green’s function and applications, perturbation theory, variational theory.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 440 Computational Methods in Physics with Python",
        "credits": 3,
        "prerequisites": "PHYS 236, PHYS 335, PHYS 377.",
        "corequisites": "",
        "description": "This course presents advanced computational physics techniques using Python. Topics may include Bayesian inference, information theory, regression, Monte-Carlo methods, neural networks, machine learning, and molecular dynamics with a focus on computational solution of advanced problems in biophysics, electrodynamics, and quantum mechanics.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 443 Quantitative Human Systems Physiology",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course addresses important concepts of quantitative systems physiology and the physical bases of physiological function in different organ systems. Students become familiar with the structure and functional principles of the main physiological systems, and how to quantify them. These include the nervous, cardiovascular, respiratory and muscular systems. Important biophysical principles and quantitative physiological methods are presented. These include biophysics of muscle contractions, fluid dynamics in the cardiovascular system, respiration gas exchange and neuronal communication, and how the biophysics of neuronal communications can be used to image brain activity.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 445 Principles of Medical Imaging",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "This course introduces the physical principles associated with important medical imaging techniques used in medicine and in neuroscience research. The objective is to cover the whole imaging process in detail starting from the body entities to be imaged (e.g. structure, function, blood flow, neuronal activity), extending to the physical principles of data acquisition and finally the methods used for image data reconstruction. Imaging modalities presented may include X‑Ray and Computer Tomography, Magnetic Resonance Imaging, nuclear medicine, ultrasound, electrophysiology and optical imaging techniques.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 458 Advanced Electrodynamics",
        "credits": 3,
        "prerequisites": "PHYS 354, PHYS 436.",
        "corequisites": "",
        "description": "Electrostatic boundary‑value problem and Green’s function, Maxwell’s equation, energy‑momentum tensor, guided waves, dielectric wave guides, fibre optics, radiation static field, multipole radiation, velocity and acceleration field, Larmor’s formula, relativistic generalization, radiating systems, linear antenna, aperture in wave guide, Thomson scattering, bremsstrahlung, Abraham‑Lorentz equation, Breit‑Wigner formula, Green’s function for Helmholtz’s equation, Noether’s theorem.",
        "components": "Lecture; Reading",
        "notes": null
    },
    {
        "title": "PHYS 460 Chemical Aspects of Biophysics",
        "credits": 3,
        "prerequisites": "PHYS 253",
        "corequisites": "PHYS 334",
        "description": "Stabilizing protein structures; bonding and nonbonding interactions; energy profiles; Ramachandran plot; stabilization through protonation‑deprotonation. Interaction of macromolecules with solvents. Thermodynamics of protein folding. Ligand binding, Marcus‑theory of biological electron transfer. Examples of modern biophysical techniques: electronic spectroscopies (absorption, fluorescence), X‑ray absorption spectroscopy, NMR and EPR spectroscopy, IR and Raman spectroscopy, circular dicroism, differential scanning calorimetry.",
        "components": "Lecture",
        "notes": "Students enrolled in a BSc Honours in Biochemistry or Specialization in Biochemistry may not take this course for credit."
    },
    {
        "title": "PHYS 461 Membrane Biophysics",
        "credits": 3,
        "prerequisites": "BIOL 266; PHYS 460.",
        "corequisites": "",
        "description": "Fluid dynamics; composition of natural membranes; selection criteria for artificial membranes; phases and phase transitions of lipids; lipid‑protein interactions; transport mechanisms across membranes; facilitated diffusion, Michaelis‑Menten equation, ion channels, active transport against a concentration gradient, ATPase; origin of membrane potentials; electrogenic ion pumps; experimental methods to measure membrane potentials (patch clamp, optical, radioactive); resting and action potentials.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 462 Bioenergetics",
        "credits": 3,
        "prerequisites": "PHYS 460, PHYS 461.",
        "corequisites": "",
        "description": "Chemiosmotic energy transduction, ion transport across energy conserving membranes, quantitative bioenergetics: measurement of driving forces. Chemiosmotic proton circuit, respiratory chains, photosynthesis, photosynthetic generators of protonmotive force, coupling between biological electron and proton transfer reactions, ATP synthase, metabolite and ion transport, mitochondria in the cell.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 463 Optical Spectroscopy with Biophysics Applications",
        "credits": 3,
        "prerequisites": "PHYS 377.",
        "corequisites": "",
        "description": "Beer‑Lambert Law, absorption; fluorescence; pump‑probe; photon echo, IR and Raman spectroscopies; linear and circular dichroism; single molecule spectroscopy; spectral hole burning and fluorescence line narrowing. Relevant concepts of quantum mechanics (time‑dependent and time‑independent Schrödinger equation, spatial wavefunctions, transitions between states and time‑dependent perturbation theory, lifetimes and uncertainty principle). Atomic and molecular orbitals. Some concepts related to symmetry and group theory. Resonance energy transfer. Optical properties of molecular aggregates.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 468 Condensed Matter Physics II",
        "credits": 3,
        "prerequisites": "PHYS 459",
        "corequisites": "PHYS 478",
        "description": "This course offers an introduction to the problem of many-electron interactions by introducing second-quantization notation and mean-field theory as an approximation to solve complex many-body problems. Quantum phases like magnets and superconductors are studied using mean-field theory along with associated phase transitions. The course also introduces the semi-classical and quantum theory of transport in quantum systems (Boltzmann's and Landauer's equations). Selected topics may include collective excitations, 2D Dirac materials, or integer and fractional quantum Hall effects.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 470 Nonlinear Waves",
        "credits": 3,
        "prerequisites": "PHYS 335.",
        "corequisites": "",
        "description": "Linear stability analysis and limitations, modulated waves and nonlinear dispersion relations. Korteweg‑de Vries, sine‑Gordon, and nonlinear Schrödinger equations. Hydro‑dynamic, transmission‑line, mechanical, lattice, and optical solitons. Applications in optical fibres, Josephson junction arrays. Inverse scattering method, conservation laws.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 478 Quantum Mechanics II",
        "credits": 3,
        "prerequisites": "PHYS 377.",
        "corequisites": "",
        "description": "This course covers intermediate quantum mechanics topics including particle states, classification of symmetry, parity, solutions of Schrödinger’s equation, WKB approximation, variational method, time-independent and time‑dependent perturbation theory, systems of particles, interacting particles, identical particles and Pauli exclusion principle, fine and hyperfine structure, the hydrogen atom, angular momentum as well as spin and Pauli spin matrices, Dirac equation.",
        "components": "Lecture",
        "notes": null
    },
    {
        "title": "PHYS 480 Directed Readings in Theoretical Physics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "A course for advanced students in which a special topic, selected in consultation with a faculty member, is studied in depth.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 488 Lasers and Fibre-optics",
        "credits": 3,
        "prerequisites": "PHYS 252, PHYS 354.",
        "corequisites": "",
        "description": "Semiconductor physics, semiconductor sources, detectors, waveguides and fibres, optical communications, assorted topics in electro‑optics.",
        "components": "Lecture",
        "notes": "Students who have received credit for this topic under a PHYS 498 number may not take this course for credit."
    },
    {
        "title": "PHYS 491 Experimental Microprocessor Interfacing",
        "credits": 3,
        "prerequisites": "PHYS 390.",
        "corequisites": "",
        "description": "Address decoding, multiplexing, and demultiplexing with TTL integrated circuits. Address decoding circuits, drivers, and receivers. Parallel, serial and non‑TTL I/O. Breadboarding, wire‑wrapping, and soldering techniques. The use of oscilloscopes, logic probes, and computers for circuit trouble‑shooting. Drawing schematic diagrams. Timing diagrams. Data sheets.",
        "components": "Laboratory",
        "notes": null
    },
    {
        "title": "PHYS 494 Methods of Experimental Physics",
        "credits": 3,
        "prerequisites": "PHYS 330. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "A supervised research project which may include experiments in nuclear physics, laser and fibre‑optics, solid state physics, ultrasonics, or thermal physics. A technical report is required.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 495 Experimental Nuclear Physics",
        "credits": 1,
        "prerequisites": "PHYS 330.",
        "corequisites": "",
        "description": "A laboratory course in nuclear physics. Experiments include gamma‑ and beta‑ray spectroscopy, nuclear magnetic resonance, half‑life determination, nuclear activities.",
        "components": "Laboratory 10 experiments",
        "notes": null
    },
    {
        "title": "PHYS 496 Honours Research Project",
        "credits": 6,
        "prerequisites": "PHYS 330. Enrolment in the Honours in Physics is required. Students must have completed 45 credits in Physics prior to enrolling. Permission of the Department is required.",
        "corequisites": "",
        "description": "A research project for honours students that is carried out on a special topic in physics, biophysics, or applied physics under the supervision of a faculty member.",
        "components": "Research",
        "notes": null
    },
    {
        "title": "PHYS 497 Specialization Research Project",
        "credits": 3,
        "prerequisites": "PHYS 330. Enrolment in the Specialization in Physics is required. Students must have completed 45 credits in Physics prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
        "corequisites": "",
        "description": "This is an independent studies course for advanced specialization students in which a special topic in physics, biophysics, or applied physics is studied under the supervision of a faculty member. The student is required to write a report and give a brief presentation.",
        "components": "Research",
        "notes": null
    },
    {
        "title": "PHYS 498 Advanced Topics in Physics",
        "credits": 3,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    },
    {
        "title": "PHYS 499 Advanced Topics in Physics",
        "credits": 6,
        "prerequisites": "",
        "corequisites": "",
        "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule.",
        "components": null,
        "notes": null
    }
]