[
  {
    "title": "ENCS 272 Composition and Argumentation for Engineers",
    "credits": 3,
    "prerequisites": "Students must complete all English as a Second Language (ESL) Courses required on admission prior to enrolling.",
    "corequisites": "",
    "description": "Fundamentals of English composition and argumentation: grammar; reasoning and persuasion; persuasive proofs; argumentation; structuring and outlining; the problem statement; the body; and the conclusions. Language and persuasion for effective communication in professional engineering. Cultivation of a writing style firmly based on clear and critical thinking skills.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
    "notes": "This course cannot be used for credit in any GCS degree or certificate program.Students who pass this course with C- or higher will fulfill the GCS writing skills requirement, and will be eligible to enrol in ENCS 282.",
    "offeredIn": [
      "fall",
      "summer",
      "winter"
    ]
  },
  {
    "title": "ENCS 282 Technical Writing and Communication",
    "credits": 3,
    "prerequisites": "Students must have satisfied the requirements in Section 71.20.7 Writing Skills Requirement, by passing the Engineering Writing Test (EWT) or by passing ENCS 272 with a grade of C‑ or higher, prior to enrolling.",
    "corequisites": "",
    "description": "Technical writing form and style. Technical and scientific papers, abstracts, reports. Library research and referencing methods for engineers and computer scientists. Technical communication using information technology: document processing software, computer‑assisted presentation, analysis and design of web presentation, choice and use of appropriate tools. Students will prepare an individual major report and make an oral presentation",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": null,
    "offeredIn": [
      "fall",
      "summer",
      "winter"
    ]
  },
  {
    "title": "ENCS 333 Research Methods, Ethics, Law and Regulation for Computational Biology",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: ENCS 282 or equivalent. Students must complete a minimum of 27 credits as part of the BCompSc in Health and Life Sciences or BSc in Systems and Information Biology programs prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "The course is comprised of three modules: Research Methods; Ethics; and Intellectual Property, Law and Regulation.",
    "components": "Lecture 1.5 hours per week, over two terms, fall and winter.",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "ENCS 393 Social and Ethical Dimensions of Information and Communication Technologies",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: ENCS 282. Students must complete 30 credits in their degree program prior to enrolling.",
    "corequisites": "",
    "description": "This course covers the following topics: ethics in an information society; surveillance and privacy; economic globalization and intellectual property in a digital world: the digital divide; computer-based profiling and hacking; electronic democracy; computer-mediated experience; and information productivity and the work/life balance.",
    "components": "Lecture 3 hours per week",
    "notes": null,
    "offeredIn": [
      "fall",
      "summer",
      "winter"
    ]
  },
  {
    "title": "ENCS 483 Creativity, Innovation and Critical Thinking in Science and Technology",
    "credits": 3,
    "prerequisites": "Students must complete a minimum of 60 credits in an engineering program or minimum of 45 credits in a non-engineering program prior to enrolling.",
    "corequisites": "",
    "description": "Understanding, thinking, arguing, and creativity in science and technology; analyzing and critiquing complex problems using multidisciplinary theories of creativity; exploring the processes of invention and innovation and their impact on economics, popular media, and social and cultural structures; case studies of why some inventions fail and others succeed. Students will be evaluated on case studies, assignments, and a project.",
    "components": "Lecture 3 hours per week",
    "notes": "Students who have received credit for ENCS 283 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "ENCS 484 Development and Global Engineering",
    "credits": 3,
    "prerequisites": "Students must complete a minimum of 60 credits in an engineering program or minimum of 45 credits in a non-engineering program prior to enrolling.",
    "corequisites": "",
    "description": "International development and global engineering: globalization; development projects; planning and analysis; and participatory data gathering. A project.",
    "components": "Lecture 3 hours per week",
    "notes": "Students who have received credit for this topic under an ENCS 498 number may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "ENCS 485 Field Course in Engineering and Sustainable Development",
    "credits": 3,
    "prerequisites": "Students must complete a minimum of 24 credits towards an undergraduate program offered by the Gina Cody School of Engineering and Computer Science prior to enrolling, with a minimum GPA of 2.50.",
    "corequisites": "",
    "description": "This is a complementary field course for undergraduate students interested in areas of international development and global engineering. The course consists of lectures at Concordia University followed by a trip to a designated location where development is underway. Topics include location and context‑specific history and evolution of development, globalization, sustainability initiatives, technological planning and analysis, and participatory data gathering. Students are required to complete a project‑based research paper on a topic approved by the course instructor.",
    "components": "Lecture; Fieldwork",
    "notes": "Students from other Faculties may register for this course with permission from the course instructor.",
    "offeredIn": []
  },
  {
    "title": "ENCS 498 Topics in Engineering and Computer Science",
    "credits": 3,
    "prerequisites": "Permission of the GCS is required.",
    "corequisites": "",
    "description": "This course may be offered in a given year upon the authorization of the Gina Cody School of Engineering and Computer Science. The course content may vary from offering to offering.",
    "components": null,
    "notes": null,
    "offeredIn": []
  }
]