[
  {
    "title": "URBS 230 Urbanization: Global and Historical Perspectives",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines how and why cities grow and change over time. The relationships between socio‑cultural, economic, and physical aspects of urban development are considered at the local, city, and regional scales.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 240 Planning",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course examines the emergence and evolution of contemporary planning ideas within the broader historical context of 19th‑ and 20th‑century city development. Special attention is given to how planning theories and practices have informed the development and management of urban, suburban and rural environments.",
    "components": "Lecture; Tutorial",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "URBS 250 Representation Methods in Urban Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course introduces students to theories and methods of graphic representation. It focuses on methods used to analyze and communicate data with an emphasis on spatial information on built and social environments. The representation methods include two‑ and three‑dimensional views, cartography, as well as data visualization. Physical and digital tools are covered.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 260 Analytical Methods in Urban Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This is an introduction to qualitative research skills associated with urban studies. The emphasis is on the use of data sources and collection techniques along with analytical procedures appropriate to questions of urban planning and public policy.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "URBS 298 Selected Topics in Urban Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Specific topics for this course, and prerequisites relevant in each case, are stated in the Undergraduate Class Schedule and Geography Course Guide.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "URBS 300 Neighbourhood and Community Planning",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: GEOG 220 or URBS 230.",
    "corequisites": "",
    "description": "This course examines theories, issues, and techniques of community‑level planning in urban and suburban environments. Particular place‑based or identity‑based communities and their participation in planning processes are considered. Models of community change and local development are reviewed, along with the policies and supportive infrastructure in cities, including Montreal. Local governance, decision‑making, and public participation are considered in light of municipal and regional institutions which currently predominate in Canada’s metropolitan areas.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "URBS 310 Urban Transportation",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: GEOG 220 or URBS 230. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the past evolution and recent functioning of various transport modes in cities around the world. Recent debates about desirable levels of car, transit, and non‑motorized modes feature prominently. Techniques of analyzing urban transport and public policy options are considered in light of burgeoning concerns about sustainable development and the worldwide growth of motorization.",
    "components": "Lecture",
    "notes": "Students who have received credit for GEOG 333 may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "URBS 333 Urban Laboratory",
    "credits": 6,
    "prerequisites": "The following courses must be completed previously: URBS 250 and URBS 260. Enrolment in the BA Honours in Urban Planning or BA Specialization in Urban Planning is required.",
    "corequisites": "",
    "description": "With an emphasis on first‑hand knowledge of an area‑based problem, students study an urban problem and simulate solutions. Theory and case studies are used to develop appropriate interventions. Plans are prepared and, under the supervision of the professor, are evaluated by the peer group and experts in the field.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall/winter"
    ]
  },
  {
    "title": "URBS 335 Geographic Information Systems",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: URBS 250.",
    "corequisites": "",
    "description": "This course is an introduction to current theoretical and practical approaches to Geographic Information Systems (GIS) through which students acquire basic skills and understanding in the use of GIS for spatial analysis. Training is centred on a series of practical assignments using GIS software and for the term project, students explore the potential of GIS for addressing a real‑world problem.",
    "components": "Lecture; Tutorial; Laboratory",
    "notes": "Students who have received credit for GEOG 363 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 337 Urban Agriculture",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: URBS 230 or GEOG 220. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the history and practice of producing food in cities. Students explore the tensions between the politics, economies and ecologies that organize urban food production and the everyday ways people raise and access food in varied urban contexts. The course also critically evaluates food‑based social movements: their limits, possibilities and connections to wider struggles for socio‑economic justice.",
    "components": "Lecture",
    "notes": "Students who have received credit for GEOG 323 or for this topic under a GEOG 398 or URBS 398 number may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 338 Urban Ecology",
    "credits": 3,
    "prerequisites": "Students must have completed 24 credits prior to enrolling. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "Focusing on the impacts of human activities on fauna, flora, soils and air, this course introduces students to ecosystems found in urban environments. This course also examines the flux of energy and materials to and from the city, and places a strong emphasis on policy and planning practices related to urban forestry site restoration, greening initiatives, environmental justice, and on practices that foster biodiversity and responsible resource management. The course also looks at historical and contemporary views on the relationship between the city and nature.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "URBS 362 Quantitative Research Methods",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: URBS 260.",
    "corequisites": "",
    "description": "This course covers the most commonly employed methods for quantitative social science research. Students are taught the basics of introductory classical statistics (both descriptive and inferential) and gain experience applying these methods with commonly used software tools and real‑world data.",
    "components": "Lecture; Laboratory",
    "notes": "Students who have received credit for URBS 360 may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 370 Housing Policy",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: URBS 230. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course provides an overview of housing problems and policies in modern capitalist cities, examining the nature of housing problems, the actors involved in the housing field, and the major policies that have addressed and/or worsened various housing problems.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a URBS 398 number may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "URBS 380 Urban and Regional Economic Development",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: URBS 230, URBS 240.",
    "corequisites": "",
    "description": "This course draws on economic and geographical concepts to examine the process of urbanization. Students begin by focusing on the conventional tools and models for analyzing the nature and structure of cities, and at theories concerning the location of economic activity. It also examines key planning issues associated with the (evolving) role of cities as place of production, distribution, and consumption and considers the role of public policy in addressing these issues. Methods for defining and measuring urban economies for the purpose of analysis are reviewed.",
    "components": "Lecture",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 393 Law and Regulation in Urban Planning",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: URBS 230 and URBS 240.",
    "corequisites": "",
    "description": "Urban planning as governmental activity is defined by planning legislation in Quebec. This course covers the major bodies of legislation relevant to urban plans, local development plans, environmental protection, agricultural land preservation, heritage, and economic development. The law is a framework for development control and direct intervention at municipal, regional and provincial levels.",
    "components": "Lecture",
    "notes": "Students who have received credit for URBS 293 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "URBS 398 Selected Topics in Urban Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Special topics in urban studies.",
    "components": null,
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "URBS 420 Social Geographies of Montreal",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: GEOG 315 or GEOG 330. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course explores the social and cultural geographies of Montreal with particular emphasis on how the spatial distribution of communities influences urban planning and public policy at the local and regional levels. Complex webs of identities and solidarities informed by socio‑economic, linguistic, ethno‑cultural, and sexual orientation factors shape the city living experience of individuals and populations alike. Through lectures, discussions, assignments and field trips, students are introduced to a variety of analytical perspectives that investigate the socio‑cultural dynamics that contribute to shaping urban settlements, human‑environment interactions and local social networks.",
    "components": "Seminar",
    "notes": "Students who have received credit for GEOG 430 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "URBS 433 Advanced Urban Laboratory",
    "credits": 6,
    "prerequisites": "The following courses must be completed previously: URBS 333 and URBS 393.",
    "corequisites": "",
    "description": "This is an advanced course in urban design. An overview of current theory and practice is presented. An urban problem is developed and appropriate interventions are considered. These interventions are simulated and the results assessed.",
    "components": "Lecture; Laboratory",
    "notes": null,
    "offeredIn": [
      "fall/winter"
    ]
  },
  {
    "title": "URBS 440 Urban Policing and Security",
    "credits": 3,
    "prerequisites": "Enrolment in the Specialization in Urban Planning or the Minor in Black and African Diaspora Studies in the Canadian Context is required. Students must have completed 48 credits prior to enrolling.",
    "corequisites": "",
    "description": "This course examines how urban policing and security are understood and governed in modern cities through institutions operating at multiple scales. Though significant attention is paid to urban police forces, the course also examines how urban security concerns are addressed by broader-scale institutions like border and immigration enforcement bodies, as well as institutions concerned with other urban issues, like planning, housing, and education. Broader questions raised by discussions of security, including the possibilities for social and racial equity in urban planning and governance, are explored.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under an URBS 498 number may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "URBS 450 Economic Restructuring",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: GEOG 330 or GEOG 380 or URBS 380. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course examines the nature of firm restructuring in late capitalism and the implications that industrial restructuring trends are having for the geography of industries, the structure of firms, workplace relations and workers’ rights. It examines the new challenges that restructuring presents for both economic development prospects and labour market policies, as well as looks at contemporary initiatives to promote more socially and environmentally sustainable development paths.",
    "components": "Seminar",
    "notes": "Students who have received credit for GEOG 450 may not take this course for credit.",
    "offeredIn": []
  },
  {
    "title": "URBS 460 Reading the Urban Form",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: URBS 360 or URBS 362 and completion of 48 university credits. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course focuses on the physical reality of the city, or its urban form, as well as the ongoing process of city building and urban morphogenesis. It introduces tools to properly describe, quantify, and interpret urban form in its spatial and temporal dimensions. It seeks to develop a better understanding of the processes of which the contemporary urban artifact is the result. Along with theoretical presentations, the course makes use of case studies conducted in different urban and cultural contexts, and introduces many examples of practical applications of morphological analysis in urban planning and design.",
    "components": "Seminar",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 470 Public Infrastructure Finance for Planners",
    "credits": 3,
    "prerequisites": "The following course must be completed previously: URBS 380. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course focuses on public infrastructure finance practices in Canada, with an emphasis on types of infrastructure of direct importance to urban planners: roads and bridges, public transit, water, sewerage and wastewater treatment. Public revenues including taxes, user charges, development charges, debt financing, as well as the use of public-private partnerships and intergovernmental transfer payments are examined with the aid of case studies. Specific projects and practices are compared and contrasted with those from other provinces or other countries.",
    "components": "Lecture",
    "notes": "Students who have received credit for this topic under a URBS 498 number may not take this course for credit.",
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 475 Community and Regional Planning in a Changing Climate",
    "credits": 3,
    "prerequisites": "Enrolment in the Specialization in Urban Planning is required. Students must have completed 48 credits prior to enrolling.",
    "corequisites": "",
    "description": "This course examines how local communities are engaging in climate action, as well as community and regional planning tools for achieving decarbonization and reducing vulnerability to climate risks. Students learn about requirements and guidelines for local climate action, strategic planning tools for creating climate change policies, measuring local GHG emissions and assessing local climate change risks, and options for implementing climate action.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under an URBS 498 number may not take this course for credit.",
    "offeredIn": [
      "fall"
    ]
  },
  {
    "title": "URBS 480 Impact Assessment",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: URBS 360 or URBS 362 and completion of 48 university credits. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "The impacts of projects on urban and suburban communities and the environment are studied within the context of environmental protection legislation. The methods of assessment are then applied to specific cases.",
    "components": "Seminar",
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  },
  {
    "title": "URBS 481 Urban Planning in the Developing World",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: GEOG 330 or URBS 380. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "This course explores the growth and planning of large metropolitan areas in developing nations. Issues and problems associated with recent urbanization are examined along with potential solutions offered by urban planning and public policies. The planning roles of institutions including governments, multi‑lateral development agencies, and non‑governmental organizations are reviewed.",
    "components": "Lecture",
    "notes": "Students who have received credit for GEOG 431 may not take this course for credit.",
    "offeredIn": [
      "winter"
    ]
  },
  {
    "title": "URBS 483 Directed Studies/Practicum in Urban Planning I",
    "credits": 3,
    "prerequisites": "Enrolment in the Specialization in Urban Planning is required. Students must have completed 60 university credits prior to enrolling.",
    "corequisites": "",
    "description": "Through a case study or practicum of 120 hours with a private or public institution, or community interest group, students acquire experience in a professional working environment.",
    "components": "Conference",
    "notes": null,
    "offeredIn": [
      "fall/winter"
    ]
  },
  {
    "title": "URBS 484 Directed Studies/Practicum in Urban Planning II",
    "credits": 3,
    "prerequisites": "Enrolment in the Specialization in Urban Planning is required. Students must have completed 60 university credits prior to enrolling.",
    "corequisites": "",
    "description": "Through a case study or practicum of 120 hours with a private or public institution, or community interest group, students acquire experience in a professional working environment.",
    "components": "Reading",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "URBS 490 Public Space and the Public Interest",
    "credits": 3,
    "prerequisites": "The following courses must be completed previously: URBS 360 or URBS 362 and completion of 48 university credits. If prerequisites are not satisfied, permission of the Department is required.",
    "corequisites": "",
    "description": "Public space is understood as physical space, as well as the space of media and communications, which are openly accessible to all members of a community. Changing definitions of public space are examined in the context of societal and cultural change. The roles of agents and stakeholders in changing the definitions of public interest are also examined. Legal and normative frameworks for the definition of space, control, and access are also introduced.",
    "components": "Seminar",
    "notes": "Students who have received credit for this topic under a URBS 498 number may not take this course for credit.",
    "offeredIn": [
      "summer"
    ]
  },
  {
    "title": "URBS 491 Honours Essay and Research Seminar",
    "credits": 6,
    "prerequisites": "Permission of the Department is required.",
    "corequisites": "",
    "description": "This course is an advanced undergraduate research seminar which requires the student to propose and conduct a research project or research creation project, and produce a substantial report under the supervision of a faculty advisor.",
    "components": "Seminar",
    "notes": "Students who have received credit for GEOG 491 may not take this course for credit.",
    "offeredIn": [
      "fall/winter"
    ]
  },
  {
    "title": "URBS 495 Field Research",
    "credits": 3,
    "prerequisites": "Students must have completed 60 university credits prior to enrolling. Permission of the Department is required.",
    "corequisites": "",
    "description": "The political, social, and cultural realities of planning in a setting are explored in a field course. Preparation (course meetings and readings) for the field experience at the University is followed by on‑site research in the chosen city, where a field investigation is conducted, usually in collaboration with local partner organizations.",
    "components": "Field Studies",
    "notes": null,
    "offeredIn": []
  },
  {
    "title": "URBS 498 Advanced Topics in Urban Studies",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Special topics in urban studies.",
    "components": null,
    "notes": null,
    "offeredIn": [
      "fall",
      "winter"
    ]
  }
]