[
  {
    "title": "CIVI 212 Civil Engineering Drawing and Introduction to Design",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Fundamentals of technical drawing, orthographic projections, sectional views. Computerâaided drawing; slabs, beams, and columns; steel structures; building trusses and bridges, wood and masonry structures. Working drawing and dimensioning practice. Introduction to the design process.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 231 Geology for Civil Engineers",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "Basic principles of physical and structural geology with emphasis on topics related to civil engineering, study of minerals, rocks and soil types, load formation, techniques of airâphoto interpretations, and geological mapping. Geological site investigation. Preparation and interpretation of engineering geology reports.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
    "notes": null
  },
  {
    "title": "CIVI 321 Engineering Materials",
    "credits": 3.75,
    "prerequisites": "CHEM 205or equivalent.",
    "corequisites": "",
    "description": "Linear and nonlinear material behaviour, timeâdependent behaviour; structural and engineering properties of structural metals; behaviour of wood; production and properties of concrete; bituminous materials, ceramics, plastics; introduction to composite materials.",
    "components": "Lecture 3 hours per week; Laboratory 3 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 361 Introduction to Environmental Engineering",
    "credits": 3.5,
    "prerequisites": "ENGR 361.",
    "corequisites": "",
    "description": "Ecosystems considerations, food chain, natural decomposition, and recycling; environmental problems and impact of engineering activities. Various modes of pollution, water, air, and soil contamination, noise pollution; pollution measurement and quantification. Water and wasteâwater physical, chemical and biological characteristics; turbidity and colour, dissolved oxygen, hardness, pH, alkalinity, organic content, sampling and analysis, chemical and biochemical oxygen demand. Basic processes of treatment: flocculation and coagulation, sedimentation, filtration.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week, alternate week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 372 Transportation Engineering",
    "credits": 3,
    "prerequisites": "BCEE 371;CIVI 341.",
    "corequisites": "",
    "description": "Fields of transportation engineering; transportation’s roles in society; planning and design of road, rail, air, and waterâway system components: terminals, rightâofâway; control systems: evaluation of alternative modes and decisionâmaking process; introduction to computerâaided design and management of systems.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week",
    "notes": null
  },
  {
    "title": "CIVI 381 Hydraulics",
    "credits": 3.5,
    "prerequisites": "ENGR 361,ENGR 391.",
    "corequisites": "",
    "description": "Basic hydrodynamics; boundary layer theory, principle of energy losses. Steady flow in open channel; uniform flow, specific energy and critical flow, transition; gradually varied flow in channels and conduits, water surface profiles, computer applications. Flow measurement in open channel, weirs, overflow spillways.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 382 Water Resources Engineering",
    "credits": 3.5,
    "prerequisites": "CIVI 381;ENGR 391or EMAT 391.",
    "corequisites": "",
    "description": "Sources of water: surface water, groundwater, water quantities and requirements. Water use cycle. Characteristics of water and wastewater. Demand forecast, water use prediction and planning. Groundwater withdrawal and well hydraulics. Water supply network analysis, design of distribution systems, storage, pumping. Sanitary and storm water quantities, urban hydrology. Design of sewer systems, interceptors, gravity sewer, computer applications. Sustainable use of water resources. Design case studies.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 390 Civil Engineering Design Project",
    "credits": 3.5,
    "prerequisites": "ENCS 282",
    "corequisites": "CIVI 361;BCEE 344;BCEE 345",
    "description": "The project of each team encompasses the various stages of design of a medium-size civil engineering project. Students learn civil engineering design process, methodology, identification of objectives, codes, formulation of design problems, and estimation of loads on structures. The topics of design include the development and evaluation of sustainable design alternatives; and the computer-aided design tools. Additionally, performance evaluation using modelling, sensitivity analysis, and cost estimation is presented.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 435 Foundation Design",
    "credits": 3,
    "prerequisites": "BCEE 432.",
    "corequisites": "",
    "description": "This course covers the following: site investigation; shallow and deep foundations; bearing capacity and settlement of foundations; earthâretaining structures; sheet piles; cofferdams; anchors; foundations subjected to dynamic loading; foundations on difficult soils; soil improvement and underpinning.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 437 Advanced Geotechnical Engineering",
    "credits": 3,
    "prerequisites": "BCEE 432.",
    "corequisites": "",
    "description": "Mechanical properties of rocks and rock formations. Underground openings in rocks. Slope stability of stratified formations. Foundations on rocks. Rock bolting. Introduction of soil dynamics. Wave propagation in one and two dimensions in elastic media. Seismic waves. Foundations subjected to dynamic loading. Theory of liquefaction.",
    "components": "Lecture 3 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 440 Computer Applications in Civil Engineering Practice",
    "credits": 3,
    "prerequisites": "BCEE 231. Students must complete 75 credits in the program prior to enrolling.",
    "corequisites": "",
    "description": "General purpose IT tools for civil engineering applications: database programming and webâbased tools. Introduction to remote sensing and GIS. Application of major software packages in selected areas of civil engineering practice with emphasis on modelling, data integration, and workâflow. Case studies in structural design, geotechnical engineering, transportation, and environmental engineering.",
    "components": "Lecture 2 hours per week; Laboratory 2 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 453 Design of Reinforced Concrete Structures",
    "credits": 3.5,
    "prerequisites": "BCEE 345",
    "corequisites": "CIVI 390orBLDG 390",
    "description": "This course covers a wide variety of topics on reinforced concrete including twoâway slab systems (flat plate, flat slab and slabâonâbeams); slender columns; columns subjected to biaxial bending; lateral loads resisting systems (momentâresisting frames, shear walls and coupled shear walls); prestressed concrete (losses, design requirements for flexure, shear, bond, anchorage and deflections). Design project.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 454 Design of Steel Structures",
    "credits": 3.5,
    "prerequisites": "BCEE 344",
    "corequisites": "CIVI 390orBLDG 390",
    "description": "This course covers a wide variety of topics on steel structures: trends and developments in structuralâsteel design, framing systems, floor systems such as composite construction and plate girders, braced frames, and momentâresisting frames. The subject includes connections and PâDelta effects. A design project is required.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 464 Environmental Impact Assessment",
    "credits": 3,
    "prerequisites": "CIVI 361.",
    "corequisites": "",
    "description": "Engineering activities and the environment; environmental ethics. Prediction and estimation of impact onair, water, soilquality, and biological, socio-economic, cultural environments. Water and air pollution laws, solid and hazardouswaste laws.Environmental inventories, assessment preparation, and review. Federal and provincial laws and regulations onenvironmentalassessment. Strategies for environmental compliance, resolution of environmental conflicts. Case studies.",
    "components": "Lecture 3 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 465 Water Pollution and Control",
    "credits": 3.5,
    "prerequisites": "CIVI 361.",
    "corequisites": "",
    "description": "Physical, chemical, and biological characteristics of water, water quality standards, reaction kinetics and material balances, eutrophication. Containment of reactive contaminants. Natural purification processes in water systems, adsorption, absorption; diffusion and dispersion, oxidation. Largeâscale transport of contaminants, single and multiple source models; modelling of transport processes, computer simulation. Introduction to groundâwater pollution, seaâwater intrusion.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 466 Engineering Aspects of Chemical and Biological Processes",
    "credits": 3,
    "prerequisites": "CIVI 361.",
    "corequisites": "",
    "description": "Introduction to water purification, chemical treatment, coagulation, disinfection, special purification methods. Primary and secondary wasteâwater treatment, solution and surface chemistry, microbiological consideration; reaction kinetics, diffusion processes, membrane processes, reâaeration. Biological treatment, activated sludge process, treatment and disposal; biological reactors; aerated lagoons; trickling filter; biological nutrient removal. Tertiary wasteâwater treatment.",
    "components": "Lecture 3 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 467 Air Pollution and Emission Control",
    "credits": 3,
    "prerequisites": "CIVI 361.",
    "corequisites": "",
    "description": "Types of air pollutants. Sources of air pollutants, effects of air pollutants on health, vegetation, materials, and the atmosphere; emission standards. Meteorological considerations, dispersion of pollutants in the atmosphere, distribution and cleansing of particle matter, atmospheric photochemical reactions. Particulate pollutant control, source correction, cooling treatment; control of gaseous pollutant, point sources, odour control; measurement techniques; computer applications.",
    "components": "Lecture 3 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 468 Waste Management",
    "credits": 3,
    "prerequisites": "CIVI 361.",
    "corequisites": "",
    "description": "Solid waste; source and generation, sampling and analysis, collection, transport, and storage. Waste recycling, physical and chemical reduction; drying; energy recovery; disposal of solid waste. Sanitary and secure landfill planning, site selection, design and operation; chemical and biological reactions. Hazardous waste, chemical and physical characteristics, handling, processing, transportation, and disposal. Resource recovery alternatives, material exchanges, hazardous waste management facilities, incinerators, landfills.",
    "components": "Lecture 3 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 469 GeoâEnvironmental Engineering",
    "credits": 3.5,
    "prerequisites": "CIVI 361.",
    "corequisites": "",
    "description": "Structure and surface chemistry of soil, ion exchange, hydrolysis equilibrium, adsorption. Biochemical degradation, toxic contaminants. Mechanical and thermodynamic equilibrium in soil. Geotechnical considerations in environmental design; soil decontamination. Barrier technologies and soil interaction. Landfill covers and leachate collection systems; subsurface investigation, soilâgas survey.",
    "components": "Lecture 3 hours per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 471 Highway and Pavement Design",
    "credits": 3,
    "prerequisites": "BCEE 371;CIVI 321.",
    "corequisites": "",
    "description": "This course covers the following topics: design criteria, including capacity and level of service, route alignment and rightâofâway considerations, geometric design, earthworks and construction practices; pavement materials and tests; flexible and rigid pavement design procedures including subgrade, base, and surfacing characteristics, loads, stresses in pavement systems, material characterization, pavement response models, effects of natural forces, and construction practices; pavement management; computer applications; geometric and pavement design projects.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 474 Transportation Planning and Design",
    "credits": 3,
    "prerequisites": "CIVI 372.",
    "corequisites": "",
    "description": "Transportation planning process; data collection and demand analysis; trip generation, trip distribution, modal split and route assignment; forecasting travel patterns. Design of transportation facilities: street sections, intersections, and parking areas. Computer applications and design projects.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 483 Hydrology",
    "credits": 3,
    "prerequisites": "CIVI 381.",
    "corequisites": "",
    "description": "Weather elements; precipitation, stageâdischarge relations; evapoâtranspiration; groundâwater flow; streamâflow hydrography, unit hydrography, synthetic hydrographs; laminar flow; hydrologic routing; instantaneous hydrograph; hydraulic routing, method of characteristics, kinematic routing; statistical analysis, confidence intervals, stochastic generator, autoregressive model; applications of hydrology.",
    "components": "Lecture 3 hours per week; Tutorial 2 hours per week",
    "notes": null
  },
  {
    "title": "CIVI 484 Hydraulic Engineering",
    "credits": 3.5,
    "prerequisites": "CIVI 381.",
    "corequisites": "",
    "description": "Development of surface water resource; basic measurements in hydraulic engineering; storage reservoirs; practical problems; runâoff characteristics of natural steams; probabilistic models; control structures; economic analysis; production function; project optimization; energy dissipators; sediment transportation; elements of river engineering; navigation; control of floods; computer modelling application. Design examples.",
    "components": "Lecture 3 hours per week; Tutorial 1 hour per week; Laboratory 2 hours per week, alternate weeks",
    "notes": null
  },
  {
    "title": "CIVI 490 Capstone Civil Engineering Design Project",
    "credits": 6,
    "prerequisites": "",
    "corequisites": "",
    "description": "The project of each team will encompass the integrated design of at least two subâdisciplines of civil engineering to achieve high performance at reasonable cost. Through case studies and literature survey, students learn the information gathering and decision/design process, problem resolution, and aspects related to management, teamwork, and communication. Students registering for this course must contact the course coordinator for the detailed procedure.",
    "components": "Lecture 3 hours per week, two terms",
    "notes": "Students work in groups under direct supervision of a faculty member."
  },
  {
    "title": "CIVI 498 Topics in Civil Engineering",
    "credits": 3,
    "prerequisites": "",
    "corequisites": "",
    "description": "This course may be offered in a given year upon the recommendation of the Department and approval of GCS Council. The course content may vary from offering to offering and will be chosen to complement the available elective courses.",
    "components": "Lecture 3 hours per week",
    "notes": null
  }
]
